[
    {
        "reviews": [
            {
                "review_header": "Update:absolutely the best sport earbuds so far. Caution! Amazon version is different than Bestbuy's!", 
                "review_text": "Pro: 1.The most comfortable sports Bluetooth earbuds after tried Jarv NMotion, Plantronics BackBeat GO 2, Jabra SPORT+ and JayBird BlueBuds X Sport (I also tried Powerbeats2 last month, returned on 2nd day because I had trouble pairing it with my Galaxy S4, and music cuts about every 10 - 15 seconds) . It comes with 3 sets of ear wings (L/M/S) and 4 sets of buds (L/M/S/XS). Once you find the best combination. It just feels so comfortable in your ears. It also come with a carrying case which protects the earbuds very well. 2. Durable and innovative design. Plus, it has a heart rate monitor! The heat rate monitor works with apple health right away. It is also quite accurate. I compared it with Garmin Vivofit heart rate chest band and Samsung Gear fit. The readings are only off by 1 or 2. Now for Sport Pulse, you don't notice anything different while wearing it. But chest band, for me, is a bit uncomfortable to wear during work out. And, Samsung's heart rate sensor requires user to stay steady and its accuracy and sensibility disappear if there is sweat between the watch and you wrist. So, I would say this is the best sports gear with heart rate monitor in the market now. 3. Impressive software. I had it run on both Android 4.4.2 (on At&t Samsung Galaxy S4) and iOS 8.1 (on ipod touch 5th gen). I did not have any crash at all. The distance readings were identical to my fitbit flex readings while working out with both devices at same time. Cons: I had to put this negative testimony here because it dead on me on the 44th day (got it on Oct. 3rd, working properly till Nov. 14). I tried to stop my music and turn it off after my routine gym work out. None of the bottoms were working. After a few times trying to turn it off by long holding the power bottom, it was finally off. However, when I turned it back on, the led stayed at purple and it just stopped working (Led should flash green when turns on, red when off, and purple after firmware update). Unfortunately, I was not able to find any possible reason and solution on Google. And I have passed the 30 day return period from Amazon. My only hope is Jabra support team would respond to my email asap (I have seen a few reviewer claims that they did not get feedback). Other thoughts: again this was the best sport bluetooth earbuds in the market. I go to gym twice a day, average 2 hrs. Regular running distance was 2 miles at 9 mph. As a heavy sweater, I was very happy and satisfied that it could stay in my ear all the time without any adjustment and never fall off. If it is not dead, it is absolutely a FIVE star product. I'll keep this updated once I have response from Jabra support team. Please also feel free to ask questions. Update 11/21/2014: Jabra support team responded to my claim with 3 business days. The communication went back and forth, they insisted it was just software malfunction and wanted me to reinstall the new 3.8.0 firmware and factory reset the earbuds. I did reinstallment 4 times and reset several times, but the bottons were still not working except power on and off, and the battery started malfunctioning which was not able hold any charge. Then I sent them a video showing how mine was not working. They finally allowed me to return it, and hopefully I'll get the replacement after Thanksgiving. I will keep y'all posted. Below is an important fact I found out, please make sure read this and see my pics: I was one of owners who bought the earbuds right after it came available on Amazon, and I have seen many of the early birds had some similar problem as I had. So I started thinking this might be the first batch Amazon had in stock was not good. Then I pick up one in Bestbuy after I put mine in the mail. The new set I have is working perfectly even with the old 3.5.0 firmware (3.8.0 was released in mid October), and I also noticed that this one is different than the Amazon version. Physically, I don't see any difference. But the accessories and the packaging are totally different. In my picture, the left one is the Bestbuy version and the right one is the Amazon version. You'll see that the Bestbuy one comes with 4 sets of earwings and on the back it says \"Powered by PerformTek\". In contrast, the Amazon version comes with only 3 earwings and you'll the coloring on the packing for the earwings is different. On the back, the Amazon version does not have \"PerformTeck\" Logo, but has \"DOLBY\" and a tiny sticker says \"Onlu on Bluetooth smart ready devices. The inside of the packaging is identical except a bit coloring difference. Another difference is on the Barcode the Bestbuy version has \"41/M\" on the upper left corner and the Amazon one has \"37/M\", sorry, I did take pic for this since I don't not want to show my S/N, but I am guessing this might be the batch number, so the Bestbuy one is a later manufactured version. Anyway, if you have the earlier version and already have some malfunctions, I would strongly suggest you to return it and get the newer version. I hope my review would help you make decision before Black Friday shopping. Again, feel free to ask questions. Update 11/26/2014: Finally updated video of the malfunction, and pictures comparing Amazon and Bestbuy version.", 
                "review_comment_count": "5", 
                "review_posted_date": "14 Nov 2014", 
                "review_rating": "5.0 ", 
                "review_author": " Li Tian"
            }, 
            {
                "review_header": "Updated reviews 2016", 
                "review_text": "Update to my original review. I have had these earbuds for a little over a year now, first set was awesome for about 9 months then quit working properly, would not register correct heart rates. Jabra was very good about re-placing them, I am now on my third set now still none work properly inaccurate heart rates which pretty much render them very expensive music buds. Waiting on another replacement set which takes up to 2+ weeks to get, when these fail to work as I'm sure they will I won't both going through the process of returning them again. So having said this I would no longer recommend these earbuds, don't waste your money. Follow Up: Well I have received my third set and so far they have worked flawlessly, and I have to say when they work they really are cool! Also on another note, Jabra contacted me out of the blue to apologize for the problems I had and to notify me they were sending me a set of their Jabra Coach earbuds no charge for my inconvenience. So no matter the problems I had with their earbuds working properly Jabra has gone way above and beyond to stand behind their product.", 
                "review_comment_count": "2", 
                "review_posted_date": "14 Jul 2016", 
                "review_rating": "3.0 ", 
                "review_author": " MStewart"
            }, 
            {
                "review_header": "Do not buy this product if you intend to use it while working out!", 
                "review_text": "Unit broke down after a week and a half of usage. Usage details: - used 6 times with heavy sweating on cardio days (50 mins of running) - used 5 times with moderate sweating on lifting days (90 mins per session) - total number of days used: 11 (Dec 26 - Jan 5) Customer service provided canned responses to try and resolve the issue (i.e., try using different chargers, updating firmware etc) and tried to stop me from returning the product to Amazon by offering a replacement. After being referred to the local Jabra distributor in the Philippines, I was informed that the local distributor does not have any arrangement with Jabra regional office to replace broken units. After reading the other 1 star reviews for this product (which I stupidly ignored thinking that they were just unlucky customers), I am opting to return this for a full refund since it seems that replacement units have a high probability of breaking down as well (one buyer has received 5 replacement pairs and all of them broke). It's a shame that the product was built so poorly. It could've been a great product, I honestly enjoyed using it while it worked. tl;dr: Do not buy this product if: - you intend to use it while working out - you are a sweaty bastard - you think that a pair of $200 wireless earbuds should last longer than 11 uses - you live in a third world country where local distributors are not bound by the warranties provided by the manufacturer Do buy it if: - you're feeling lucky and believe that you'll receive a properly built unit - think it's reasonable to buy earbuds that will cost you more than $10 per use - you're fine with requesting for replacements on a bi-monthly basis", 
                "review_comment_count": "", 
                "review_posted_date": "07 Jan 2016", 
                "review_rating": "1.0 ", 
                "review_author": " John Funtanilla"
            }, 
            {
                "review_header": "Battery life of 3 weeks. Poor Quality Product.", 
                "review_text": "I used the Jabra SPORT PULSE Wireless Bluetooth headset for about 3 weeks of daily use, twice a day: 20-30 minute cardio sessions, and 1 hour weight lifting sessions each day. After 3 weeks, the product randomly disconnected from my ipod, and would no longer hold a battery charge. I returned it via Amazon and received a replacement in a few days. Once again, after 3 weeks of use, the product died, and would no longer hold a charge. I was very careful with the handling and care of my earbuds, as they had cost nearly $200. I'm now back to my old Bose Sports buds, and am replacing the Jabra set for a full refund. I even tried calling the 1-800-327-2230 Jabra Customer Service line first, only to find that the contact number was disconnected. Poor quality product, and sad service. I am thankful Amazon has ethical practices.", 
                "review_comment_count": "", 
                "review_posted_date": "02 May 2015", 
                "review_rating": "1.0 ", 
                "review_author": " S.Sonata"
            }
        ], 
        "ratings": {
            "2 star": "12%", 
            "1 star": "32%", 
            "4 star": "15%", 
            "3 star": "12%", 
            "5 star": "29%"
        }, 
        "price": "$99.00", 
        "url": "http://www.amazon.com/dp/B00N2359DU", 
        "name": "Jabra Sport Pulse Wireless Bluetooth Stereo Headset with Built-In Heart Rate Monitor"
    }, 
    {
        "reviews": [
            {
                "review_header": "Defective and Disappointing", 
                "review_text": "Won't charge at all. Tried using the charger it came with and it wouldn't work. Tried using 3 different brands and 1 brand new charger...still nothing. It refuses to charge and flashes red to blue then powers down. Extremely disappointed.", 
                "review_comment_count": "", 
                "review_posted_date": "05 Apr 2017", 
                "review_rating": "1.0 ", 
                "review_author": " ConfusedEternall"
            }, 
            {
                "review_header": "I know these are inexpensive headphones but the feel like they're very fragile and will break easily", 
                "review_text": "Not a fan. I know these are inexpensive headphones but the feel like they're very fragile and will break easily. I also don't like where the on/off switch is. It's on the top of on of the cans and the head band makes it hard to read, see and activate. For my big head they're pretty tight too. For my six year old, they fit fine. But for a six year old they probably won't last long.", 
                "review_comment_count": "", 
                "review_posted_date": "09 Apr 2017", 
                "review_rating": "2.0 ", 
                "review_author": " J. G. Gillette"
            }, 
            {
                "review_header": "Great price. Received them on time", 
                "review_text": "Great price. Received them on time. Lasted about a month or two before the ear cup began separating. Fun while it lasted.", 
                "review_comment_count": "", 
                "review_posted_date": "11 Apr 2017", 
                "review_rating": "3.0 ", 
                "review_author": " SW"
            }
        ], 
        "ratings": {
            "2 star": "33%", 
            "1 star": "33%", 
            "3 star": "34%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B06XPCN4WL", 
        "name": "FX-Victoria Headset for Kids, Men and Women(Black)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Strongly recommend this headset.", 
                "review_text": "When I decided to buy a bluetooth headset to replace my old style, I have been searching it for a long time in Amazon site. Oh, so many kinds of headphones, I don't know which one I will buy. Because I mainly listen to music while doing sports , so I prefer this ear hook headphones. I've even seen TaoTronics bluetooth headset before. Anyway they have buttons on the line of ear hook headphones, just like my old one, I hate this kind of headset. When I exercise, the buttons will rub my skin and make it red. So I decide to buy this headset. When I received it, I can't wait to open it. After I try it, I firmly believe that my choice is the best. This headset line is smooth, very soft, and the design of the flat wire of headphones line won’t knot when doing sports. Three different sizes of ear plugs are easy for me to choose suitable one , and they are very soft, less painful even with long time wearing. The radian of ear hook is soft silicone, it's just firmly fixed in my ears, I tried to get rid of it when I was in the sports but it remains still. Strongly recommend you this headset", 
                "review_comment_count": "", 
                "review_posted_date": "25 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Raymond"
            }, 
            {
                "review_header": "I will miss such a wonderful earphone if I mis-trust those negative comments", 
                "review_text": "It upsets me when I am making the decision to buy this earphone because there are some negative comments on its link and sound quality. And I did not match my first Bluetooth earphone with my smart phone, and the seller redirected me to the right link and I just find the earphone I am looking for.I was concerning about the sound quality as well. I have a pretty high requirement on sound quality. I have bought 5 sets of earphone but none is satisfying.It is not until I tried this one, and luckily it has replaced all the previous earphones I have just bought. It is even better than the 50+$ one in its low sound effect. I have tried many genres of songs with it, it is absolutely what I am looking for! While any Bluetooth earphones or headphones inherently induce a very slight loss in sound reproduction, rest assured. You will be blown away by the sound. I can’t figure out why there is complaint over its sound effect. Its material and making are beyond my imagination.Ear hanger, cap and wires are all made of soft and tender rubber. It is flexible and comfortable to skins. The unique design of hanger and cap will leave no pain for your ears whenever how long your wear it. I have small ears and I chose the smallest ear cap one, which exactly fits me and will never drop when I am running. It is exactly a sports earphone. I will miss such a wonderful earphone if I mis-trust those negative comments;if that happens, I will definitely regret!", 
                "review_comment_count": "1", 
                "review_posted_date": "26 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Tiffanie Whitfield"
            }, 
            {
                "review_header": "I would recommend to everyone", 
                "review_text": "My brother enjoys to take a each night after work to relax and had recently lost his bluetooth headphones so I picked these up for him. It came with beautiful solid package, and there are many gadgets including bluetooth earphones, usb cable, user manual and three ear tips for replacement. These bluetooth earbuds are great! I had him call me so we could test out sound quality on the phone and we were both able to speak in normal tones and could hear each other with out yelling. Great high definition sound quality is also wonderful. Amazing noise cancelling with superb sound quality. Easily fits in the ear. So far he loves it! All in all, I would recommend to everyone who is looking for an excellent headphone with good quality.", 
                "review_comment_count": "", 
                "review_posted_date": "03 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Justin V."
            }, 
            {
                "review_header": "must say I was surprised but absolutely glad I purchased these.", 
                "review_text": "I needed a set of wireless earbuds that were going to give me what I need as in: comfort, durable, quality and dependability. I searched for a few weeks to only come back to these. The ear loops are very soft and flexible which seemed odd at first until I wore them and then I completely understand as they are way more comfy than the stiff ear loops. The clarity of the sound is far better than I could have expected and was just as good, There's a richness to the acoustics with a deep bass yet they do not seem With distort, even when having the music on full volume. I must say I was surprised but absolutely glad I purchased these.", 
                "review_comment_count": "", 
                "review_posted_date": "29 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Matthew H."
            }, 
            {
                "review_header": "I cannot explain how much I love these wireless earbuds.", 
                "review_text": "I cannot explain how much I love these wireless earbuds. They are cutting edge, having the latest 4.1 bluetooth technology, which made for a super easy connection to them the first and anytime. I often wear the bluetooth headset, listening to music, while working around the house. The headphone allow you to answer calls, skip tracks and pause/play your music without the need to reach for your phone. They are really light and the sound the sound quality is loud and clear. Work great with my phone, would buy it again!", 
                "review_comment_count": "", 
                "review_posted_date": "10 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Sheila"
            }, 
            {
                "review_header": "I think it would be difficult to get any of similar quality for the same price.", 
                "review_text": "I wasn't sure I'd like the design and it's always hit and miss with quality because there are too many unknowns, but this product is superior in design, bluetooth earpiece In-ear ergonomic design and soft earhook design ensure you wear comfortably & remain stable in your ear. In performance, as far as using them while performing physical activity - wore them mountain biking the other day and they are fantastic. Sound is great quality. Had to lower the volume because it delivers a punch. Blocks out all noise around you. Decent bass, the value of these headphones is excellent compared to others on the market and I think it would be difficult to get any of similar quality for the same price.", 
                "review_comment_count": "", 
                "review_posted_date": "19 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Fabiana A."
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "10%", 
            "4 star": "8%", 
            "3 star": "3%", 
            "5 star": "72%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01N6MLPK0", 
        "name": "Anlo Bluetooth Headphones Wireless In Ear Earbuds V4.1 Stereo Noise Isolating Sports Sweatproof Headset with Mic, Premium Bass Sound - Black"
    }, 
    {
        "reviews": [
            {
                "review_header": "smart", 
                "review_text": "Connects to my iphone 6s easily and quickly: I've tried several brands and styles of headset and this is the one for me. Connects to my iphone 6s easily and quickly. The controls are simple and easy to use. The on/off switch is in a good place, and you don't have to guess if the device is on or off. People never complain they can't hear me with this headset. I can hear them. Charges quickly, and when fully charged I get 20+ hours of talk time. That's great. I added an ear loop (which was included) and the piece is stable as can be. It's quite light. I give this headset a solid recommendation.", 
                "review_comment_count": "", 
                "review_posted_date": "09 Dec 2016", 
                "review_rating": "5.0 ", 
                "review_author": " angela"
            }, 
            {
                "review_header": "A good price, It's easy to use", 
                "review_text": "A good price, It's easy to use. Good sound,Sometimes in terrible environment and the people I talk to seem to hear me fine. I drive a big noisey truck and the noise cancelling seems to work too.Excellent product!", 
                "review_comment_count": "", 
                "review_posted_date": "12 Dec 2016", 
                "review_rating": "5.0 ", 
                "review_author": " eason"
            }, 
            {
                "review_header": "Decent gift for friend!", 
                "review_text": "The price is right and looks nice and simple at least . it arrived fast and I immediately put them to use. Battery life is acceptable ranging like 6 hours.the bluetooth connectivity is easy ,and sound is crisp and clear. not bad for the budget.", 
                "review_comment_count": "", 
                "review_posted_date": "05 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " S.Y."
            }, 
            {
                "review_header": "Finally! Found a good one", 
                "review_text": "I drive for a living so I am required to use hands free. I have tried several different units, they are either uncomfortable, have terrible noise cancelling or are just junk. My friends, family and coworkers all say the sound clarity is great on their end and on my end I know it's great. It's comfortable enough I've gone to bed with in my ear. I definitely recommend it", 
                "review_comment_count": "", 
                "review_posted_date": "28 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Jason"
            }, 
            {
                "review_header": "Have had this replacement for a couple of weeks now and works great! Syncs two phones at once", 
                "review_text": "Customer service was very friendly and quick to fix the issue with first one received that wouldn't sync 2 phones simultaneously as listed. Have had this replacement for a couple of weeks now and works great! Syncs two phones at once, both an IPhone and Samsung and very easy to use. Very happy with product and customer service, would buy from again.", 
                "review_comment_count": "", 
                "review_posted_date": "02 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Renee"
            }, 
            {
                "review_header": "Caution, I don't recommend", 
                "review_text": "Easy to pair but does not stay paired. It looses its connection only 3 feet away from device. When it does work, sound quality is good, buttons seem to work fine. Simple headset to use. I would not recommend buying this for the connection issue.", 
                "review_comment_count": "1", 
                "review_posted_date": "23 Jan 2017", 
                "review_rating": "2.0 ", 
                "review_author": " GreatWhiteShark"
            }, 
            {
                "review_header": "Otherwise a great bluetooth", 
                "review_text": "Glad that I didn't listen to all the negative feedback. This product is awesome. Yes, Ill agree that the on/off switch is very close to the top button.but its manageable, and doesn't hinder this product at all. Great volume and speaker. I would say if anything is annoying its the very loud buzzing that occurs when you walk too far away from your phone. Otherwise a great bluetooth.", 
                "review_comment_count": "", 
                "review_posted_date": "10 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Mike"
            }, 
            {
                "review_header": "This is definitely one of the best options for both of those", 
                "review_text": "I've recently gone through a few Bluetooth headsets both for calling and listening to music. This is definitely one of the best options for both of those. Call and music quality are very clear, and this is one of the few headsets I've found that actually comes anywhere close to its advertised battery life. The controls are easy to use and for music listeners it does play/pause and skip songs from the controls without having to pull out your phone or ipod. It also comes with a micro usb attachment headphone that allows it to mimic a Bluetooth headset. The only criticism I have is that the headset ear piece could be shaped a little more comfortable to sit in your ear. However it is still very passable in that regard and once secured properly can stay on your head all day very easily and, more importantly, will actually last all day.", 
                "review_comment_count": "", 
                "review_posted_date": "29 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "12%", 
            "4 star": "8%", 
            "3 star": "3%", 
            "5 star": "70%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01LB1AK7O", 
        "name": "wisdomspot BT621B Wireless and Hands-Free Bluetooth Headset – Black"
    }, 
    {
        "reviews": [
            {
                "review_header": "Sounds comparable if not better than Beats", 
                "review_text": "These are amazing headphones. We have a 23 year old son who has the higher end Beats on-ear-headphones. When he tried these Amazon Basics he said they sounded better than his Beats. He said that's a brand name for ya. That's coming from a 23 year old. To me the sound is very close. I was expecting there to be a difference in sound level, or boxier bass sounds. Not so, these headphones are just as clear as Beats. The main difference is the build. Beats have a harder plastic head piece that slide over an aluminum piece. The Amazon Basics is mostly plastic. The Beats cushion also feels better. These headphones do not fold up. They do adjust for size of your head. They also come with a cloth carrying case, and an 'L' style adapter with a chord about 3 feet. Honestly with the sound being the same as Beats if not better, the fact that the pieces are plastic doesn't bother me at all considering you are paying upwards to $100-$200 for Beats and $14.99 for these Amazon Basics. I was shocked at the comparison in sound between the two. I tried them with several different styles of music from The Doors, Def Leppard, Zeppelin, Dextor Gordon, Lee Morgon, Charles Mingus, Ornette Coleman, Stan Getz, Mussorgsky, Stravinsky, Mozart, and even tested it on yes, my OTR App. Really impressed with these head phones. Right now watching movie on iPad while family watches movie on tv. I can't hear what they are watching. They also have noise canceling ability. That was one of the reasons I got them and was surprised at how well they cancel outside noise. I got them for working out. I was tired of my ear buds falling out. I also workout at a small gym who keeps the level of their house radio rather loud and its annoying to be listening to my music and theirs at the same time. I also got them for work to be able to tune out my workmates when they are talking or listening to things on their computer. These work great for that. All in all these are great headphones. Would highly recommend them. Fast 2-day shipping that was on time. Don't miss out on this price. I will probably get another pair at $14.99 it's a great value for a basic set of on-ear-headphones. Update 3/5/17: Over a year later and the headphones have held up great, just like new. Updated to 5 stars.", 
                "review_comment_count": "3", 
                "review_posted_date": "15 Jan 2016", 
                "review_rating": "5.0 ", 
                "review_author": " M. Johnson"
            }, 
            {
                "review_header": "Buy these or spend more than $100. There is no sense in-between.", 
                "review_text": "**Quick Review*** Overall: 3 out of 5 Sound Quality: 3.5 out of 5 Sound Trueness: 2 out of 5 Build Quality: 1 out of 5 Comfort: 2 out of 5 Noise Cancellation: 2 out of 5 Style & Appearance: 4 out of 5 Value: 5 out of 5 ***The above are based on comparing these headphones to headphones priced as high as $350. I rated these headphones “5 Stars” on Amazon because they are easily a perfect score in every category when compared to products within a $50-$80 price range.*** Full Review: I purchased these headphones after seeing the insane amount of positive reviews over a $15 pair of headphones. My headphones of choice are the studio staple Sony MDR-7506. My pair is, however, wearing out quite a bit. And before investing another $100 on a new pair, I figured I’d give this set a try. Being someone who uses headphones for audio engineering and sound mastering, my preferences are typically geared towards a “clean” or “true” sound rather than a “good” sound. In other words, I’d rather my headphones leave bad recording quality sounding bad rather than making a poor recording sound great. Because of that, I have rated these headphones on both sound “quality” and “trueness” as separate categories. I will be grading these headphones in comparison to headphones of any price range, so the below ratings will not be a reflection of comparing these headphones with comparable models at similar price. Sound Quality: 3 out of 5 For casual listening, it does not get too much better than this. The bass hits hard and these headphones can get loud without the slightest distortion. In my experience, sound quality is typically not this high until you are at least in the $60 or higher range of headphones. I won’t go so far as some other reviews have gone in comparing these to Beats Audio or Bose, but such comparisons are not completely misguided. The biggest miss for sound quality overall comes in that the headphones have a very “roomy” or “small” sound to them. Nothing ever feels live or vivid due to a limited EQ range. Where the headphones hit, they hit hard. Unfortunately, you don’t ever hear the full depth of a song with these headphones. Something is missing. Despite this, these are far superior to the sounds of most standard or high end ear buds and on par with upper-mid range ($60-$100) headsets. Sound Trueness: 2 out of 5 Without boring anyone not looking to use these for music editing I’ll simply say this: I’ve gotten far less quality with far more money. Yet, these are in no way replacing my Sony MDR-7506 for studio editing anytime soon. The sound is too bass heavy and flat. High ends are a struggle and replaced often with dull mid-tones. Mixes done exclusively with these headphones would likely have weak bass and extreme high ends through other speakers if made to sound neutral through these headphones. Build Quality: 2 out of 5 These headphones look and feel like $15 headphones. The plastic feels flimsy and cheap. They are very light, in a bad way, as well. Handling these headphones makes me very worried I will break them quite easily. Time will tell if that plays out to be true. Regardless, for $15, it is not really going to make me very upset if these do break within a year. Comfort: 2 out of 5 These headphones are a bit too small to be very comfortable on the ears long. They grip tight and stay put, which is a plus, but the cushions press against the ear causing that “warm” feeling. These headphones are not for marathon uses. I did like that they have a nice cushion on the arch on top of the head and the fact that the buds themselves are capable of pivoting is another nice feature. Noise Cancellation: 2 out of 5 This comes down to the size again. Because the headphones do not fully envelope the ear, and rather rest upon the ear, they are not capable of fully muting external noise. These headphones do a pretty decent job at tuning out the world around you however, but it is usually due more to their loudness than their actual noise elimination. Style & Appearance: 4 out of 5 Sleek, simple, matte, compact. You can’t go wrong with simple and sweet. They also come with a very nice felt case to carry in, an unexpected bonus for such an inexpensive pair of headphones. Only complaint is, oddly, the lack of branding. A little Amazon logo or something would actually tie this piece together nicely. Without any branding, you feel more like you have a pair of headphones picked up at a convenience store. This will be a positive to some, but for me the absence of branding added to the “cheap” overall feel of the headphones. Value: 5 out of 5 This is a no brainer. You won’t get within galaxies of this quality for $15 with any other pair of headphones. Bottom line, if you aren’t going to invest more than $100 in headphones, there is no sense investing in any other than Amazon’s offering here. Period. Overall: 3 out of 5 All things considered, these are $15 headphones performing at the level of $100 headphones. You can’t go wrong. Don’t expect to throw away your Bose, Sony, or Beats headphones anytime soon as some reviewers have suggested, but these headphones will give the “average Joe” a pretty compelling reason to not invest in any of the prior-mentioned if you have not already done so.", 
                "review_comment_count": "11", 
                "review_posted_date": "28 Aug 2015", 
                "review_rating": "5.0 ", 
                "review_author": " rob"
            }, 
            {
                "review_header": "Broke after a month of use, but that's ok- Customer Service sent me a new pair within two days- free!", 
                "review_text": "I ordered these specifically because the cable only exits on one side of the unit. I've found this configuration is just easier for the kids to deal with and I'm untangling cords less often. My young audiophiles reported good sound quality before quickly becoming immersed in the world of Pixar and stopped responding to my questions altogether. I was initially very pleased, because I could have very easily spent three times as much for a comparable product. Unfortunately the plastic head band snapped within the first month of use. I'm sure I'm not The only one who has experienced this. So just be aware that there is the potential for these to snap along a molding line along the headband. The warranty coverage is excellent however and once I reported the issure to Amazon a new set was sent same day! These headphones are worth a look, imho.", 
                "review_comment_count": "", 
                "review_posted_date": "08 May 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Public Hair"
            }, 
            {
                "review_header": "Have a big head?", 
                "review_text": "If you wear a XL fitted hat or larger don't buy. Very tight. Other than that great sound very comfy.", 
                "review_comment_count": "1", 
                "review_posted_date": "29 Apr 2015", 
                "review_rating": "3.0 ", 
                "review_author": " Jeff"
            }
        ], 
        "ratings": {
            "2 star": "6%", 
            "1 star": "5%", 
            "4 star": "18%", 
            "3 star": "7%", 
            "5 star": "64%"
        }, 
        "price": "$14.99", 
        "url": "http://www.amazon.com/dp/B00NBEWB4U", 
        "name": "AmazonBasics Lightweight On-Ear Headphones - Black"
    }, 
    {
        "reviews": [
            {
                "review_header": "The best value currently available", 
                "review_text": "I have purchased multiple headsets. I've had 2 pairs of the Logitech g930's, another pair of the wired version, I had some white and blue set, I had some terrible on the ear ones... I have been through quite a few headsets over the past couple of decades. All of them break within a year. Either I forget their on my head and rip the cord out or in the case of the wireless ones, one of the ears will simply decide they are done producing sound. Or, in my favorite case, a kid is spinning in my chair wrapping and inevitably snapping the cord. My point is that I have been on a quest for quite some time to find the best \"value\" headset instead of paying the big bucks for the highest quality. These are the ones. The sound quality is good enough to satisfy any one who isn't an audiophile and the mic doesn't get me any complaints from friends. The best part to me though is that these were comfortable out of the box. I'm used to a couple weeks of pain breaking in a new set, but these felt good for hours even on day one. That being said, I'm going to point out the only problem I have with these (and I don't think it's a big enough deal to drop a start). The volume/mute/sound control is about a third of the way down the cord which puts it at the perfect butt-dialing level. It's really easy to adjust in your chair and end up muting your mic or turning off the sound to a movie. I think the theory was that placing it there instead of on the headset makes it easier to use because it's visible, but that's just wishful thinking. If there was any product testing at all, this feature would have been scrapped on day one.", 
                "review_comment_count": "", 
                "review_posted_date": "01 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " s.stevens"
            }, 
            {
                "review_header": "Comfortable headset for gaming for both female and male HEADS!", 
                "review_text": "We purchased two headsets to play World of Warcraft. They came within two days and were shipped securely. We ordered the red ones as it matches with my husband’s Alien Ware computer. We quickly unpacked them and started playing right away. PRO: The headphones are light on our heads and fit very nicely on both of us with some adjustments. I have a smaller head circumference (female) and of course, my husband has a larger one. We were skeptical that these were going to work on BOTH of us but surprisingly they did. Absolutely zero static or distortion while playing music or using the mic. These are our favorite Gaming headset so far for the price. The vocal on this thing is amazing, I can hear everything while on steam and chat mode perfectly. This model is pretty cool, The side emblem lights up to red to make it look flashy. Even in style, It still come with all your basic button features. It does have a mute button for both the mic or music/audio mode. The mic can be adjusted up and down so when you simply want to listen to music or game on your own. It comes with an extra-long cord. CON: not noise-canceling. You are able to hear the background noise of others, while they speak or when they are silent. We attempted to figure out this feature but couldn't so we have to deduct one star due to our dissatisfaction as it clearly states it is noise-canceling. Overall, we are happy for the most part. If you found my review helpful, please let me know by clicking yes or feel free to leave me a comment. I actively check my Amazon account.", 
                "review_comment_count": "7", 
                "review_posted_date": "15 Jul 2016", 
                "review_rating": "4.0 ", 
                "review_author": " D. Ramirez"
            }, 
            {
                "review_header": "My Boyfriend Thought They Were $100", 
                "review_text": "Had Amazon deliver these to my boyfriend while he's at his parent's for summer break as a surprise so we could Skype and play, he loves them! He sounds amazing on the mic, very clear and WITHOUT installing the software. He uses them to play league and says they sound awesome and got mad at me for \"spending too much money\" on the present because he thought they were like $100 for the quality and look, if only he knew the real price haha. BUY THESE!", 
                "review_comment_count": "2", 
                "review_posted_date": "26 May 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Khalysee"
            }, 
            {
                "review_header": "Download the driver, get a free Trojan at no extra charge!", 
                "review_text": "Fairly uncomfortable, but i suppose it works on Windows 10. Tried to install it on 7 and it wouldn't auto install with windows update. i pulled the driver package down from their site, and ran it against virustotal.com, and it should up as infected with a trojan. This is of course deplorable, but not unusual for a chinese manufacturer. As such I highly recommend not downloading the driver from the internet. I didn't use the cd they included as i haven't had a cdrom in 5 years. Not sure if it was infected as well. To be fair, they could just be really crappy at Internet security; and just got the malware included unbeknownst to them by a malicious 3rd party, but the affect on its customers is the same.", 
                "review_comment_count": "", 
                "review_posted_date": "18 Dec 2016", 
                "review_rating": "2.0 ", 
                "review_author": " Jason B. Anderson"
            }, 
            {
                "review_header": "All Your Headsets Are Belong To Us", 
                "review_text": "These work great. The English descriptions that are, I assume, translated from Chinese are hilarious on the box as well.", 
                "review_comment_count": "", 
                "review_posted_date": "11 Oct 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Chris H."
            }, 
            {
                "review_header": "This Headset is great if you dont wanna drop 50+ dollars on a ...", 
                "review_text": "This Headset is great if you dont wanna drop 50+ dollars on a headset. They look nice and have a nice weight to them so they dont feel as cheap as i anticipated. They're quiet comfortable as they are over ear. Braided cable is a plus and it only uses one connection source: USB. It has in line volume and mic control and when the mic gets muted, the little control hub lights red. Only thing i wish could be different is to have the inline control hub higher up on the cable closer to me. But otherwise this is basically a 10/10 buy", 
                "review_comment_count": "", 
                "review_posted_date": "15 Jun 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Kareem Ayoub"
            }
        ], 
        "ratings": {
            "2 star": "6%", 
            "1 star": "12%", 
            "4 star": "18%", 
            "3 star": "7%", 
            "5 star": "57%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01A0VQOCQ", 
        "name": "Sades SA902 7.1 Channel Virtual USB Surround Stereo Wired PC Gaming Headset Over Ear Headphones with Mic Revolution Volume Control Noise Canceling LED Light (Black/Red)"
    }, 
    {
        "reviews": [
            {
                "review_header": "The quality of the headphone is great with this reasonable price", 
                "review_text": "The headphones are black and red. The quality of the headphone is great with this reasonable price. Product arrives in two days which was unexpected. The headphones are compatible with many models of phone and computer. The package of the product actually looks like it costs over 20 bucks or more at a store. The product arrived undamaged. The quality is good and the voice of the sounds are very clear. This is a gift for a friend who plays video games at her dorm. I am sure she will like the product and would recommend this product for anyone with tight budget who want a good gift for their friends.", 
                "review_comment_count": "", 
                "review_posted_date": "15 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Lynn"
            }, 
            {
                "review_header": "I wasn't really sure how to pick out a good headset, so I mostly focused on price and ...", 
                "review_text": "Get these. I wasn't really sure how to pick out a good headset, so I mostly focused on price and look. These are great. They are very comfortable. I don't wear them for gaming, but I work online and wear them for 4 or so hours at a time. They fit great and the adjustable headband is perfect. I often forget I'm wearing them. The earphones block out other noises and the sound quality is excellent. The microphone is in the perfect spot--not covering your face, but close enough to your mouth that the sound quality is clear. For the price these are a steal.", 
                "review_comment_count": "", 
                "review_posted_date": "07 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " me"
            }, 
            {
                "review_header": "Durability is bad, move on.", 
                "review_text": "Review for the Leshp Over-Head wired headset. Among the sub-20 dollar headsets I'v bought, these were the first I bought because it had great reviews. Which isn't completely unfounded, here is what I'v liked. Pros -Price point: 5 Stars I don't think you can ask for much more here. I paid 10$ and got free shipping with prime. -Comfort: 4 Stars They are very flimsy and light weight. If you are an adult they might be harder to get to lay over your ear, which I'm finding is common with cheap headsets. I have a medium to Large size head I had to almost max them out to get them to lay over my ear without bowing out. For me this is not a big issue because I am buying these for kids around 12. However with being said they were not uncomfortable, I like the size of the cup which makes these an over the ear design rather than on the ear. It does has some padding on the top which I thought was a nice touch and somewhat impressive for the price as some headphones for more don't. -Microphone: 4 Stars I almost want to give the mic 5 stars because it may be close to the best you can get for this price. Of course it is not noise cancelling and you can hear everything that is going on in the room but for me if it works, doesn't have a terrible echo (Ive had this problem with other cheap sets) and I can hear the other person loud enough, thats a win for me. It doesn't even have the \"I'm in the bathroom\" effect that most of these cheap mics have. It also has a microphone mute switch and plenty of cord length. Sound Quality: 5 Stars I was impressed with the sound quality, its stereo and wasn't overly dull. It has a volume wheel on the cord as well. Con [it's a big one] -Durability: 2 Stars The only reason this headset gets 2 instead of 1 star is because some of these cheap headsets come broken when you get them in the mail. Maybe mine was shipped more carefully but I can say that it was working great when I got it. If it had continued to work for another 4 months this would have been one of the best cheap headsets on the market, but that is not the case. This one lasted about three weeks before the cord was almost completely shot. The output from the microphone was still working well but all incoming audio was very staticky. So If I was you I would move on to another headset. Overall I gave this headset 3 stars for being good in all other areas and on the off chance that someone else who buys may get one that lasts longer but as for me me I'm looking into the DLAND, UL LETTON and Afunta Headsets for around 12 to 15$ to see if they last longer. Honestly that is the number one factor I am concerned with. I am okay with a cheap headset not sounding good, having a bad echoey mic and being uncomfortable, if it lasts for 6 months. **Disclaimer** Everything I say in this review is in reference to it being a sub 20$ headset. Headsets like this will break, it's not a matter of if but when. I am on the hunt for the best headset around the 10-15 dollar range because I am buying a lot of them and cannot afford to spend 25 plus per headset. If your looking a legitimate affordable headset to game for a long time with, I would suggest the \"Turtle Beach Ear Force Recon 50x\" which you can get for about 25$ or if you can spare 10$ more, the \"Logitech G230\". I have personally bought and used both and found the Recon to be a solid headset, no frills such as noise cancelation or amazing bass but comfortable and decent in every aspect. The G230's definitely give you your 10$ extra quality with a more durable build, semi-noise cancelling and removable mesh ear cups which you might appreciate if you wear glasses because they are less squeaky than pleather cups that other headsets have. I have no complaints on either of the mics but you will need a three dollar adapter for the G230's if you are a console gamer and vice versa for the Recon's on PC. All in all if you cannot spend the extra money to get something like this, I am also searching for the best sub-20 headset and that is what this review is geared towards.", 
                "review_comment_count": "1", 
                "review_posted_date": "18 Feb 2017", 
                "review_rating": "3.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "They are a wonderful pair of headphones for the price", 
                "review_text": "They are a wonderful pair of headphones for the price. I really enjoyed the clear quality of sound this set provides. It cancels out a lot of the noise. My fav game is call of duty, so I need to be able to hear people sneaking up on me. It was the perfect pair for the PS4. Easy to set up and plug in. Lightweight as well. The cushion makes for a comfortable match.", 
                "review_comment_count": "", 
                "review_posted_date": "08 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Amanda Gonzalez"
            }, 
            {
                "review_header": "Great starter set", 
                "review_text": "My 8 year old grandson is getting more into gaming with his dad and needed a set of headphones. These are a great starter set for him, especially because they are adjustable to fit his smaller head and he didn't need an adapter to use it with his xbox system. They are comfortable and he can hear everything fine, and everyone hears him fine. They play online so they talk to people all over the world.", 
                "review_comment_count": "", 
                "review_posted_date": "01 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " stlblue1"
            }, 
            {
                "review_header": "Great for meeting at work and for general music listening.", 
                "review_text": "I bought this to use for online meetings and am very happy. The microphone works well, the sound quality is good, and the unit is lightweight and comfortable. The cable is a little short, so it might not work well for all situations. I bought a cheap extension cable. Update: After 3 months I'm still very pleased with the purchase. It is surprisingly comfortable for hours at a time.", 
                "review_comment_count": "", 
                "review_posted_date": "19 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " SMA"
            }, 
            {
                "review_header": "Best Gaming Headset under $20", 
                "review_text": "I was looking for an inexpensive headset to use while gaming on my Xbox One. Plugs in great into the controller and is in my opinion the best gaming headset for under $20. It has been used almost daily and still is free of any defect or wear and tear. Great inexpensive gaming headset. No echo and picks up your voice well even with a short mic which is a problem in some headsets", 
                "review_comment_count": "", 
                "review_posted_date": "29 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Ronn"
            }, 
            {
                "review_header": "he's really happy and the only bad part is now all the ...", 
                "review_text": "Got this for my son, since he's into online gaming with friends, he's really happy and the only bad part is now all the kids want some so I'm ordering 4 more! Great for the price and they are perfect for their needs! Unfortunately on broke all of sudden. The mic piece just broke off. For the price I don't mind getting another but wish they were a bit more sturdy.", 
                "review_comment_count": "", 
                "review_posted_date": "21 Feb 2017", 
                "review_rating": "3.0 ", 
                "review_author": " Oscar"
            }
        ], 
        "ratings": {
            "2 star": "10%", 
            "1 star": "15%", 
            "4 star": "15%", 
            "3 star": "5%", 
            "5 star": "55%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01KK480Q6", 
        "name": "Gaming Headset - LESHP 3.5mm Wired Over-head Stereo Gaming Headset Headphone with Mic Microphone, Volume Control for SONY PS4 PC Tablet Laptop Smartphone Xbox One"
    }, 
    {
        "reviews": [
            {
                "review_header": "Keep up the good work Jeecoo", 
                "review_text": "I bought these headphones thinking that they were going to be quite possibly some of the worst headset that I have ever owned.... until I actually plugged them in and tested them... not only were they ACTUALLY GOOD but they were actually pretty comfortable to wear! so having said that I plan to at least list the pros and cons of this headset for the other potential buyers out there. Pros: Cheap Decently Loud Does in fact muffle outside noise (not to the point where you feel like you are wearing earplugs but still rather well) The colors are vibrant and are a nice touch to make it seem as though it is an expensive headset. There is a manual switch in order to mute your microphone rather than a button ( Take a HINT LOGITECH) The volume wheel can only turn so far and has a satisfying feel to it. The cable Length is nice and it is braided rather firmly. Cons: The foam around the ear isn't the thickest The microphone is not the clearest and the positioning is a little odd for people with larger faces ( the microphone sits at the corner of my mouth making me shift my headset forward in order to speak and be understood effectively. The lights on the headset stay on regardless of if your PC is on or off ( to some this could be a pro I suppose) It didn't come with a box ( Hey some graphics or some simple information on the box could easily make this headset a great gift for family members who love to game) I personally think that this was worth the 20 dollars that I payed to get this headset. It is comfortable for most daily uses. Jeecoo you did a good job with this headset but that being said please try and extend the Microphone length a little bit and look into making the ear foam thicker along with upgrading the quality of the microphone a little more and you honestly could make a fortune selling these affordable medium quality headsets. This is my first headset from Jeecoo.", 
                "review_comment_count": "", 
                "review_posted_date": "06 Sep 2016", 
                "review_rating": "5.0 ", 
                "review_author": " eragon1581"
            }, 
            {
                "review_header": "Overall, a cool looking headset with decent sound for a low price.", 
                "review_text": "The uploaded video was recorded using this headset's microphone. Its a comfy headset, not too tight but can feel loose. I can wear it for hours, and I wear glasses. Decent sound. The mic, is decent as well, mess around with the settings in control panel to get rid of extra static and to make yourself clearer. Quick tip, if the Kotion Logo isn't lighting up for you, extend the headphones fully, the adjusters block the light for the logo. Sorry if you have a small head like me, that's the choice with this headset it seems; bright glowing logo or snug fit on small heads.", 
                "review_comment_count": "", 
                "review_posted_date": "12 Jan 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Adriana Castro"
            }, 
            {
                "review_header": "Good for Casual User But a Big Unit", 
                "review_text": "This headset has good sound quality and the mic seems sensitive enough to use easily but not too much so that background noise is an issue. The weight is a bit more than expected, but that is likely due to the size of the unit. This set is much bigger than anticipated. The outer dimensions are about 4 inches at the vertical cross-section and slightly smaller horizontally. They look a bit large on a teen girl's head! That said, the same teen girl loves the LED lights. The inset lights fade in and out in various colors. Very 'bling' according to her esteemed opinion. At roughly $20, if you can live with the larger size, it isn't a bad deal for the casual gamer. The head strap is padded which makes it comfortable, but it does create a greater band of 'headset hair' on top! Hardcore gamers - you won't want this one because of the size/weight factor and the LED's reflect on the monitor if playing in the dark. Average users who want over-the-ear music with the option of Skype calling, etc will be happy with this product. Suggestion to Seller - add a photo with size context for users seeking or avoiding the larger unit.", 
                "review_comment_count": "", 
                "review_posted_date": "04 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " C.A.M. in U.S.A"
            }, 
            {
                "review_header": "Mic sounds great and is easily moved out of the way when ...", 
                "review_text": "I needed a replacement of my gaming headset due to an accidental tripping over the old ones cords and pulling it free from my computer in the way they were not intended to be unplugged. I headed to Amazon to purchase a cheap set to get me by until I could find a decent set since as a gamer I tend to wear these for hours upon end. I settled on the Jeecoo brand because 1. They were the cheapest 2. They were not USB, they used the 3.5mm jacks. I only needed something to tide me over and didn't want to drop the bank on a name brand set until I did my research. Let's just say that for the price I paid I was totally blown away at the quality and comfort of this headset. Mic sounds great and is easily moved out of the way when needed and I really like the volume control on the headset itself instead of imbedded into the wire. I could live w/o the changing colors on the headset but considering you need a USB to power them, I just don't plug that portion into the computer. All in all, best headset I've owned for the price hands down.", 
                "review_comment_count": "", 
                "review_posted_date": "04 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " SavageShooter"
            }
        ], 
        "ratings": {
            "2 star": "5%", 
            "1 star": "6%", 
            "4 star": "15%", 
            "3 star": "7%", 
            "5 star": "67%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01GOB77F4", 
        "name": "Jeecoo JC-G1000 Stereo Over-ear Gaming Headset with 7 Colors Breathing LED Light and Microphone - Blue"
    }, 
    {
        "reviews": [
            {
                "review_header": "- Flexible microphone - Comfortable, wipeable ear surround and head cushion - Adjustable ...", 
                "review_text": "This headset is designed for use with a PC or other gaming devices that have a 3.5mm jack. Included in the box: - Gaming headset - User manual Some device functions: - Flexible microphone - Comfortable, wipeable ear surround and head cushion - Adjustable headband - About 2 metre long cable The headset is cased in a hard plastic and the microphone can be pulled down to mouth level when talking or can be pushed up when not in use. This headset has surpassed my initial expectations of comfort and sound quality. The over ear cushions surround the ear and are soft and spongy, but the padding is uncomfortable when I wear my glasses. The sound from the headphones is way better than I expected for such a low priced gaming headset. I have used this product over the weekend and tested the microphone, firstly by recording a voice message on my pc and then listening to it just to see for myself what people would hear when I spoke to them through the retractable mic, and then with multiple hours of gaming with friends, whom all when asked, reported that they could hear me clearly. I have rated this product 5 stars because it is very reasonably priced, I would highly recommend this product to family and friends for the above reasons.", 
                "review_comment_count": "", 
                "review_posted_date": "27 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " haq nawaz khan"
            }, 
            {
                "review_header": "7/10 for audio quality |10/10 for budget | gaming", 
                "review_text": "Decent set. Little lacking in the mids but for 15 bucks its a STEAL! The mic is clear and good for gaming. 10/10 for budget phones. I use Audio Technica M50X typically so comparatively there is of course less \"fullness\" to the audio however its a very fair price. Build quality is good. They're also light too which is great because my M50X is SO heavy I get neck pains. I would recommend this set.", 
                "review_comment_count": "", 
                "review_posted_date": "11 Feb 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Christopher Ciavarella"
            }, 
            {
                "review_header": "Mic is terrible.", 
                "review_text": "I was hoping to use this for online chats like Skype or Slack, but the mic is very noisy. The headphone part is just ok and reproduces sounds satisfactorily. The folding mic, while seemingly cool, is a very bad design, as the mic is very far from the mouth and requires higher amplification. Designs with flexible cables are indeed superior. Too cheap to return, so I guess I will be looking into more expensive models. Too bad.", 
                "review_comment_count": "1", 
                "review_posted_date": "03 Mar 2017", 
                "review_rating": "2.0 ", 
                "review_author": " AL"
            }, 
            {
                "review_header": "They're comfortable and the plastic feels good", 
                "review_text": "They're comfortable and the plastic feels good. The volume control is a bit large, but it's easy to adjust the sound (possibly because of its shape). They are smaller than I thought they were going to be, but not by much. The ear pads are about 3in by 3.5in to give you an idea of their size.", 
                "review_comment_count": "", 
                "review_posted_date": "14 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Coyote Leather"
            }, 
            {
                "review_header": "has great sound quality", 
                "review_text": "\" I have rate this product 5 stars because it is very reasonably prices, has great sound quality, and it is comfortable over a long period of use. Included in the box: - Gaming headset - User manual - In-line microphone on/off switch and volume control - 2 metre long cable Adjustable headband This headset can work for PC, if you would like to use the headset on PS4, you need to buy an adapter also. The microphone is connected to the left earphone and can be pulled down to mouth level when talking or can be pushed up when not in use. I would highly recommend this product to my friends for the above reason", 
                "review_comment_count": "", 
                "review_posted_date": "04 Apr 2017", 
                "review_rating": "5.0 ", 
                "review_author": " chad nowak"
            }, 
            {
                "review_header": "... headsets over the years and these are actually really great: 1", 
                "review_text": "I've had several gaming headsets over the years and these are actually really great: 1. Sound quality is better than others I've had that were much more expensive. 2. Cord and headset are very sturdy, and microphone folds up in such a way that it is well protected. 3. Fit very well and never become uncomfortable, ear pads are on soft and they are on a swivel so they conform very well to your head.", 
                "review_comment_count": "", 
                "review_posted_date": "14 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " yuckmouth"
            }, 
            {
                "review_header": "with great sound quality", 
                "review_text": "A proper gaming set, with great sound quality. As for build quality, it is well made and does not have any loose rattling parts. The whole piece feels very comfortable and I wear it for hours and hardly noticing it. I found the headset not to be heavy on the head and is infact lightweight in terms of a gaming headset. All in all, decent product. If you're looking to buy something for a cheap price and just need it for talking to people through voice communications, then this is for you. Word of caution: Sometimes the chat volume can be really quiet when in game.", 
                "review_comment_count": "", 
                "review_posted_date": "28 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Nora Asencio c/o Cristian Poccard"
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Excellent headset for the price. Make sure to buy a 2 female to 1 male aux splitter.", 
                "review_comment_count": "", 
                "review_posted_date": "06 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " foscomicron"
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "1%", 
            "4 star": "12%", 
            "3 star": "4%", 
            "5 star": "80%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B00LYQPDLU", 
        "name": "Sades SA-708 Zombie Version Stereo Gaming Headset 3.5mm Plug With Mic Computer Headphone Soft PU Leather Ear-cushion Gray Yellow"
    }, 
    {
        "reviews": [
            {
                "review_header": "Sounds just as if you are NOT using it. Perfect!", 
                "review_text": "I was using those little tiny earbuds but my friends would complain I sound horrible and so I finally relented and bought this on Amazon.com. It was only $10ish and then I immediate called my friends and tried it on and off and they said I sound perfect with it, as if I wasn't using it. ah, good. There is a reason why this is #1! It's perfect. hope it'll last me a long time. :) I am using it with a Panasonic headset as well. --UPDATE: about 1.5 years into it, while the headset broke as other have mentioned, now the adapter has broken as well. but heck, it's even less price now, I am including some pics of things you SHOULD DO WHEN YOU GET IT to make sure yours will not break as easily or will last longer. I added some heat shrink, electrical tape and zip ties and that will support the weak spots. See my pic of what I did:", 
                "review_comment_count": "", 
                "review_posted_date": "20 Apr 2014", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "flimsy headset", 
                "review_text": "This is unusual, since I take very good care of my telecom equipment, and we have no mischievous kids or pets: the main plastic holder for the headset broke apart after about a week! See 3 photos with various angles. Despite the occasional bad mouthing from other users of Panasonic product, I have been buying & using their phones for more than 30 yrs with very few problems. However this headset shows shabby piece of poor workmanship. Shame!", 
                "review_comment_count": "1", 
                "review_posted_date": "02 Feb 2015", 
                "review_rating": "1.0 ", 
                "review_author": " Quadroon"
            }, 
            {
                "review_header": "Not Durable and No Recourse", 
                "review_text": "I’ve written many reviews over the years, but this is my very first “one-star” review. (Check my record.) I received this headset via first-class on August 1st from Good As New, a third party seller. Close to three weeks later, the headset went out. After jumping through a lot of required hoops, I finally received a replacement. The replacement headphones also failed approximately two weeks later. Since I had to send back and then wait for the replacements, it was now past the 30 days and I was stuck with a pair of useless headphones, with no further recourse. To focus on the product rather than the incredibly terrible service, I will say that the headphone was rather uncomfortable. The one side that didn’t have an ear phone on it sat rather high on my head, so it never felt quite secure. However, they did have excellent sound for the two-three weeks that each headphone lasted. I wish they would have been more durable. It’s possible that they might have lasted longer if they had been shipped securely, but since I must stick to only the product here, I will say that they don’t seem like a very durable item to begin with. All of the other reviews, even the five star ones, mention they don’t last long. I expected, however, for them to last longer than 2-3 weeks each pair, and wish I could have gotten my money back.", 
                "review_comment_count": "1", 
                "review_posted_date": "08 Sep 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Elflover"
            }, 
            {
                "review_header": "Headset sound quality is fine, design is flimsy, broke after 4 months", 
                "review_text": "The sound quality and microphone seem to work fine, no complaints from anyone I've talked to. In general I was pleased with the usage of this headset for the few months that I had it; The primary criticism I would have is the cord is TOO long, actually - gets tangled up too easily. However, after 4 months the headset snapped due to basically a poor design by Panasonic. There's a tube which goes around the main connection (to extend the size of the head strap, basically) and the main force on that piece (depending on the size of your head) is right where there are two holes cut out of both sides of the plastic tube; in short, it's stupid design and as a result I now have to use duct tape or an alternative to keep the headset on. I would buy a different pair next time. I use the headset three or four times a week, so it's not like it's wear and tear.", 
                "review_comment_count": "", 
                "review_posted_date": "08 Apr 2015", 
                "review_rating": "1.0 ", 
                "review_author": " Fairness"
            }, 
            {
                "review_header": "Does not work. Save your money.", 
                "review_text": "I purchased this headset to use with my brand new phone system. I have nerve damage from a spinal injury and I can't hold a telephone for long periods of time. From the first time I tried using this headset, it was horrible. I could not hear the callers. I tried turning up the volume as far as it would go on the headset and on my telephone. I could barely hear the callers. They sounded like they were in the far off distance. I don't know how many times I had to ask people to speak up because I could not understand or hear them. I tried a different handset and a different telephone system. (I was changing them out in my home.) The headset did not work on either phone system. Another thing I didn't think about until after I received the unit was it does not have a clip to attach the cord to your shirt. After a week, I gave up on the headset and sent it back. If you plan on using a headset a lot, spend the money and buy something better. I purchased the blue parrott wireless headset, Roadwarrior B250-XT. It was very easy to connect to my base telephone and it worked GREAT right out of the box.", 
                "review_comment_count": "", 
                "review_posted_date": "10 Jan 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Rescueum"
            }, 
            {
                "review_header": "Panasonic KX-TCA60 Headset", 
                "review_text": "As others have noted this is a very nice headset, we found it to indeed have the excellent audio quality reported. It comes with a 2.5 mm (or \"sub-mini\") stereo plug (providing common, microphone, and earpiece contacts in standard \"tip and 2 ring\" configuration). No extra contacts) for phone control, but that was fine with us. I got an ordinary 2.5 mm stereo female jack to 3.5 mm stereo male plug adapter to use it with our older AT&T cordless phone, and it works fine. As a bonus the same adapter allows this headset to work with an LG Revere 3 phone. Based on the other reviews we actually ordered two, so my wife and I could each have one. So far we are very happy with both. Our phone conversations are so much clearer all around it is really appreciated. The plastic headband seems a little flimsy, but it is certainly light and comfortable, so I guess that's the trade off. Time will tell whether the headband will last for a reasonable time or not. For the price, it was well worth it to us, and we certainly recommend this model if you want a headset..", 
                "review_comment_count": "", 
                "review_posted_date": "20 May 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Pat"
            }, 
            {
                "review_header": "THIS IS NOT FOR CELL PHONES -- MISLEADING ADVERTISING", 
                "review_text": "THIS IS NOT FOR CELL PHONES. Listen up. I'm all for making more sales etc but come on! Panasonic is misleading customers. This is NOT at all good for Cell Phone use. The jack is a 2.5mm plug you will need a 3.5mm adapter to make it fit. But wait there's more! The adaptor I got on Amazon does not fit snug enough with this headset thus I will be donating this Panasonic headset to Goodwill. I was robbed on this purchase, don't be the next victom.", 
                "review_comment_count": "1", 
                "review_posted_date": "22 Nov 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }
        ], 
        "ratings": {
            "2 star": "8%", 
            "1 star": "13%", 
            "4 star": "19%", 
            "3 star": "10%", 
            "5 star": "50%"
        }, 
        "price": "$14.99", 
        "url": "http://www.amazon.com/dp/B00007M1TZ", 
        "name": "Panasonic KX-TCA60 Hands-Free Headset with Comfort Fit Headband for Use with Cordless Phones"
    }
]