[
    {
        "reviews": [
            {
                "review_header": "Takes you to the heavens and then hurls you to the ground in crushing disappointment.", 
                "review_text": "I was so excited to get this tablet cover. As soon as I got it I plugged it in to charge like the instruction stated. I have a TRIO Stealth G5 10\" tablet. When it was fully charged I put my tablet in it. It held the tablet in place securely. The side edges of the tablet were all the way to the edge of the cover and I was slightly concerned that the edges might be too exposed but decided the coverage was sufficient. I had a very difficult time sliding the power button over. I actually broke a nail attempting to do so. I got a pen and used it to slide the power button over. I turned it on and off a few times to see if that would loosen it up. It didn't but I figured I could just leave it on or get a pen to turn it on and off. It was easy to connect my tablet with the bluetooth keyboard and I was up and running. It was great! All of the keys worked, the little touch pad worked and it was like have a little laptop! I was in computing heaven! For about 15 minutes. It just stopped working. I thought maybe my tablet was frozen so I touched it and it was working fine. Then I checked to see if the bluetooth was still connected. It was. I thought maybe it needed to charge longer so I plugged it back into the charger for a while. Nothing. It was dead. I contacted Amazon and returned it. My money was refunded quickly.", 
                "review_comment_count": "1", 
                "review_posted_date": "18 Dec 2015", 
                "review_rating": "1.0 ", 
                "review_author": " Susan M. Kincer"
            }, 
            {
                "review_header": "Sleek and sexy but needs stronger keyboard magnets.", 
                "review_text": "This case is cool.It has a mouse pad built in! For an Android tablet! The four hooks hold the tablet like a mother holding a sick child. I tried to shake it loose over my carpet to test the holding power. It never fell to the floor which is good because there is not always carpet where I use it. The keyboard is small but not too small. I have big hands yet I can still type on it. Did I mention a mouse pad (or track pad)? it is cool to use on an Android tablet, making more like Windows (however, it is still a touch tablet so it can't be exactly like Windows). The keyboard is held on by magnets in each corner. Beware-they are on the weak side. I secured mine with a little velcro. There is a usb included to charge the keyboard. Your Bluetooth drivers must be up to date if the keyboard acts wonky. I just downloaded an app to get this to work with my asus. It worked with my Samsung perfectly, but Mr. Asus wanted to play dirty so I fixed his wagon with Bluetooth 4.0. Viola!", 
                "review_comment_count": "1", 
                "review_posted_date": "11 Oct 2015", 
                "review_rating": "4.0 ", 
                "review_author": " bemusedinsojo"
            }, 
            {
                "review_header": "Works with Windows 10 and stronger than it looks", 
                "review_text": "Just a tad too small for a Toshiba Encore2 tablet - the sides of the tablet stick out about 3/8 inch of both sides of the case. The keyboard is nice and WORKS with WIN 10. The case material is a little thin, so I am worried about rips and snags in it from normal handling.UPDATE: Been using for a few months now and I have to revise my rating upwards. Five Stars. The case material turns out to be stronger than it seems, and the touchpad has become a must for some apps.", 
                "review_comment_count": "", 
                "review_posted_date": "16 Sep 2015", 
                "review_rating": "5.0 ", 
                "review_author": " A. Customer"
            }, 
            {
                "review_header": "Awesome", 
                "review_text": "Although the case did not fit the polaroid 10.1 tablet I wanted it for (because the tablet was different dimensions) .The provider was very kind to provide me with a full refund. I was very satisfied because they reached out to me to make sure they did things right. It wasn't the right product for me, but it works it is very suitable for the right dimensions.", 
                "review_comment_count": "1", 
                "review_posted_date": "01 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Sofia"
            }, 
            {
                "review_header": "Not happy", 
                "review_text": "Problem was that the size of the keyboard was smaller than the Tablet so it was an effort to fit the corners. Finally did and it works fine but clearly it was too small to do it right. and of course it blocks the camera on the other side.", 
                "review_comment_count": "1", 
                "review_posted_date": "12 Mar 2017", 
                "review_rating": "3.0 ", 
                "review_author": " CAP"
            }, 
            {
                "review_header": "Awesome Responsive Bluetooth Keyboard and Not So Awesome Touchpad.", 
                "review_text": "The Keyboard: This keyboard has a decent feedback rate and the keys are a bit harder than that of a lenovo laptop. The quality of the keyboard is top tier and it's not the type to break down just by carrying it around or dropping it. All the special function hotkeys worked including the delete button, lowering brightness, volume, and back button. This is made for the android operating system and luckily this means it'll work on all android phones and tablets even if they dont fit into this particular case. I wrote this review even using this keyboard on a Oneplus One smartphone. The Case: The case in itself is good and has a really strong magnetic stand for the tablet itself as well as to protect the case from light falls. The case is less of a hard protective cover and more of a carrying case. The plastic hooks that hold the tablet are covered with soft rubber to prevent the hooks from damaging the tablet in any way. They also stretch to accommodate slightly bigger tablets. The Touchpad: The touchpad has to be where this keyboard falls short. The touchpad is decently responsive but lacking compared to the touch on a tablet. The mouse cursor moves slowly and sometimes the clicks take time to register. The 2 touch combos work well though, so scrolling and right clicking work fine. With that said i just end up using my phone/tablets screen instead of the touch pad. As a keyboard this excels but as a touchpad combo the touchpad is lacking. Would I buy this? Yes just for the keyboard alone I'd buy this. This is a fully featured QWERTY keyboard in one of the smaller form factors possible. At the time it's the best for the price range. With that said if I find a decent foldable collapsible keyboard for under $25 i'd probable go with one of those.", 
                "review_comment_count": "", 
                "review_posted_date": "23 Jun 2015", 
                "review_rating": "4.0 ", 
                "review_author": " V. Jamali"
            }, 
            {
                "review_header": "Great bundle for the price!", 
                "review_text": "This case and keyboard is great combination for any modern Bluetooth compatible device! Pros: Both the case and keyboard have beautifully matching textures (you'll be sure that these two were made for each other). Very light-weight. Great battery life! The keyboard is held by the case through the case's internal magnets. (You can easily use the case without the keyboard). The case is held down by a very well-made and very sturdy strap. Very sturdy and functional kickstand. No offensive and obnoxious obscure logo/branding (the iclever branding is very well camouflaged and very hard to notice). Works on Windows, IOS, Mac, Android, etc (Basically, if your device supports Bluetooth, this keyboard will work without any issues). Cons: No keyboard back-light/luminescence. For $29.99, I honestly love this product. Although its marketed for Samsung Galaxy 10.1\" tablets, it can easily be used for numerous devices. You can even adapt the case to securely hold a good-old-fashion paper notepad.", 
                "review_comment_count": "", 
                "review_posted_date": "26 Jun 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Harve"
            }
        ], 
        "ratings": {
            "2 star": "8%", 
            "1 star": "4%", 
            "4 star": "32%", 
            "3 star": "10%", 
            "5 star": "46%"
        }, 
        "price": "$25.99", 
        "url": "http://www.amazon.com/dp/B00W8RYVR6", 
        "name": "iClever 10.1 Inch Universal Detachable Bluetooth Keyboard PU Leather Case Stand Cover Mouse Touchpad"
    }, 
    {
        "reviews": [
            {
                "review_header": "Be aware - two different versions out there", 
                "review_text": "I ordered it on 3/23 from Amazon and received a couple of days later. To my surprise, the box doesn't say \"unifying receiver\". Took the keyboard/mouse out - yes indeed the receiver only says \"Nano Receiver\", and it doesn't have the orange star unifying logo. I also installed Logitech Unifying software but this receiver is not recognized. UPC/Product ID all match. Appears Logitech changed the product. Amazon needs to change the product description. If you are looking for a unifying receiver to work with other logitech products, don't buy this. Update - Amazon sent me a replacement, and this time it comes with Unifying receiver. UPC and product ID printed on the boxes are identical, packagings are slightly different. One has \"Unifying receiver\" clearly printed on the box and feature list and the other one doesn't. http://www.amazon.com/gp/customer-media/product-gallery/B00BP5KOPA/ref=cm_cr_dp_cust_img_see_all_img0 Keyboards and mice are also different. One set both have orange star unifying on the label and the other set don't. Product IDs are different too.", 
                "review_comment_count": "17", 
                "review_posted_date": "28 Mar 2014", 
                "review_rating": "2.0 ", 
                "review_author": " Blue Ribbon"
            }, 
            {
                "review_header": "Not perfect, but then none is. This combo is good enough and GREAT value", 
                "review_text": "**IMPORTANT TIP**: Although the MK270 combo does indeed work perfectly right out of the box without installing any drivers, as stated on the box (and it also works outside Windows - in boot screens, BIOS, Linux, non-OS boot utilities, etc.), it works much better with the Logitech SetPoint drivers and software you can download (for free) from the manufacturer's Web site. You gain battery life indication (there are no LEDs on the product, other than a very dim Caps Lock indicator, to save battery life), screen notices when you press Caps Lock and Num Lock (also low battery warnings, though I haven't seen that yet), some key and mouse button customization, and receiver dongle management. The product box doesn't come with a CD and there is no mention to SetPoint at all anywhere, so here is my tip for you. Now, I once had a wired Logitech keyboard that lasted 10 years, as well as several mice (which lasted less, but still above average). A year and a half ago, it was finally time to replace the veteran keyboard. I use a Windows 7 desktop PC, but I wanted a wireless model in order to reduce cable clutter. So, first I bought a Microsoft Desktop 3000 combo. Overall, I liked it at first, and wrote a largely positive review here. Unfortunately, that Microsoft product proved to have horrible durability. After a year and a half, the formerly fabulous Bluetrack mouse was wrecked: the wheel's rubber band rotted, disintegrated and fell off, rendering the wheel unusable, and the left button was failing. The keyboard had faded lettering and a failing low battery indicator. Battery life was getting shorter each time I replaced them, too. So, it was time to give up and shop again for a mouse/keyboard combo, and I found the MK270. I'm aware that the Microsoft Desktop 3000 belongs to a higher feature and price range than the Logitech MK270, so a direct comparison would be, to some extent, comparing apples and oranges. But the point is, I'm not really missing the more sophisticated product. The Microsoft mouse (when it still worked) was better, with 5 buttons and a larger, more ergonomic shape, not to mention the Bluetrack feature, which is awesome. But while the MK270 mouse won't make you go \"wow!\" (it's actually the Logitech M185 Wireless Mouse , which can also be bought separately), it's good enough for everyday use, and other than the somewhat small size for my taste, I can't really complain. It's responsive and reliable, with Logitech's usual solid build and impeccable finishing. The MK270's keyboard (also available separately as the Logitech K270 Wireless Keyboard ) lacks the wrist rest area that my old keyboard had, but a spare foam rest is cheap and easy to find. My old keyboard had a plethora of customizable keys that the (M)K270 doesn't have, but honestly, I never used any of them. The (M)K270 does come with Play/Pause, sound mute, volume down and up keys, as well as Home, e-mail, PC shutdown and Calculator shortcut keys. I wish it had more media keys (Stop, Next Track and Previous Track), but I can live without them. On the other hand, the MK270 also has some features that the supposedly better Microsoft combo did NOT have. The best of all is an on/off switch on both the keyboard and the mouse. This little detail is more important than it sounds: it makes A LOT of difference for battery life. With the Desktop 3000, I could not turn off the keyboard, and I could only turn off the mouse by taking the receiver dongle out of the USB port (remember I use a desktop, so this is a nuisance) and placing it on the mouse. My old Microsoft model didn't encrypt the signals either - the MK270 does. Another good feature is the Unifying receiver dongle technology: if either component dies before the other, you can buy a compatible stand-alone Logitech product and the dongle will recognize it, with no need to buy an entire new combo. If the dongle itself fails, you can buy the cheapest Unifying-compatible item you can find and the problem will, likewise, be solved. That, of course, assuming that your warranty is expired - Logitech offers 3 years for this combo. And if for some reason you need more than one keyboard or mouse, you can add extra compatible ones, too. The (M)K270's keys themselves are MUCH, MUCH better than in my old Microsoft model, with the right size, height, readability, and feedback - Microsoft's were a bit too short, crammed and soft, and the Esc and function keys were a joke: almost microscopic and labeled with icons instead of names (I had to count the function keys to find the one I needed to press!). To be honest, I'm enjoying working with this basic keyboard more than I did with the more sophisticated one by Microsoft. When it comes to keyboards, no esoteric feature compares to having the right feel of the keys, and the (M)K270 has it. I'm a translator and I type all day long in my work, so I should know. Overall, great value for the price, I'm very happy with my purchase and recommend it enthusiastically. UPDATE (May 2015) - It's been now two years since I bought this keyboard/mouse combo, and it's still working like new, and looking almost like new as well. The keyboard labels haven't faded, with few exceptions, which is remarkable, considering how intensively I use the keyboard all day every day. The Logitech logo on the mouse has almost disappeared, and the on/off switch on the mouse is a bit worn (the relief \"handle\" is, to be more precise), so sometimes it's a bit difficult to move it to the other position (once I do, it still works), but otherwise it's still perfect. The keyboard still works perfectly. No question that both components are VERY DURABLE. Now I'm using Windows 8.1 and it's still compatible (SetPoint even allows you to configure some buttons to Windows 8.x functions like Charms, though I use Classic Shell and I'm never on the new \"Modern\"/\"Metro\" interface, which I dislike). I'm expecting no problems if and when I upgrade to Windows 10. I'm getting a much shorter battery life than Logitech promised, but it's still very reasonable: about 4 months for the mouse and 6 months for the keyboard (I used to get only 2-3 months for both with my old Microsoft combo). Keep in mind, however, that I'm a very intensive user and you may get much longer battery lives if you use the PC less often (remember to always turn the keyboard and mouse off when you won't use them for a while). Also take note that in my experience, it really pays to use better-quality batteries, even if they're more expensive. So, I'm still very happy with my purchase and still recommend it. Some other reviewers have noted that some recent shipments of the MK270 have come without the Unifying technology. While I don't think that would have the least impact in your operation in the short term, it may make it more difficult to replace one of the components if it fails in the future (not that this is likely to happen, judging from my experience), so be sure to ask and confirm if it will come with Unifying.", 
                "review_comment_count": "18", 
                "review_posted_date": "31 May 2013", 
                "review_rating": "4.0 ", 
                "review_author": " goytabr"
            }, 
            {
                "review_header": "I'm so very happy with my new keyboard and mouse!", 
                "review_text": "I love, love, love my new Logitech wireless keyboard and mouse! It took me about 2 days to figure out which one to order and I'm just so glad I decided on this one. There are so many to choose from, but I knew mine had to be wireless, have a 10 key keyboard on the right side and be large enough, but not too bulky. I also wanted one with the right sized letter keys. It's perfectly sized for using on top of my little portable laptop desk and it's so easy to pair with my laptop. There are little legs on the bottom, if you like to prop it up at an angle. What I really love about this set is the simplicity, when it comes to setting it up. Just plop 2 AAA batteries into the back of the keyboard, put a AA battery into the mouse and stick the little nano receiver into your laptop's USB port. Next just turn on both the keyboard and the mouse and 'Voila!', you're good to go! At least that was my experience. I'm not a person in a rush any more and I tend to just go with the flow nowadays. Since I'm also now retired, I've just slowed everything I do, down to a slow crawl...and maybe that's why I like the plain and simple quality of this keyboard and mouse. It's nothing fancy and that's just fine with me. Comes with a great price tag too!", 
                "review_comment_count": "", 
                "review_posted_date": "26 Apr 2016", 
                "review_rating": "5.0 ", 
                "review_author": " JoMaMa318"
            }, 
            {
                "review_header": "Excellent combo!", 
                "review_text": "The keyboard and mouse work well out of the box. Batteries are included so all you need to do is pull the battery tabs on the keyboard and mouse and plug in the Bluetooth dongle and you are good to go! I have had no connectivity issues or ever had the keyboard or mouse lag on me whatsoever. For $20 you really cannot beat this set. The shortcut keys for things like calculator, volume up and down as well as mute, internet homepage, mail, and power all work out of the box. The only thing I can see that one be a downside for some, not me, would be the lights telling you if number lock and scroll lock are on. The light for Caps lock is there, so that is the only one I really care about. I gave it 4 stars for this being missing though as it seems like a 5 star keyboard would have this. Mouse is flawless from what I can tell, works on my desk with or without a mouse.", 
                "review_comment_count": "", 
                "review_posted_date": "26 Jan 2015", 
                "review_rating": "4.0 ", 
                "review_author": " WingoNation"
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "8%", 
            "4 star": "16%", 
            "3 star": "7%", 
            "5 star": "65%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B00BP5KOPA", 
        "name": "Logitech MK270 Wireless Keyboard/Mouse Combo,  Logitech Wireless Mouse USB (Black)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Just A Good Inexpensive Wired USB Mouse-Keyboard Combo From Logitech", 
                "review_text": "If you need a keyboard and mouse that is basic, has good typing action, and doesn't have a mechanical clicky noise then you'll be happy with this keyboard. It has good tactile action for a heavy hammer typist like me who learned typing in his youth on a mechanical typewriter at 85 wpm and I have always been exceedingly happy with the longevity and sturdiness of Logitech keyboards and mice over the past 3 decades in my IT career with their products. It is usb wired, which is exactly what I wanted for a home server build since a wireless battery operated variety would not do due. I wanted that local dependability without having to wait for something to charge or swap out batteries. It's exactly what it is. A reliably priced keyboard and mouse for everyday general computing. If you need a bazillion macro keys, a light show, wireless features, and something that will do a HAL 9000 for you then you're better off buying one of the top end combos, but if you're an everyday or occasional user with no nonsense basic needs you couldn't be more happier with this MK120 mouse and keyboard. You will need 2 USB ports, one for the mouse and one for the keyboard. If you need a more tactile clicky feeling and sounding keyboard you might try one of the other Logitech combos that provide a more noisier experience. But if you want sturdy and fairly silent then this is for you.", 
                "review_comment_count": "", 
                "review_posted_date": "23 May 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Great for basic use", 
                "review_text": "I got this product to go with my new gaming PC. I wanted something affordable, since I'd already overspent on the computer itself, so I went with this. Frankly, at this price, you normally get what you pay for. However, I'm happy to report that what I got instead was a solid, functional, no-nonsense keyboard and mouse. It seems like a better idea to buy your mouse and keyboard separately, to get the best value, but there's really no reason not to go for this, unless you need something special. The keys on the keyboard are well-spaced and seem sturdy enough. The mouse lacks some features that gamers might want, but is still excellent at what it was intended to do. I'm not sure what the DPI on this thing is, but it serves adequately for clicking people's heads until they die, which seems to be the point of the entire FPS genre. A couple things against this product: the little protrusions on the F, J, and numberpad 5 keys that identify them to touch typists could be a bit bigger. When I'm looking at the screen and searching for the home row at the same time, it takes a bit longer because I don't always notice those keys. Also, as I mentioned earlier, the mouse is very feature-sparse. It has two buttons and a scroll wheel, but no thumb buttons or adjustable DPI. This doesn't matter for most people, but I will be buying another mouse for my gaming and keeping this one for other purposes. I shouldn't have tried to game with this basic mouse, but it is still a good one for what you pay. Overall, I'm happy with my purchase. I am now the proud owner of a well-designed keyboard and (so far) reliable backup mouse. I've only had these things for a couple weeks at the time of writing, but if something terrible happens, I will edit this review with my new opinions.", 
                "review_comment_count": "", 
                "review_posted_date": "11 Jan 2015", 
                "review_rating": "5.0 ", 
                "review_author": " John P."
            }, 
            {
                "review_header": "Very good quality and perfect for the price, would definitely recommend.", 
                "review_text": "These actually work great and the quality is great for the price. I purchased 2 of these for each of our computers and they work perfectly and are very comfortable to use. I thought they may be poor quality because of the price but was very pleasantly surprised, they look and work great. I would recommend these highly...", 
                "review_comment_count": "", 
                "review_posted_date": "04 Jul 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Charlieboy's Reviews"
            }, 
            {
                "review_header": "Great keyboard and mouse set", 
                "review_text": "Great keyboard and mouse set! Plug it in and you are on your way, no pain in the keister programs to mess with or hoops to jump through. I am not a computer guru at all and I had this installed in about 3 minutes. Very nice quality and seems durable for everyday computer use. I like that the keys have a slight clicking sound when you tap on them but not overly obnoxious like the ones you can purposely order to make the noise. They are perfectly spaced out too so you have your hands and fingers in a natural position when you are typing. I will tell you my boyfriend is a gamer and he ordered this for the computer he built until his other one became available and he had no problems with it for his game.", 
                "review_comment_count": "", 
                "review_posted_date": "31 Jul 2016", 
                "review_rating": "5.0 ", 
                "review_author": " ElizaBeth C.."
            }, 
            {
                "review_header": "... a mouse and keyboard for $10 so everyone acting like this is supposed to be the Tesla of pc ...", 
                "review_text": "You're getting a mouse and keyboard for $10 so everyone acting like this is supposed to be the Tesla of pc accessories is...odd. They're fine. They work. The mouse isn't the most sensitive thing I've ever used but on any textured flat surface it's pretty darn OK.", 
                "review_comment_count": "", 
                "review_posted_date": "02 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Mia Hermine"
            }, 
            {
                "review_header": "Don't buy the combo, mouse is very cheap", 
                "review_text": "mouse was DOA. really really cheap quality The keyboard is fine for the price. I would recommend just buying the keyboard separate because the mouse is a total waste of money.", 
                "review_comment_count": "", 
                "review_posted_date": "04 Feb 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "... until an update from windows 10 left the mouse useless..", 
                "review_text": "Worked perfectly until an update from windows 10 left the mouse useless...", 
                "review_comment_count": "", 
                "review_posted_date": "23 Feb 2017", 
                "review_rating": "3.0 ", 
                "review_author": " nigelwayne23"
            }, 
            {
                "review_header": "Good cost-effective mouse and keyboard", 
                "review_text": "These are pretty basic keyboards and mice. The keyboards are pretty flat and lightweight. Pretty quiet keys with relatively little key depth--not quite like a laptop keyboard but close. The mice are pretty standard optical mice. Everything here is pretty much what you expect. The real nice thing about this item is how economical it is. Totally worth it.", 
                "review_comment_count": "", 
                "review_posted_date": "08 Aug 2015", 
                "review_rating": "5.0 ", 
                "review_author": " G. Farnsworth"
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "4%", 
            "4 star": "19%", 
            "3 star": "7%", 
            "5 star": "67%"
        }, 
        "price": "$14.95", 
        "url": "http://www.amazon.com/dp/B003NREDC8", 
        "name": "Logitech Desktop MK120 Mouse and keyboard Combo"
    }, 
    {
        "reviews": [
            {
                "review_header": "I gave it a shot due to the amount of great feedback. The mouse is comfortable and doesn't fatigue ...", 
                "review_text": "I have MANY keyboards. Most are mechanical. I was skeptical, of a keyboard and mouse combo labeled \"gaming keyboard & gaming mouse\", being so cheap. I gave it a shot due to the amount of great feedback. The mouse is comfortable and doesn't fatigue your hand after hours of use. Able to use with left or right, I tried both, it feels great! The DPI settings are amazing and it is very responsive. The keyboard is great. It has a nice, almost mechanical feel to it. I did not like the \"breathing\" LED but after some use I figured out how to shut the breathing off. It is very bright and you are able to see it well, on any color, at night. The windows key lock for games is a godsend!!! I want this function on all of my keyboards! Overall, I give this a 4.9 out of 5 for the breathing aspect of the keyboard. It is not needed but some people may love it. For a gamer on a budget, this is a gold mine of a find!! I have other tecknet wireless mouse and keyboard products. I am not a product tester and was not paid to write this review. Just a review from a gamer that loves finding hidden gems :D", 
                "review_comment_count": "4", 
                "review_posted_date": "28 Apr 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Brister"
            }, 
            {
                "review_header": "Seller Provided Great Customer Support", 
                "review_text": "Purchased this Teckmet combo for World of Warships gaming in July 2016 and for the first 2 months everything was great. I then noticed that the \"W\" and \"3\" keys would stick and not deliver the action after being keyed. I used air to clean around the keys to no effect. During games where I'm zooming in with the mouse wheel (like scrolling down a page), the mouse would suddenly lose it's place and accelerate to the bottom of the page or in a game, reset the zoom back to zero. Never had that with my wired Logitech mouse which is now back in use. I did contact the seller from the tab at the Amazon Orders page and the seller was prompt to refund my purchase. (Amazon moderates emails through the order page and sellers usually respond quickly.) I purchased the combo based on the number of positive reviews. I don't know if my Tecknet set was defective or if there are defects in the software or design of the product set. It's odd that both components would show problems. I'm still using the keyboard but plan to upgrade to a Logitech board.", 
                "review_comment_count": "", 
                "review_posted_date": "17 Feb 2017", 
                "review_rating": "2.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Nice set of keyboard and mouse!", 
                "review_text": "I love this set of keyboard and mouse. I usually don't like a wired mouse, but the design of it makes up for it. I like how the colors fade.", 
                "review_comment_count": "", 
                "review_posted_date": "02 Aug 2016", 
                "review_rating": "5.0 ", 
                "review_author": " That person"
            }, 
            {
                "review_header": "Nice Little Package!!", 
                "review_text": "Nice little package, I am enjoying this more than my Coolermaster set The keyboard is simple yet effective-the lights are very good and each button can be read no matter how dark it is in the room. The mouse is very nice and smooth-roller is squeak free. Don't expect to be blown away by anything large and it has no multi-media buttons for volume or web-search but it is Very smooth and not overly-clakky. Like a good OEM Keyboard that was once a better option is pretty much what this is The mouse is special-the dpi button doesn't doesn't light up however so you're left guessing a bit which setting it's on- but it's accurate and I am enjoying everything about it except the lack of dpi light Great Set for the price! If you need a set that's not too large this might be what you're looking for", 
                "review_comment_count": "", 
                "review_posted_date": "20 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " CMC"
            }, 
            {
                "review_header": "Keyboard layout isn't the best. Otherwise, both the keyboard and mouse have a great feel!", 
                "review_text": "I have been using this keyboard and mouse for a couple months now. The keyboard has a nice feel to it and the key lighting is a nice touch. I am not a big fan of the \\| key being adjacent to the enter key as opposed to above it. That's my fault though because you can clearly see that is the design when purchasing the product. The mouse feels great and has a good amount of buttons on it. The only problem I've experienced so far was about two weeks ago, my mouse wheel started to reverse scroll when wheeling up or down. For example I would scroll up a site and get an occasional down scroll. Even when reaching the top or bottom of a site, if I kept scrolling, it would just bounce up and down. I thought, uh oh, must be a mechanical failure on the mouse. However, I was able to go into the Control Panel (Windows 10) > Mouse > Wheel > I changed the Vertical Scrolling number of lines to a different number (2 in my case) > clicked ok > went to a scroll-able screen to test, it worked > Went back into those options and changed back to the default 3 lines > tested and it still works. So perhaps not a mechanical failure. I'll continue to monitor and update this post if the issue persists.", 
                "review_comment_count": "", 
                "review_posted_date": "11 Apr 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Eric Pipkin"
            }, 
            {
                "review_header": "... Keyboard has to be one of the cheapest and greatest gaming keyboards I've ever owned", 
                "review_text": "The TeckNet Kraken LED Illuminated Gaming Keyboard has to be one of the cheapest and greatest gaming keyboards I've ever owned! My other keyboard wasn't really designed for gaming so I had though I needed something better. The shipping did take a decent amount of time, but honestly in the end the wait was really worth it! I honestly hadn't expected such positive things this big of a magnitude! The mouse on the other hand, is ALSO really good! The mouse is large and decently heavy for even the most hardcore gamers, and the color breathing feature is really nice looking even if you can't set the mouse to a specific color, but the keyboard can! Either way, if you or someone you know is looking for an affordable yet high quality gaming mouse and keyboard combination, I highly suggest you tell them about the TeckNet Kraken LED Illuminated Gaming Keyboard! TeckNet® Kraken LED Illuminated Gaming", 
                "review_comment_count": "", 
                "review_posted_date": "10 Mar 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Lorenzo Melore"
            }
        ], 
        "ratings": {
            "2 star": "8%", 
            "1 star": "3%", 
            "4 star": "24%", 
            "3 star": "4%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01A7WHWE2", 
        "name": "Tecknet Kraken 3 LED Adjustable Backlit Gaming Keyboard and Mouse - Black"
    }, 
    {
        "reviews": [
            {
                "review_header": "The mouse is excellent and a great step up from the standard optical ...", 
                "review_text": "Everything arrived very promptly and undamaged. The mouse is excellent and a great step up from the standard optical mouse I had been using. It has 3 DPI settings and offers easy switching in game. The mouse responds very well and has weight adjustment for those who like a heavier mouse. The design is very nice and overall its very comfortable for long gaming sessions. The keyboard is also great. It offers media keys integrated with the function keys and also allows you to re-map your regular arrow keys into the wasd keys which can be very useful for some games. The back light is fairly bright without being annoying and helps while gaming in a dark room. Overall, this bundle is outstanding for its low cost. It offers many features that you would not normally get at this price point and I have noticed an improvement in my gaming with this mouse. Everything also looks very sleek and nice. Great bundle for the price.", 
                "review_comment_count": "2", 
                "review_posted_date": "31 Oct 2014", 
                "review_rating": "5.0 ", 
                "review_author": " Sajeev M."
            }, 
            {
                "review_header": "You cannot get a better keyboard and mouse combo in this price range, I am certain of it.", 
                "review_text": "Let me start by saying, I love this product. I can say with complete honesty, that I do not think you can find a better Mouse/Keyboard combo out there for the price ($27.99 with free 2-day shipping w/ my Prime subscription). Having said that, please understand that you are getting a mouse/keyboard combo on the cheap, and although in this case I don't necessarily agree with the \"you get what you pay for\" sentiment because this has far exceeded my expectations for the price, it is still a $30 combo so keep that in mind when purchasing as not to be disappointed if you are expecting this thing to walk your dog. It does not come with software, does not have macros, etc. (although it does have function keys for your basics like changing volume, media player play/pause, next track, etc.) In other words, it is not full of bells and whistles, but if you are just looking for a solid gaming combo for a low price than you really can't beat this combo. The keyboard has a solid construction despite being all plastic, and the keys have great tactile feedback, probably the best I have experienced for a non-mechanical keyboard. It is precise and responsive. The one complain I have with the keyboard is something other reviewers have already mentioned; the enter key is that strange \"tall\" type that relocates the \"\\\" key next to it instead of above it. In my case this is not a big deal at all because I do not use that key often, but I could see it being a problem if I did so you will want to be aware. The ability to swap the arrow and WASD keys is neat, but for me it is just a gimmick as I always use WASD when gaming anyway. With the feet down, the keyboard sits at a nice angle and I have been able to game for periods of 4+ hours without any discomfort. Moving on to the mouse, I bought this combo originally because my Logitech G9 I have been using for the last 5 years got spilled on, and shorted out. I loved that mouse and at the time I paid $70 for it when I bought it. Now that I am married and with a child, I do not have $70 to spend on a mouse, so I came to amazon to look for decent gaming mouse. My budget was $30. After some research I came across this combo. \"#1 best selling keyboard and mouse combo on amazon?\" I thought. I had never heard of this brand and 5 years ago when I bought my Logitech, there was no such thing as an off brand making a quality product so I was a bit skeptical at first. However, after reading the comments I thought... \"What the hell, it's $30. I will give it a shot and if I am not thrilled, I can buy another one once I get my tax return\". Now that I have rambled my story to you I will tell you how I feel about the mouse. Now, I will not lie... It is no G9. That mouse had the perfect set of weights and DPI settings that just felt amazing, but at $70 that was the expectation. With that in mind, I will say that this mouse is the second best mouse I have used. The DPI settings are nice, though for me the highest one is way too fast so I use the middle setting normally, and the lowest setting for precision such as sniping (the buttons on top of the mouse to adjust DPI on demand are great for this). The mouse is very smooth, the left and right click as well as the other buttons all have a great feel to them. I play games that require a very high CPM, so I am jamming on the right click constantly, probably at least 100 times per minute, and it is always responsive and catches every click with ease. The mouse wheel works fine, I have no issue with it... Not much to say here other than that it functions as it should. TL;DR: Both the keyboard and mouse are worth the price alone IMO, to get both for the price is just icing on the cake. I am highly satisfied with my purchase and would strongly recommend this combo to anyone. I have already recommended it to friends if they should ever need an economic solution to replacing any of the gaming keyboards/mice.", 
                "review_comment_count": "", 
                "review_posted_date": "19 Jan 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Robert Eyerl"
            }, 
            {
                "review_header": "Best gaming keyboard and mouse combo!", 
                "review_text": "Keyboard - The keys are high quality and don’t have that cheap feel associated with most keyboards in this price range. Amazing, considering I am out just $29.99 for a keyboard and mouse! The keyboard has a braided USB cable which is also a nice quality touch. The lighting is cool and not too crazy… the keyboard looks cool. There are also the WASD and arrow keys which you can swap functions on (helpful for some games). There is a full sized number keypad on the right which makes the keyboard great for day-to-day work as well. A feature which isn’t take about (not sure why) is that the keyboard is splash-resistant. I figured this out when a glass of water hit the keyboard, on the first day nonetheless, and the water went right through the keyboard (there are drain holes on the bottom). The keyboard works fine and didn’t seem to mind the water. Phew! There are also dual-function keys across the “F” keys for volume, skipping tracks, etc… So far so good! Mouse - The mouse alone is worth the price of this combo. It is displacing my old Razer gaming mouse and so far I am stoked with the way it feels/works. Like the keyboard you get a high quality braided USB cable. You can easily adjust the mouse DPI with the button just below the scroll wheel. Better than digging around in the software! There is a compartment on the bottom of the mouse that allows you to adjust the weight of the mouse to your liking. Seems like a gimmick until you try it. I like my mouse to be a bit heavier so I put all of the weights in. I think hardcore gamers might like it lighter? The mouse glides nicely on the desk or a mousepad. I am currently using it with the Redragon P001 Archelon gaming pad. Cool LED lighting to boot Summary - I would definitely recommend this product to anyone looking for a gaming combo set. Quality is up there and the products look and work great.", 
                "review_comment_count": "4", 
                "review_posted_date": "19 Nov 2014", 
                "review_rating": "5.0 ", 
                "review_author": " Kamille"
            }, 
            {
                "review_header": "Pretty good combo for the price!", 
                "review_text": "This keyboard is super cheap and that was the main reason why I got this. I really needed a gaming keyboard and I didn't want to pay a hundred dollars for a mechanical one. I will probably upgrade to a mechanical one in the future but this one is good enough if you are on a budget. It also comes with a mouse but that one broke probably within a couple weeks. The keyboard is still holding up well so that's good. Overall its a really good deal but don't expect too much.", 
                "review_comment_count": "1", 
                "review_posted_date": "07 May 2016", 
                "review_rating": "3.0 ", 
                "review_author": " Denzel Garcia"
            }
        ], 
        "ratings": {
            "2 star": "6%", 
            "1 star": "6%", 
            "4 star": "21%", 
            "3 star": "8%", 
            "5 star": "59%"
        }, 
        "price": "$24.99", 
        "url": "http://www.amazon.com/dp/B00NLZUM36", 
        "name": "Redragon S101 Vajra USB Gaming Keyboard with Centrophorus USB Gaming Mouse"
    }, 
    {
        "reviews": [
            {
                "review_header": "Good quality keyboard and mouse!", 
                "review_text": "We got my son a laptop for Christmas (with the help of family members contributing!) that would serve as both a school laptop AND a gaming station. When he came to us saying he wanted to use some of his money for a gaming keyboard, my wife and I were both not too keen on the idea. Then, after I reflected a bit, I realized that 1) he did have the money in his allowance/chore/leftover b-day envelope , and 2) purchasing this keyboard would put less abuse on the laptop's keyboard. So, we allowed the purchase. That said, both my son and I were highly disappointed when we received the FIRST keyboard because the key that activates the backlighting didn't work. So, back it went. The company sent out another and it worked very well. The key action is crisp, not spongy. It is a full-sized keyboard with the number pads off to the right. There are specific volume keys which are very convenient (without having to hit function keys). The red lighting is cool, and we both like that you can toggle the keyboard's lighting off and on. My only criticism is that the keys are barely readable without the backlighting turned on. The mouse is very cool without extra buttons that are unnecessary. Others have complained about there being no toggle on the mouse, but I can't say my son has complained about that at all. So, overall, this is a great value. Despite our one hiccup of the first keyboard not working, this has been a worthwhile purchase because the company made good on their promise to deliver a keyboard that worked.", 
                "review_comment_count": "", 
                "review_posted_date": "01 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " jeffreywp"
            }, 
            {
                "review_header": "A solid choice for casuals.", 
                "review_text": "After using it, there are definitely some things I would like to see improved. Also:screen lock activates LEDs. This is regular among gaming stuff but if you punch spreadsheets you may not like it. Things CM can improve on: First thing:Software support and tuning. Razer's Synapse is so nice to have and use, and I would like CM to have some software. Second: Keys are very loud, but easily solved by lifting off the key slower. Its not that annoying and still within most mechanical keyboard's noise levels. Third:Add white outlines on key lettering for better daylight visibility. Lights are the only option to know what key you are pressing. Also, add differentiation on WASD keys so they are easy to find-different texture or shape so that its easily found or color because many gamers will be using those keys more. Fifth: Expand the viewing angle for the key lights, they are mostly effective from straight down but any other angle and the light isn't there to illuminate the letters. If the keyboard is far away the light doesn't shine as bright through the letters because of the small letters. Making the letters bigger would alleviate the issue. Now on to my opinion of the keyboard:the switches are good. They do a good job. They don't feel like a pure membrane but its definitely not a mechanical keyboard. It is definitely more mechanical than a membrane but you will still feel the membrane mush at the end of the press but in every other fashion it is like a mechanical. I like it. YMMV. I like the media and sound buttons are a nice touch and I applaud CM for putting them in there. This is a good keyboard and will last awhile. Now the mouse.......its actually impressive! It really is a nice mouse, the clicks aren't hypersensitive or feel like sand. The scroll wheel is tight and is tactile(considering price) and the clicks are tight as well. No wiggle side to side in the scroll wheel. Definitely punches above its price point for quality of construction. However I do have two complaints: the weight of the mouse is not as heavy as I would like, and it does have a medium lift off distance, which is just enough to get on my nerves. Since it has an optical sensor, putting a small piece of scotch tape over half of the sensor takes care of it. The lights aren't overwhelming and the scroll wheel is lit up which is nice. Adjustable DPI is a nice touch and is lit up as well. Overall, an impressive package from CM. Buy confident because of their customer service, but know that you are spending 30 bucks on a gaming keyboard AND mouse. Can't expect Razer levels of comfort and durability but for the price point it demolishes any gaming keyboard option below Razer.", 
                "review_comment_count": "", 
                "review_posted_date": "05 Jul 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Classic Sniper"
            }, 
            {
                "review_header": "Amazing deal for the money", 
                "review_text": "--The Keyboard-- Overall great keyboard with a few design flaws. Keys are very responsive with a nice typing feel but they're a little loud for my taste. They're fine during the day but may become a problem for those who work late at night (The original Devastator might be a better option since it has normal membrane keys). The media keys are very useful but they're much shorter than the rest so the top row of function keys actually get in the way. I'd much rather have the media keys raised a bit more or just have all the keys the same height. My last complaint is the illumination. It's actually very dim with no way to increase the brightness, so the keys are pretty hard to make out when placed in your typical typing angle (even at night). The keys only appear fully and evenly lit when facing them directly. --The Mouse-- Wonderful little mouse, no complaints at all. I use a fingertip grip (I move the mouse with my fingertips only and I do not rest my palm on the mouse at all) and it is very comfortable to hold. It has a nice symmetrical design and the lighting is a very nice touch. I got used to the mouse within minutes of using it. I would honestly pay 30 dollars for the mouse alone. I don't use the DPI toggle button but it works exactly how you'd expect for those wondering. --Conclusion-- The keyboard (mainly the illumination) is somewhat disappointing but it still deserves 5 stars considering how cheap this combo is ($35 dollars with Prime at the time of writing this review). A mechanical-feeling keyboard along with an excellent gaming mouse at this price point is just a deal too good to pass up. Also, being a Cooler Master product I don't expect either devices to malfunction anytime soon.", 
                "review_comment_count": "2", 
                "review_posted_date": "30 Mar 2016", 
                "review_rating": "5.0 ", 
                "review_author": " G I N"
            }
        ], 
        "ratings": {
            "2 star": "10%", 
            "1 star": "8%", 
            "4 star": "24%", 
            "3 star": "15%", 
            "5 star": "43%"
        }, 
        "price": "$25.00", 
        "url": "http://www.amazon.com/dp/B01CDYAGPY", 
        "name": "Cooler Master Devastator II LED Gaming Keyboard and Mouse Combo Bundle (SGB-3031-KKMF1-US)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Nice wireless combo", 
                "review_text": "They keyboard and mouse worked well for me when I tried to use them. I really like the shape of the mouse. It took me a couple of minutes to realize the mouse turns itself \"off\" after several minutes of no use. You just have to hit the button under the scroll wheel to get it connected again. My only complaint is the shape of the enter key. I keep hitting the slash instead of enter.", 
                "review_comment_count": "2", 
                "review_posted_date": "18 Jun 2015", 
                "review_rating": "4.0 ", 
                "review_author": " B. Eldred"
            }, 
            {
                "review_header": "Great Wireless Keyboard (for work)", 
                "review_text": "I got the wireless K104 model for work. It has a 2 legs on the back for an angled lift. The wireless receiver is tiny so it will not protrude from the desktop tower. I tried plugging it in at the back of the tower but for some reason it wouldn't receive signal (both ports work) so I just left it at the front. The mouse has 3 additional buttons. The middle button is a DPI switch from slow (blinks once), medium (blinks twice), and fast (blinks 3 times) pointer speeds. The other 2 side buttons are to go up or down a page (although you can change/customize it such as to go forward or backward on a webpage). The mouse clicks just like any other mouse. The reason I mention this is because the keyboard is very silent. You don't have to press down as hard and other people will barely hear you typing! Both the keyboard and mouse respond quickly. It will catch all movement and characters even if you type fast. All of the other functions work as normal. The computer also automatically searched/updated drivers within seconds of plugging in the receiver and without administrative access. Based on the cost and function for work, I would highly recommend it. NOTE: Batteries are not included. The mouse requires 1 AA battery and the keyboard requires 2 AAA batteries.", 
                "review_comment_count": "1", 
                "review_posted_date": "13 Mar 2015", 
                "review_rating": "5.0 ", 
                "review_author": " J Z"
            }, 
            {
                "review_header": "you have to press harder on the keys, and sometimes a LOT harder.", 
                "review_text": "For the price, it's an OK keyboard, but I am accustomed to one that was more sensitive to the touch, so I am having problems with spacing and dropping letters. I am an experienced touch typist, so this should not be a problem. I will give it a few more days and if this doesn't improve, I will swap it out for something else. ADDENDUM: The company saw my review and offered to resolve the problem. I suggested they send a replacement keyboard, which they have done, and sent me a pre-paid label to return the old one. It still requires more effort than some keyboards, but the space bar on the new one is working, and I don't find myself going back over text and inserting spaces between words. SECOND ADDENDUM: I have been using the new keyboard all day and found that certain keys seem to have a mind of their own. Namely, Q, W, E, and R. Sometimes I hit those keys repeatedly, and still nothing happens. When I go on use other keys, then those will return to working again, but only temporarily. My touch does not change; those keys just do not respond, even if I use more force. Not a good choice, I am sorry to say, because this is now the 2nd keyboard from the same company. At least the space bar works fine on this one. I am going to end up going with a different brand entirely, and will have to use it until I find a different one with the features I need. I have changed my reading to 1 star. The price is good, and the company tried to be helpful, but the keyboard is not for someone who requires accuracy.", 
                "review_comment_count": "4", 
                "review_posted_date": "12 Jan 2017", 
                "review_rating": "1.0 ", 
                "review_author": " G.S. Dorfman"
            }, 
            {
                "review_header": "Good quality for the price.", 
                "review_text": "I bought this to use with a notebook computer I sometimes have connected to my big screen TV. Everything works perfectly, I can operate my computer from the coach. I can even use it from the kitchen table which is about 20 feet away. The nano receiver allows me to leave it in when I use the computer for travel; it stays in when the computer is in a case. I've only used it about three weeks but the batteries are still strong and I suspect will last a long time. I purchased this at $15.99; it was well worth the price; a real bargain. NOTE: As of this writing, It seems the reviews here are for several different products because of the way the seller has listed them. This is confusing a lot of people. My review is for the \"EagleTec K104 / KS04 2.4 GHz Wireless Combo Keyboard And Mouse\" which is very different than some of the other keyboards listed here. ALSO: This Keyboard is an ISO layout. which is different than an ANSI layout; the Enter key, and some other keys are different. Some of the keyboards listed are ANSI layout. This makes the reviews confusing; some are talking about onne product and layout while others are talking about a different layout and product. Some keyboards are lighted, some are not; some are wireless, some are not.. Be careful when ordering, if it's based on a review make sure the review is for that exact product.", 
                "review_comment_count": "1", 
                "review_posted_date": "02 Feb 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Joe M"
            }, 
            {
                "review_header": "Even better than expected.", 
                "review_text": "Extremely pleased with this keyboard. I was looking for something with lower key movement, and this one happened to be built to be more quiet and compact and it pleases in those respects also. The keys full size, and aren't chiclets, per se, but the action is that of a laptop. As for the noise, I am now very spoiled by the quiet keys. I wish everyone used one, because now all I hear is clack clack clack in the office. I even had someone come to my desk to ask a question and I was finishing an e-mail and he remarked what a quiet keyboard it was. I believe he was jealous. Like I said, the keys are full size, but there is no wasted plastic on this unit. When the keys end, the keyboards ends, so it takes up less desk space than the Logitech it replaces, a bonus. The feel of the keyboard is very light, but also sturdy. I can't tell yet whether this keyboard will last months or years, but it does not fee like a budget keyboard. I have not used the mouse since I use an ergonomic mouse, but I love the feel of it and way it fits my palm. I like it so much so that I have ordered a gaming mouse from this brand. I will likely review that as well.", 
                "review_comment_count": "", 
                "review_posted_date": "14 Oct 2016", 
                "review_rating": "5.0 ", 
                "review_author": " R. Souc"
            }
        ], 
        "ratings": {
            "2 star": "9%", 
            "1 star": "14%", 
            "4 star": "16%", 
            "3 star": "9%", 
            "5 star": "52%"
        }, 
        "price": "$16.99", 
        "url": "http://www.amazon.com/dp/B00QRPPCMI", 
        "name": "EagleTec K104 / KS04 2.4 GHz Wireless Combo Keyboard and Mouse - Black"
    }, 
    {
        "reviews": [
            {
                "review_header": "Definitely a great budget gaming keyboard and mouse combo. Exceeded expectations", 
                "review_text": "After trying out this keyboard for the past few days, I can say that this Rii gaming keyboard and mouse combo exceeded my expectations. I was on a budget so I was hoping to find myself a gaming keyboard + mouse at a reasonable price. This set caught my attention so I decided to get my hands on it. The back light feature was one of the main reasons I decided to purchase this. I game during the night so I wanted some cool lighting effect on my keyboard and mouse (I was using a regular wired black Logitech mouse and keyboard before the upgrade). The keyboard looked great on the pictures but was 10x better in person. The LED lights were really bright and the keyboard looked really great in a dimmed environment. It took me a while to find the on/off button for the back light because there weren't any instructions provided, but after a while of mashing buttons, I have found out that it is the \"scroll lock\" button. The buttons on the keyboard are a little light on the touch but not as light as a mechanical keyboard, which I like because I like to feel some pressure on my finger tips when I'm typing / gaming. The gaming mouse fits nicely in my hands and has a really cool color alternating feature (kinda wished the keyboard had this, but it's fine). The mouse is slightly heavier than your typical mouse, which is fine with me, and has a cool DPI function that lets you change the sensitivity of the mouse, which is good micro intensive gaming. Overall, this gaming keyboard + mouse combo was a great buy. I bought this hoping it would be one of those relatively inexpensive yet really good working and high quality products, but I wasn't really counting on that. Surprisingly, it was what I had hoped for and more", 
                "review_comment_count": "3", 
                "review_posted_date": "04 Nov 2015", 
                "review_rating": "5.0 ", 
                "review_author": " X-terminator"
            }, 
            {
                "review_header": "Great keyboard and mouse..looks awesome!", 
                "review_text": "I bought this keyboard for my son and he is very happy with it. The colors on the mouse change color. The mouse also has three sensitivity settings by clicking a button. It is pretty cool looking! keyboard is lit with all the colors and you can shut them off if you'd like. This is a great keyboard and mouse for the price!!", 
                "review_comment_count": "", 
                "review_posted_date": "06 Dec 2015", 
                "review_rating": "5.0 ", 
                "review_author": " rebecca"
            }, 
            {
                "review_header": "Definitely feels like a budget keyboard", 
                "review_text": "I went into this purchase thinking, \"A keyboard is a keyboard. How could you possibly mess it up?\", so I went for a budget keyboard. I also wanted it backlit so I could see the keys in dark environments. Turns out (you can see this in the pictures) that the backlight doesn't actually light up what the key is, it only lights up the area around it. So, I try using this keyboard at night and find that I still can't see which keys I'm pressing. All they needed to do was make the letters on the keys semi-transparent. Also, the enter key is weirdly shaped from your average keyboard, so I keep on missing the enter key and hitting \\ instead. That took some getting used to. I like the feel of the keys well enough. It sometimes isn't clear whether it actually registered a key stroke or not, since the point where it actually registers the keystroke is not well defined. A bunch of people have said that you toggle the light on or off with scroll lock or other keys. I don't understand this. Look at the keyboard to the right of the spacebar. There's a key with a lightbulb on it. For me at least, that key turns the backlight on and off. Also, I really appreciate that they have an on/off switch for that; It annoys me when I get LED stuff that cannot be turned off.", 
                "review_comment_count": "", 
                "review_posted_date": "30 Jan 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Mike B."
            }, 
            {
                "review_header": "Love it, but its missing a key", 
                "review_text": "So i love the keyboard, however.. it was sent without the down arrow. i really need it for work right now. the box was also damaged. i might have to get a replacement before i can send it back for a non damaged one. its really pretty!! it is kind of loud for a keyboard as well. i'm still putting it at 5 stars because the only reason i am unhappy is a defective item. if it came with the down arrow i would really have no complaints. the loudness of the keyboard doesnt bother me. only others. haha Update. It's very difficult to return. No one is getting back to me... ? I'm changing my star rating god customer service.", 
                "review_comment_count": "", 
                "review_posted_date": "21 Jan 2017", 
                "review_rating": "1.0 ", 
                "review_author": " Karley Chochard"
            }, 
            {
                "review_header": "No instructions, lights will not stop blinking. (Try holding the Function key and press \"light bulb\" key to stop blinking)", 
                "review_text": "The keyboard so far is ok. The lights are another situation. I plugged it in and the lights could be turned on and off with the \"light bulb\" key. Forget that stupid scroll stuff. I have no idea what that means. The key does not \"Scroll Lock\"! The scroll lock key does that. There are no instructions except to use the scroll lock key. After a few minutes the keyboard started flashing. It will not turn off. I found that pressing the function key and \"light bulb key\" the flashing starts and stops. I like the extra large \"return\" key. That is why I bought this keyboard. Some people do not like it. Make sure it is what you want. I have had no problem typing on this board. But, I am a keyboard pounder since learning to type on a manual typewriter. DO NOT ask me how old I am! You may like a lighter key. When the light is on, I can not read the key easy. The lettering is dull. Although I touch type, I still need to look for the numbers and symbols. Also, I use a Russian character set, which I never learned to type. I thought the lights would help in dim light, I was very wrong. Makes it worse. Lately I am having problems with shifting for capital letters. I have to firmly push it. THIS HAS BEEN UPDATED!", 
                "review_comment_count": "1", 
                "review_posted_date": "08 Feb 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Redenegue"
            }
        ], 
        "ratings": {
            "2 star": "7%", 
            "1 star": "13%", 
            "4 star": "17%", 
            "3 star": "14%", 
            "5 star": "49%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B00T94ENKQ", 
        "name": "Rii RM400 LED Gaming Keyboard & Mouse Combo Bundle (7 Color Backlit) (rm400)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Quality and Simplicity", 
                "review_text": "As the IT guy for the mid-sized company I work for, the Logitech MK320 Wireless Keyboard and Mouse are my go-to for everyone. Whenever we purchase a new computer or laptop for an employee, I always add one of these on top because they reduce visual clutter and are high-quality. The construction of both the keyboard and mouse are solid, and unless you have very specific tastes in keyboards or need particular extra features, there is nothing to complain about in their design or feel. The set comes with batteries included and the battery-life is great. In an office environment, I have not had to replace my batteries since I've been using the keyboard and mouse (a little over a year) and I do not hear any complaints from any of the other employees about battery life. I also appreciate how simple the set-up is for anyone. You do not need to know anything about technology! Just unbox the keyboard and mouse, plug in the tiny USB receiver, remove the battery tabs, and you're done! You can be up and running in literally three minutes. Finally, I do also recommend this set--which includes the Logitech Unifying receiver--because of the ability to mix and match other Logitech wireless mice and keyboards. This is especially helpful if you have a laptop that you take between your work and home office: you can keep a single receiver plugged in and not have to lug a keyboard and mouse back and forth.", 
                "review_comment_count": "", 
                "review_posted_date": "08 Sep 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Jake DuBois"
            }, 
            {
                "review_header": "No Lights", 
                "review_text": "I just started using this but I discovered something I couldn't believe. IT DOES NOT HAVE A CAPS LOCK LIGHT! (It doesn't have any of the usual lights.) Every keyboard I've ever had, no matter how cheap had a caps lock light. And that's going back to late the 1980s. And as far as I can see you have to buy their top-of-the-line keyboard to get one. It has all kinds of bells and whistles, many unnecessary but not those lights. Hard to believe. UPDATE: I type a lot and find myself having to stop and correct items that shouldn't be in caps. So I'm still annoyed about that. I noticed that sometimes I would type and nothing would happen. Then after a few seconds the typed letters would appear. I also found that the cursor would stick. I checked the battery on the mouse but that was not the problem. I finally went back to the Logitech wireless mouse I'd had before (M525) and both the cursor and the keyboard problems disappeared. It's as if the mouse that came with the set interferes with the signal to the keyboard. Right now the keyboard works fine but I'm still peeved about the caps lock issue.", 
                "review_comment_count": "1", 
                "review_posted_date": "25 Sep 2015", 
                "review_rating": "3.0 ", 
                "review_author": " John Nedb"
            }, 
            {
                "review_header": "does the job", 
                "review_text": "So I have waited to do a review on this product for almost a year to see how it holds up. I work from home and that means I spend a lot of time on the computer..anywhere from 8-10 hours a day, five days a week. The keyboard works great and I have not had to replace the batteries yet. Mouse is the same. I like that the keyboard does have a separate number pad. Price cannot be beat. I have always had good luck with Logitech products", 
                "review_comment_count": "", 
                "review_posted_date": "11 Sep 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Dawn"
            }, 
            {
                "review_header": "Simple and to the point", 
                "review_text": "Just got this today, will amend review if anything changes. I'm a writer, and a very fast typist. The keyboards is pleasantly clicky, bouncy and responsive, and I can type very fast. It's a \"tactile\" keyboard, and I don't make as many errors as on some of the \"softer\" and \"quieter\" keyboards I've tried. The mouse is surprisingly comfortable for a wireless mouse, decently responsive. I normally HATE wireless mice and use wired mice and wireless keyboards, but I thought I'd give this a try. I've been pleasantly surprised. The reception is fine, but I'm not trying to push the range very far. It's not fussy at all, and my last logitech wireless totally was. Setup was SO painless. Plugged in the dongle, pulled out the tabs for the ALREADY INSTALLED batteries, and boom, it worked. A neat feature... keyboard and mouse BOTH have off switches. This makes sense and should dramatically extend battery life. So far so good! ETA: I've had to for a month or so now, I think, and while the battery life isn't as advertised, that's probably because I don't generally remember to turn the mouse and keyboard off when I'm done using them. Even so, these last about 100 times longer than my previous keyboard and mouse. The mouse is quite responsive. I've disliked wireless mice in the past for being laggy, this one isn't. My scores in Bejeweled Blitz aren't quite as high as they were, but they're still very, very high, and I'm not sure it's the mouse's fault... ;) Typing on the keyboard is great. Every once in a while, it lags, but it seems to buffer what I'm typing, so waiting a moment will get the text to show up. That only happens once every few days, it's not often enough to qualify even as aggravating. ETA: Great keyboard! I didn't realize how great until I accidentally knocked a full glass of liquid into it. There was lemonade running straight through it, across the full width.... I took the batteries out immediately, took out the nine million tiny screws, and opened it up with a plastic knife.... and the electronics were DRY. The top was damp, but no electronics in the upper surface and the panel below is well protected. I dried everything, used a little rubbing alcohol on the keys to get the sticky off (should have just stuck it under running water, the top panel, that is!) let it sit until completely dry, then put it back together... works fine! Six months later: Keyboard is fine. Mouse... OH MY GOD I LOVE THIS MOUSE. Here's the thing... I have kids. And I do my computing from a couch. I drop my mouse All. The. Time. This mouse... it pops apart every time I do... but never, ever breaks, and goes back together just fine. I have another mouse I've owned for less than 2 months that has not held up to the same abuse, and is getting dodgier and dodgier. The battery life on this mouse is outstanding as well. Just a very impressive product all around, and any future keyboard/mice combos I buy will likely be this one, because it just WORKS. I never use the off switches, but still get great battery life, better even than on another \"smart\" mouse I have that turns itself off when the computer is off. We use rechargeables, and I just don't have to swap them very often. 18 months of use, and still working great despite a ridiculous amount of abuse from my kids, being dropped off the couch, behind the couch, under the couch, grabbed, drooled on, bitten (I had a baby). We've had a couple keys pop off the keyboard during drops... they snap right back on. Battery compartment pops open when you drop it...but goes back together, no breaking. Final comments: Baby is 16 months old and I'm still using it, but it has seen better days. After being subjected to the abuse of a special needs 8 year old who likes to pick keys off, a toddler who loves to \"type\" but will alternate typing with whacking nearby objects with the keyboard and both keyboard and mouse repeatedly hitting the floor at speed when catapulted from the top of my recliner as I leaped to my feet to deal with my wayward children after putting mouse and keyboard \"out of their reach\", they have suffered the following damages: The control key is nowhere to be found. Just up and disappeared. I'm kind of afraid one of the kids ate it. I can use the control button by sticking my pinky down in the hole but it's definitely time to get a new keyboard. The spring is gone from under the shift key, so it has lost a little zip... but still works. The battery cover finally gave up the ghost, and I ended up using it without the cover most of the time for the past few months. I think someone chewed on the mouse wheel, there is no other explanation for the damage. I ameliorated it with sugru, but one can only do so much. My 16 month old has figured out how to replace the battery, which pops out every time it hits the floor. This happens often enough that if I drop my muose and the battery pops out, he will pick up the mouse, bring it to me, go look for the battery, bring THAT to me, and then put the battery in, and he never gets the orientation wrong. Crazy kid. And with all that? They are still 97% functional as keyboard and mouse. Battery life is still awesome with hybrid rechargeable batteries. The Ctrl button (left side) is annoying as heck because it's the one I use for Ctrl-v etc. But at least it still works! I've had wired and wireless keyboards alike die ignominious deaths (wonder why?) many times before, and holy crap this one is still working. I bought my mother one, I liked it so well. For my netbook I have a similar mouse, but with a pretty red flower on it and a smaller receiver, also Logitech. Love that one too. Baby uses that one all the time and it never even pops the battery. (by use I mean whenever my back is turned he grabs the netbook and mouse and starts typing vigorously, then uses the mouse, then resumes typing vigorously. One of these days, it will come out Shakespeare.) ETA: I just bought a new one (June 2014) because the \"new and improved\" model I replaced this one with didn't last nearly as long. The edges were more brittle, it started breaking quickly and eventually just flat out refused to turn on. And I'm remembering why I liked the feel of this one so very much. Hopefully we can avoid some of the abuse the last two went through.... A note: The keyboard is the K330 and the mouse is a M215, if you're looking for the parts individually. January 2016: The keyboard died a while ago (second keyboard) but the second mouse is still going strong. In fact, I was diagnosed in the past couple years with Ehlers Danlos, so comfortable keyboard and mouse is a must. This mouse, I actually added a frame made out of instamorph thermoplastic to support my hand and it works brilliantly, still going strong despite many drops (though the frame helps keep things from popping apart. Despite spending many hours per day on the computer, I have currently minimal wrist or finger symptoms (they sometimes get bad with repetitive stress, so the fact that I can type and mouse comfortably many hours per day is impressive.) I'm currently using a K360 keyboard with the mouse that came with this, and that keyboard is also nicely responsive and shaped. The attached picture is of the mouse with the frame on it (covering the missing battery cover, lol). I was having some stress around my fingers \"collapsing\" around the side of the mouse due to the small size (not a problem for a long time, but became one due to the progression of my illness) and this I crafted to keep my fingers in a neutral position and allow me to mouse without \"gripping\". Super comfortable still.", 
                "review_comment_count": "6", 
                "review_posted_date": "19 May 2011", 
                "review_rating": "5.0 ", 
                "review_author": " J. Rosenberg"
            }
        ], 
        "ratings": {
            "2 star": "5%", 
            "1 star": "9%", 
            "4 star": "18%", 
            "3 star": "7%", 
            "5 star": "61%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B003VAGXZC", 
        "name": "Logitech Wireless Keyboard and Mouse Combo, Long Range Wireless Eleven multimedia hot keys,12 programmable F-keys, MK320"
    }, 
    {
        "reviews": [
            {
                "review_header": "HEY Logitech! READ THIS.", 
                "review_text": "I generally only buy Logitech when I get third-party stuff because I trust the quality, and this keyboard is really good EXCEPT for one shocking problem. The keyboard sags in the center when resting your palms and typing. It makes this ANNOYING creaking sound that will drive you crazy. The good news is that I fixed it by applying some felt “feet” under the center where is sags (see pic). Very easy, but WTF!!! Come on Logitech, are you guys sleeping at your work stations?!", 
                "review_comment_count": "2", 
                "review_posted_date": "09 Apr 2016", 
                "review_rating": "3.0 ", 
                "review_author": " Jeff S"
            }, 
            {
                "review_header": "I HAVE REPLACED DOZENS OF THESE", 
                "review_text": "UPDATE YOUR REVIEW AFTER YOU'VE OWNED ONE FOR A YEAR OR TWO! -------------------------------------------------------- I work in IT for a small company, we have about 30 computers. When the previous system admin was setting up the network he got every computer set up with the same hardware - including the same keyboard and mouse. Today I replaced the last one. Every single keyboard has been replaced with another Wave. All 30 laptop/mouse combos died or started having issues within a year, and all have been replaced within 2 years. This is a super comfy, very slick, very nice keyboard, and the fullsized wireless mouse is nice too. However, be prepared that you will, without a doubt, be buying a new one in a year or two. If it lasts any longer than that, you are in the minority and you should consider yourself a lucky owner of a Wave that actually works. These keyboards essentially have planned deaths right after the warranties expire. Here are a few issues I have documented over the last year: - Mouse will randomly stop moving or become erratic. Turning it off and on again will solve the problem. This happened to 3 of the mice. Mine did it at least once an hour before I finally took a hammer to it and bought a new mouse (which was also Logitech and is now starting to have the same problem. Lesson learned: Don't trust Logitech). - If you have a Logitech Wireless Headset there will be interference and the headset will stop working if you start using the keyboard or mouse. It restart itself once you stop typing or moving the mouse. - One keyboard's num-lock stopped working. - At least half of the keyboards got the \"Flashing battery indicator\" problem - two keyboards had an issue of \"lag\" where they would work fine for awhile, and then suddenly stop working for a second or two, and then spam the last letter pressed. So if I was typing with one of those keyboards right now it would look like thissssssssssssssssssssssssssssssssssssssssssss - One keyboard's delete key didn't work. Seems like a minor issue until you realize that meant ctrl+alt+delete didn't work. - Another keyboard would insert a hyphen (-) any time you pressed a number. -1 -2 etc. EXCEPT the number 3. - Almost all of them had to have the receiver unplugged once a week and plugged back in. Otherwise they either wouldn't work at all, or the keyboard+mouse would have bad reception. Edit 6/21/2016: It's now been a year since I left this review. In that time I've replaced 4 more keyboards. Unfortunately, thanks to the previous SysAdmin, everyone is comfortable using Waves, so I just continue to replace them. The company has decided to consider them luxuries, and employees have for the most part decided to put up with the frequent problems. When one becomes bad enough, I just swap them out with another Wave. I've started using a wireless mouse and keyboard from Microsoft and haven't had any problems.", 
                "review_comment_count": "24", 
                "review_posted_date": "05 Jun 2014", 
                "review_rating": "1.0 ", 
                "review_author": " H-H"
            }, 
            {
                "review_header": "though I like my Logitech K360 and other Logitech mice", 
                "review_text": "I decided to use bigger keyboard and mice at home, though I like my Logitech K360 and other Logitech mice. Pros: 1. well-designed keyboard. The palm cushion is a little soft which makes you wrist feel comfortable when you are not typing. It may take some time to get used to the gradual wave-shaped contour, but I think it's good too. 2. 18 programable keys. 3. The size of M510 mice is exactly what I look for. Mouse Dimensions (height x width x depth): 2.56 in (65 mm) x 4.72 in (120 mm) x 1.61 in (41 mm) 4. Battery life is long. According to Logitech, the keyboard has 3-year battery life, and the mouse has two years. Both of them use 2 AA batteris. Cons: 1. No Caps-lock light in the keyboard. 2. Home/End/Delete/PageUp/PageDown key layout is not good. I often press the bigger Delete key when I tend to click the End Key. 3. The Logitech SetPoint software (6.67) does not support M510 mouse. I can pair my other Logitech devices in the Unifying Software and manage all of them in SetPoint, but M510 is an exception. I had to download another software Logitech Options to manage M510.", 
                "review_comment_count": "", 
                "review_posted_date": "30 Jan 2016", 
                "review_rating": "5.0 ", 
                "review_author": " shylong"
            }, 
            {
                "review_header": "Great, comfortable keyboard and mouse for all platforms", 
                "review_text": "OK, this review is for everyone out there who was like me--wondering about and trying desperately to figure out if this keyboard works with Macs. First, I'll describe the feel of the product in general. I love this keyboard. It might be a bit of a stretch calling the waveshape \"ergonomic\" but it IS incredibly comfortable and natural feeling. It's an outstanding alternative to the common splitkey design if that isn't your cup of tea (it isn't mine either). For those who can't really tell, the keyboard isn't curved nearly as much as other ergonomic keyboards and the keys have a gradual \"wave\" shape going across the surface, basically creating two dips or 'cups' in the default QWERTY hand positions and an ebb or raised curve between them. The Numpad also has this curve for the hand. The keys are very soft yet springy and responsive. It feels good and, again, very natural to type on it. In fact, I think this keyboard has increased my WPM. It is a definite improvement over the flat, standard keyboard and ESPECIALLY the new wafer-style Apple keyboards. It's soft feel is vaguely reminiscent of the old Apple G3 and G4 clear plastic keyboards, if anyone remembers those. Finally, I don't know why anyone would do so with an \"immersive\" comfort keyboard like this, but it has a pair of flipdown feet in the back for the common \"raised\" keyboard setting--one set makes a 4º angle, the other an 8º. But now the pressing question that I'm sure the other Mac users want to know: Does it work for our platform?? The answer is a resounding \"yes\", with a few minor 'buts'. The keyboard and laser mouse combo works perfectly and seamlessly out of the box with the Mac platform--literally just plug in the USB receiver and you're typing a few seconds later. The box states that you must have a PC running Windows, but that is only because Logitech dropped OSX support for the macro editing program that comes with it. You do not need this program, you just can't use Logitech's software to customize the keyboard at all. You can still customize key combinations or macros with third party software though. The foil of this is that there are a few keys that the operating system doesn't even recognize. Six of the eight silver program keys are incompatible with the platform and one more sends junk input--the equivalent of pressing nearly every key at once, causing nothing. These keys cannot be read by the OS thus they cannot even be used with third party or Mac software. They are just dead keys to you. The media control keys at the top do correspond to iTunes and control it seamlessly--stop, pause, play and navigate the music that plays without having to give precedence to the iTunes window, but be warned that pressing any of those keys will automatically start up iTunes. They are far enough away from the typing area that this isn't a problem though. These keys cannot control video playback outside of iTunes, they are only for that program. The volume controls work perfectly, as does the power key. Finally, the function keys F1 through F12 do work and are recognized. They come preset for use with a function key on the bottom right of the typing surface and this is \"highlighted\" on the keyboard in blue. This system is designed to create more prewired shortcuts such as opening Windows Internet Explorer, Word, PowerPoint or Excel. None of these function combos work with OSX, even if you have the Mac versions of those programs, which is actually a good thing, because OSX defaults the F9-F12 keys for controlling the expose' features anyway. Three things I wasn't expecting that surprised me are that the printscreen key actually does activate the OSX built-in screengrab feature (command+shift+3), stranger still, the Pause/Break key controls the screen brightness--pressing the key increases the brightness and pressing Function+the key decreases it. Finally, the eject key defaults to F12 like most PC keyboards, but OSX overrides the F12 function by default to \"show Dashboard\". If you go into the Expose' System Preferences and change the key that activates the Dashboard (and make sure none of the other shortcuts for Expose' are set to 'F12', then this key will work identically to the eject key on a Mac Keyboard. I highly recommend doing this, because it is hard to find a good third party keyboard that supports the OSX tray open/close command. One final note about the key layout: by default, the Alt key, which lies directly left of the spacebar, is the 'CTRL' key in OSX and the CTRL key under the shift is the 'Command' key. This is an opposite layout to the standard Mac keyboard. You can, however, re-assign which keys call which modifiers in OSX System Preferences. This will orient the Wave keyboard to be in the 'correct' layout for Macs, but beware that, since the change occurs at the operating system level, if you connect a Mac keyboard to the computer for any reason, it will be flipped and you will have to go back into System Preferences and restore the original settings. Now onto the Mouse. [PLEASE NOTE: the following review is for the the M705 Mouse that USED to come with this package. It's still available separately, but the current version of the package does NOT have a mouse with the wheel I review here] I LOVE this mouse. It's incredibly responsive and works on all surfaces save for maybe highly reflective glass. It's a laser mouse, not an optical one, so light sources can't confuse it and it doesn't glow bright red or blue whenever you move it. It fits well in the hand and its scroll wheel is a work of art. One thing you can't tell from the pictures is that the scrollwheel is \"floating\" in its container under the surface of the mouse. It has cumulative scrolling, so when it's in \"free mode\", you can spin it (literally, it just glides--like spinning the wheels of a toy car) and the scrolling will match it--not stopping until the mouse wheel itself loses all the momentum from being spun. This is an INCREDIBLY nice feature if you do film editing or anything similar and are accustomed to using the Mac scrollwheel or middle finger swipe to advance through frames in Quicktime or any other film editing program, though it is very nice for thumbing through documents and PDFs too. In addition to being fun, this is equivalent or perhaps even better than the Apple Magic Mouse's \"momentum scrolling\" (scrolling that is faster or slower depending on the speed of the stroke or in this case the spin). Now, I absolutely love \"free mode\", but if you need something more precise, there is a button on top of the mouse just behind the scrollwheel that will \"lock\" the wheel onto a track, giving it that smooth \"clicking start/stop\" feel that most PC mouses have. Press it again to disengage the wheel back into \"free mode\". The mouse has three other buttons, all located on the thumbside--two arrow buttons and the entire thumbpad is actually a button too. For OSX, all three do the same thing, which is the same as the middle button or scrollwheel click. It may be possible to reassign these using third party mouse software, but I haven't tried because I really only use that function for opening tabs in web browsers. So there you have it: a great, comfortable and responsive quasi-ergonomic keyboard that works just shy of perfectly for Macs as well as PCs. I love it and I am very happy with my purchase. I HIGHLY recommend it for anyone looking for a 'natural style' ergonomic keyboard and ESPECIALLY for Mac users looking for the same.", 
                "review_comment_count": "9", 
                "review_posted_date": "08 Feb 2012", 
                "review_rating": "5.0 ", 
                "review_author": " Stern Dragoon"
            }
        ], 
        "ratings": {
            "2 star": "5%", 
            "1 star": "7%", 
            "4 star": "16%", 
            "3 star": "6%", 
            "5 star": "66%"
        }, 
        "price": "$49.51", 
        "url": "http://www.amazon.com/dp/B003VAHYNC", 
        "name": "Logitech Mk550 Wave Wireless Keyboard/Mouse Combo"
    }
]