[
    {
        "reviews": [
            {
                "review_header": "Waterproof!", 
                "review_text": "All the other info from the reviews seems true to me about the speed and whatnot, (It's not the fastest), but one thing that I noticed is that the top reviews didn't test the waterproof claims on the product. Well after washing it through almost a complete cycle, cancelling the wash, and fishing it out of some sopping pants, I can say that it is waterproof. I dried it off with a towel and blew out the port, plugged it in, and it still works just as it did before. Data was still there, new data copied on, and everything was fine, and for that I give it five stars.", 
                "review_comment_count": "2", 
                "review_posted_date": "16 Jan 2016", 
                "review_rating": "5.0 ", 
                "review_author": " ChriZ0529"
            }, 
            {
                "review_header": "The flash drive is super small at the same time very fast compared to ...", 
                "review_text": "The flash drive is super small at the same time very fast compared to other metal USB 3.0 flash drives. The best part of this; the key chain holder is metal and strong and you can take it with you and your keys anywhere.", 
                "review_comment_count": "11", 
                "review_posted_date": "30 Nov 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Sam Ad"
            }, 
            {
                "review_header": "*Updated* The blue version is a not very durable plastic flash drive", 
                "review_text": "*Update 01-17-17* Thank you to everyone who has pointed out that the description has now actually been updated to properly describe the drive as plactic. I can assure you though that when I purchased it the description was literally identical to the metal version of this drive just with the removal of the \"high-quality meta casing\" descriptor. Which for what it's worth I didn't even notice until I went back after I had already bought and recieved the flash drive, to try and figure out where in the original description that it was described as being plastic. As far as the actual drive goes, a large peice of the casing has now broken off and I have stopped carrying it around daily. Now this drive is somewhere in my nightstand and will probably soon be replaced by something more durable. However for its flaws, it does still function, so it would probably function just fine for a more light duty role. I wouldn't expect it to survive long on a keychain though. *Update 11-9-16* Well it had a good run... of like 3 months. But now the case has actually started to break apart much as I expected it would. I have not abused this drive at all. Well at least any no more than just living on my keychain where other flash drives have survived just fine for years. Also to be clear I always removed it from said keychain before using it... I wound never expect a flash drive to support a set of keys dangling from my computer. Before I was annoyed mainly by the unclear description of the product, but at this point I would no longer recomend these blue plastic flash drives at all unless they are going to live a much more sheltered life than mine has. The only reason I am not dropping this review to one star is because so far, despite it's flaws, it does still work. **Original Review** I ordered the Regal Blue version of this flash drive because I thought the blue color looked really nice. However I was quite surprised to find out when I received it that it is actually made out of plastic. Nowhere in the description could I find any actual mention of this drive having a plastic body. The only difference in the description from the silver metal version is that they removed \"High-quality metal casing\" from the description of the regal blue version. Overall it seems like it works just fine and transfers files at a reasonable rate, but I just don't think it is going to be as durable as I had assumed it would be. The plastic seems very thin and bendy and it is already showing wear after just a single day on my key ring. I just don't see it surviving as long as my old Kingston did on my key ring. To be fair, I honestly don't have any issues with Samsung selling a plastic version of this flash drive. I just wish they would have made it more clear that's what it was, because I would have happily bought the actual metal version instead.", 
                "review_comment_count": "19", 
                "review_posted_date": "16 Aug 2016", 
                "review_rating": "2.0 ", 
                "review_author": " Lokiparts"
            }, 
            {
                "review_header": "can get aggravating in your pocket", 
                "review_text": "very nice quality, the only problem i have is the key ring loop design. if it's not arranged correctly on your keyring, it will stick out", 
                "review_comment_count": "2", 
                "review_posted_date": "05 Aug 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Nathan K"
            }, 
            {
                "review_header": "An Alien Piece of USB 3.0 Technology", 
                "review_text": "It's big project deadline time, and you're trying to transfer large files back and forth; you can't be stuck with USB 2.0 speeds (a decade old technology), you need a fast flash drive. This is the USB 3.0 flash drive you're looking for. There are so many different designs for flash/thumb drives out there; there's something for everyone. I wanted something that looked solid and simple, was reliable, and fast. This was it. Here's why: • The one piece body feels solid, but lightweight, and looks gorgeous • There is no cap to lose, and the USB end is sturdy enough to stand up to heavy use • The little hole can be used to attach to a key ring if necessary *** NOTE *** Please be aware that this drive is capable of USB 3.0 transfer speeds of \"up to 130MB/s\". You will only get this speed if the computer you are attaching it to also has USB 3.0, otherwise it is backwards-compatible and will reduce to USB 2.0 speeds. You can tell if it's USB 3.0 if the inside port is a blue plastic, or if the port is labelled \"SS\" (SuperSpeed). The design looks like it could've been built by aliens [see photos]. It's so simple, yet just works. It's solidly-built, with no small pieces to lose, and big and shiny enough to be visible, and is blazingly fast. Recommended.", 
                "review_comment_count": "1", 
                "review_posted_date": "11 Jan 2016", 
                "review_rating": "5.0 ", 
                "review_author": " benjamin bannister"
            }, 
            {
                "review_header": "Quite possibly a perfect USB drive...", 
                "review_text": "I bought this Samsung 32GB USB 3.0 drive to use as a dedicated Linux Live USB flash drive. The first thing that I noticed when I opened it was the feel of quality. It feels like it is well made with quality materials, and it is definitely aesthetically appealing as far as USB drives go. Also, this thing is small! It is the perfect size for a USB flash drive. If you are looking for a quality USB drive that is also easy on the eyes or doesn't come with a cap that will end up getting lost, look no further. I will update this review if anything happens or changes in the future. If I don't, assume it is still working flawlessly and there are no problems to report.", 
                "review_comment_count": "2", 
                "review_posted_date": "01 Dec 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Jesse Lee"
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "5%", 
            "4 star": "14%", 
            "3 star": "5%", 
            "5 star": "73%"
        }, 
        "price": "$21.80", 
        "url": "http://www.amazon.com/dp/B013CCTM2E", 
        "name": "Samsung 32GB BAR (METAL) USB 3.0 Flash Drive (MUF-32BA/AM)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Excellent solution to my 16 GB iPhone", 
                "review_text": "This 32GB USB Flash Drive for iPhone 32GB by G-TING Is amazing. I have an iPhone 6s with only 16GB which is not much. I was so excited to buy this flash drive so I can keep my pictures and videos instead of always trying to figure out what I can delete. The flash drive is very easy to use. Once you insert the flash drive into your phone it will prompt you through it. I was able to transfer all of my videos and pictures onto the flash drive without any problems. I always had a problem connecting my iPhone to my laptop to transfer pics and videos, but not anymore. After transferring to the flash drive I was able to insert the flash drive into my laptop and transfer everything within minutes. This is a great way to expand your phone memory. This is an awesome flash drive at a great price. I would recommend this item.", 
                "review_comment_count": "", 
                "review_posted_date": "27 Dec 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Lucinda"
            }, 
            {
                "review_header": "Works great with iPhone 5s.", 
                "review_text": "This drive worked great with my iPhone 5s. It did not work with my iPad Air 2. My purchase was was for use with my phone so I am not worried that it doesn't work with my iPad.The drive has no way of locking and slides easily so you have to keep your finger on the end when inserting into the lightning port. Otherwise, it will not go in. I have documented this in my video review. It is a good drive with the exception of the mentioned slide issue. The I-easy drive app is simple to use. It is not a robust program by any means but in this case, simple is best!", 
                "review_comment_count": "1", 
                "review_posted_date": "16 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Debra Brad"
            }, 
            {
                "review_header": "USB Flash Drives for iPhone 32GB", 
                "review_text": "What a super cool easy to use flash drive.. I purchased this for my wife as she had about a million photos on her iPhone (really only about 1200) and needed an easy way to save them all and free up space on her phone. The App instllation was painless and once I explored the drive's options I was able to copy ~ 1200 photos/videos over in about a minute.. Super easy to use and after all that copying it only required 6% of the drives memory which means it has Soooooooooooo much more... A+++ Product! If you found this review helpful please indicate such and if you have any questions please feel free to ask.. Thanks", 
                "review_comment_count": "", 
                "review_posted_date": "02 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Craig White"
            }, 
            {
                "review_header": "This is what I need to easily transfer a lot of photos in my phone", 
                "review_text": "This is what I need to easily transfer a lot of photos in my phone. The manual is easy to follow because of the clear instructions in English with some photos & diagrams included. Once the needed app is installed, everything will be simple to understand. It's a tiny, slim, & small flash drive but good enough to hold 32GB. When writing a name for a folder on where to transfer the files or photos, make sure that you don't include any character, not even a space because it will not be accepted, will be prompted as error. The \"edit\" command functions most of the time, so if you'll be a bit confused, just tap edit and everything will work fine. This flash drive is very useful for me. This will definitely saves my phone's memory storage. The copying is nice & fast. My only concern on this product is the lack of cover to protect both tips. Although the sliding mechanism in between would cover one end, the other is always left open and exposed. If they could provide a case perhaps, it would be a good protection option. Overall, I am satisfied with this USB flash drive. It's worth the price. Thanks for reading & hope my experience on this product has helped you. Have a nice shopping!", 
                "review_comment_count": "", 
                "review_posted_date": "24 Dec 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Sunny San Diego"
            }, 
            {
                "review_header": "The best purchase I’ve ever made!", 
                "review_text": "This has been perfect for my phone. I never have enough memory on my phone for my photos and videos. Weekly, I record my daughters dance lessons which are an hour long and my phone won’t allow that much memory, over a hundred plus photos, multiple apps, etc. I definitely don't want to spend extra money on my monthly bill and to try and save money I wanted to try a simple and easy way to download data immediately without needing access to a computer. This little device has been such an amazing product. I’m able to record my daughters dance lessons, download it on to the USB Pen-Drive Memory Storage and still have enough storage on my iPhone for other things. I don’t know what I ever did without it. With this USB 32GB Pen-Drive Memory Storage you are able to download and/or transfer files, photos, videos, music, etc,. The instructions are easy as 1, 2, 3….I bought one of these for each of my daughters so they would have one for school. They love it! Benefits: • Password protected files are secure by encrypted software so you can share sensitive content securely • Able to store movies, videos, photos, files, etc., and take them with you anywhere at anytime • USB flash drive is small and compact to take with you with ease and convenience. Formats supported: • Music: m4a, aiff, caf, mp3, wav • Image: gif, jpg, png,jpeg • Video: avi, flv, m4v, mkv, mov, mp4, rmvb • Document: doc, ppt, xls, xlsx, pdf, html, txt Features: • Apple (Made for iPhone/iPod/iPad) lightning connector with authorization chip issued by Apple to ensure 100% compatibility with any Lightning device with NO annoying error message. • Quick and easy transfer - Directly plugs into your lightning port and USB port; experience up to 80 MB/s reading and 40 MB/s writing speed with USB port. (the SD Card is free) • Strong back storage - Amazing transfer speed using its dual 8-Pin and standard USB connector, Automatically Record Your Photo/Video to Flash Drive Directly - 32GB external memory expansion, quickly free up memory on your iPhone/iPad • Format friendly streaming app - The FREE APP “i-Easy Drive\"supports all major video and music formats so you can stream directly from the iPhone flash drive, Saving you precious space and time. Record videos and take photos directly to the G-TING iOS memory stick via APP • Access security - Password protect your data safe on \"i-easy Drive\" (flash drive) and \"iPhone\" (in-app storage). Open TouchID and Password on setting to secure your whole storage, or Lock selected files with password. Perfect to protect individual privacy • Compatibility and warranty - Lightning connector - Ensure 100% compatible and syncs with Apple lightning devices, can be used as iPhone 6 6s Plus 6 Plus 5s 5c 5 flash drive, iPad Air, Air 2 mini flash drive. (18 MONTHS WARRANTY GUARANTEE)", 
                "review_comment_count": "", 
                "review_posted_date": "21 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " The Chosen One"
            }
        ], 
        "ratings": {
            "2 star": "0%", 
            "1 star": "9%", 
            "4 star": "8%", 
            "3 star": "6%", 
            "5 star": "77%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01MTWDJ1Q", 
        "name": "USB Flash Drives for iPhone 64 GB Pen-Drive Memory Storage, G-TING Jump Drive Lightning Memory Stick External Storage, Memory Expansion for Apple IOS Android Computers (Gold)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Very convenient size and shape", 
                "review_text": "The size and shape works well. Several of the flash drives I have are \"fat\" and difficult to use next to other occupied ports. A couple are so small they're difficult to get hold of. They address both issues well. I use them for frequently used utilities (e.g. GParted, Clonezilla, etc.) instead of CD/DVDs I have been using. A lot less fuss and they load faster even though they're only USB2.", 
                "review_comment_count": "", 
                "review_posted_date": "20 Jul 2015", 
                "review_rating": "5.0 ", 
                "review_author": " J.Ingle"
            }, 
            {
                "review_header": "Good read and write speeds", 
                "review_text": "Good read and write speeds, haven't had any disk related problems that result in trouble accessing/reading/writing, seems to be accepted well with Haas TL-1 control panels and ProtoTrak SMX control panels (at least the ones at my school's machine shop), when both have been proven to not accept other kinds of flash drives for reasons unknown, even though the formats are the same. Another student tried their own flash drive, and would not be registered on the program output screen. I plug in my Cruzer Blade, instantly detected and accessible. (Kinda unrelated) I have heard rumors that using large capacity flash drives >8gb-16gb on the same control panels tend to cause the system to take a long time accessing the flash drive due to the large amount of space, but that's proven to be false... far as i know. As a plus, they are compact and moderately flat, which makes for easy storage while on the go.", 
                "review_comment_count": "", 
                "review_posted_date": "20 Oct 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Noebuhd"
            }, 
            {
                "review_header": "I then decided to use a 64gb for the car once i found a way to format that to fat32 like the 8gbs", 
                "review_text": "I bought this to replace 3 year old 8gb sticks that I used for music in the car. I then decided to use a 64gb for the car once i found a way to format that to fat32 like the 8gbs. I decided that my brothers could use these for their music and have given them each one filled with music. They are small enough to fit in tight spaces where the car companies put their USBs. I tried them out in my car USB and on one of those chinese fm transmitter cigar lighter adapters. Everything works great. I would buy again if needed.", 
                "review_comment_count": "", 
                "review_posted_date": "29 Jul 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Daniel R. Bissell"
            }, 
            {
                "review_header": "Dependable and No Frustration with Inserting in USB Port!", 
                "review_text": "As for thumb drives, these have the best design for my tastes. No frustrating sliding of the connection in-and-out, fumbling to get it inserted in the USB port, and it is just the right size to allow two to be inserted side-by-side (or top and bottom) if this is the way the receiving USB ports are configured in your computer. I keep the unused and archived ones in the zippered Case Logic case with six web-straps.", 
                "review_comment_count": "", 
                "review_posted_date": "28 Jul 2016", 
                "review_rating": "5.0 ", 
                "review_author": " AdoptAPet"
            }, 
            {
                "review_header": "Small and cool and very reliable.", 
                "review_text": "Not my first purchase for these. They are a little slow when transferring large or lots of files and a little lightweight but they are small, cool, inexpensive and very reliable. I thought about deducting a star for speed & weight but I figured as long as you are aware of those facts and are accepting of that then they are deserving of the 5 stars. If you are looking for FAST & / or heavy then maybe you should look elsewhere.", 
                "review_comment_count": "", 
                "review_posted_date": "07 Apr 2016", 
                "review_rating": "5.0 ", 
                "review_author": " The Gu"
            }, 
            {
                "review_header": "Bad value", 
                "review_text": "Standard flash drives, they work but aren't a good value (for ~$10). For the same price you can get a 32 GB USB 3.0 with much higher quality storage*, or two 16 GB USB 2.0 drives. I strongly recommend looking for better drives *Flash drives wear out and eventually lock (read-only). Newer drives, like Samsung NAND, will last significantly longer. For small documents and light loads you probably won't reach the write limit on these (SanDisk x 2). USB 3.0 is backwards compatible with 2.0, can be more than 10x faster, and is generally better engineered", 
                "review_comment_count": "", 
                "review_posted_date": "04 Oct 2016", 
                "review_rating": "2.0 ", 
                "review_author": " Shane W."
            }, 
            {
                "review_header": "Can't go wrong with Sandisk.", 
                "review_text": "These were a great deal. Extra USB drives are always handy to have, you never know when you'll need one of these (assuming you work in an office and use digital forms of pictures, music, documents, etc). The drives are really small, which is annoying, if you want to keep track of these in a bag or drawer. Sandisk has yet to let me down for both memory cards and USB sticks. It would be nice if there were two lanyards (which are only big enough for a wrist), but it was still a great value.", 
                "review_comment_count": "", 
                "review_posted_date": "05 Jul 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Mer S"
            }, 
            {
                "review_header": "Failed after a month of use", 
                "review_text": "Within 30 days the first ScanDisk stopped working (would no longer be recognized on computer with error message that the drive has failed). That didn't surprise me as after a minute or two the ScanDisk gets very hot. Only cost a couple of dollars, so I'm not going through the process of returning, just throwing it in the garbage. I was very surprised as I thought ScanDisk was a quality name; guess the price should have tipped me off. Spend your money elsewhere.", 
                "review_comment_count": "", 
                "review_posted_date": "07 May 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Tom M"
            }
        ], 
        "ratings": {
            "2 star": "2%", 
            "1 star": "2%", 
            "4 star": "16%", 
            "3 star": "4%", 
            "5 star": "76%"
        }, 
        "price": "$14.99", 
        "url": "http://www.amazon.com/dp/B008B8BK5W", 
        "name": "SanDisk Cruzer 32GB (16GB x 2) Cruzer Blade USB 2.0 Flash Drive Jump Drive Pen Drive SDCZ50 - Two Pack w/ Everything But Stromboli (tm) Lanyard"
    }, 
    {
        "reviews": [
            {
                "review_header": "WARNING: This drive gets HOT!!!", 
                "review_text": "I've been impressed with the size and speed of the drive so far, and it works great as a keychain, but the drive itself gets VERY hot and is difficult to touch, especially closer to the port. I would recommend gripping the back of the drive near the plastic loop when removing the drive from your computer. Just thought I would warn everyone since I could see getting burned.", 
                "review_comment_count": "3", 
                "review_posted_date": "21 Nov 2015", 
                "review_rating": "4.0 ", 
                "review_author": " R. Hamilton"
            }, 
            {
                "review_header": "Small flash drive with good speed", 
                "review_text": "Overall this is a great flash drive, it gets around 140MBs read and 40MBs write (Slightly slower than the 64GB version). It's not quite as fast as the SanDisk extreme version but it's the fastest metal drive I've found, you can see a benchmark in the attached image. The metal design seems sturdy and should hopefully hold up to being thrown around with my keys. My only complaint would be that the drive is part metal (silver portion) and the key ring part is plastic (black/grey portion in picture). I was hoping it would be all metal but the plastic key ring seems sturdy and it should hold up over time. One other note is that the drive can get very warm when doing large transfers, it's to be expected for a small metal drive like this but it's worth mentioning.", 
                "review_comment_count": "", 
                "review_posted_date": "03 Nov 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Mike"
            }, 
            {
                "review_header": "Fast and large enough to run VHDX's for demo purposes on your laptop.", 
                "review_text": "I run Hyper-V on my Windows 10 laptop that has an SSD with 16GB RAM and Core i7 processor. I keep my WIndows 2012R2 VHDX's on the SanDisk USB 3.0 Flas Drive for SSD performance on my Hyper-V servers! It gets a little warm, within spec they say, but to keep it cool I stuck some heatsinks for a Rasp-Pi on it. Since the case is metal, heat transfer is excellent and I no longer worry about the temp of my external, thumb-sized SSD!", 
                "review_comment_count": "8", 
                "review_posted_date": "16 Apr 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Satisfied-Customer"
            }, 
            {
                "review_header": "Fast and stable drive @128Gb", 
                "review_text": "Overall very happy with the capacity and performance of this tiny thumb drive especially at this price. Bought a Si Power 128 GB sometime last year and this one's performance is just way better. The SiPower drive (also USB3) was not very responsive, always need to wait for a couple of seconds before it responded, even when what I did was opening a folder on the thumb drive. But for SanDisk Ultra Flair, I don't see this issue at all! Was thinking that it might be due to the 128GB but loos like it's just some thumb drive is just not that responsive. Have included a picture for relative size comparison among SiPower, Sandisk Extreme and Ultra Flair. As mentioned by some ppl it's warm after use but I don't think take that as an issue with this drive as everything is packed into such a tiny thing.", 
                "review_comment_count": "", 
                "review_posted_date": "05 Jun 2016", 
                "review_rating": "5.0 ", 
                "review_author": " James K"
            }, 
            {
                "review_header": "HOT HOT HOT --- in a bad way; Dangerously HOT", 
                "review_text": "This is for the SanDisk Ultra Flair USB 3.0 64GB. I've purchased so many SanDisk products in the past, including many flash drives, and never had a problem at all, that I didn't even read the reviews before I bought this in a hurry. Now I wish I had. This thing gets dangerously hot very quickly. I've never seen anything like this. I thought mine must be defective, but then looked at reviews and saw lots of similar complaints. I was able to copy ~35GB very quickly, but then pretty much burned my fingers trying to remove it. I must grab it by the thin plastic part, not the \"easy to grab\" metal, to avoid burning. And, I wouldn't want to leave it plugged in very long for fear of melting or fire! I am concerned what this heat means for reliability, so I'll look for a replacement.", 
                "review_comment_count": "4", 
                "review_posted_date": "27 Aug 2016", 
                "review_rating": "1.0 ", 
                "review_author": " HG"
            }, 
            {
                "review_header": "Seek elsewhere, this drive is too hot to handle (literally), and slows down ridiculously", 
                "review_text": "Do not recommend, why because it does the job albeit fairly poorly. It is not fast even at its bestest, meaning when it has been unused for several hours, and therefore as cool as can be (40 MB/s) When at its worst, meaning several hundred Megabytes worth of files (MB), its slows down to unbearable speeds (8 MB/s or 1/5 of regular), sometimes getting so hot that it does not exceed a single MB. It gets 2 stars because there's other drives just as cheap, that DO NOT slow down, and do NOT become scalding hot, like 5 mins after freshly made tea scalding. I know the drive is poorly made because when you use your fingers as a heatsink, it speeds up again to around 10 MBs, however losing 10s of MB of the speed due to poor design is simply ridiculous (from 30 to 10, or even simply 3 MB/s)", 
                "review_comment_count": "1", 
                "review_posted_date": "09 Nov 2016", 
                "review_rating": "2.0 ", 
                "review_author": " F. Blanco"
            }, 
            {
                "review_header": "I bought this 128GB drive because I needed more storage ...", 
                "review_text": "I bought this 128GB drive because I needed more storage. I had a Silicon Power 64GB Jewel J80 USB 3.0 Flash Drive, Titanium (SP064GBUF3J80V1T) which has held up well but it maxes out at 64GB. The Silicon Power is all metal. I was a little wary of this one's plastic loop to attach it to my keyring but it's actually thick and seems strong. I was not exactly clear on how it fit on a keyring but it does! It's also actually smaller than the Silicon Power one! How do they do it??? As for speed, it is plenty fast enough on my USB 3.0 equipped laptop and I don't notice it taking any more time than my last drive did on the USB 2.0 equipped classroom computers. How's that for a completely subjective analysis? The whole reason I needed a larger drive was to carry class movies to class. It handles the large files just as well as the Silicon Power did. I've been using it for a week on a keyring with several big keys. If it fails on me, I'll be back on here to knock stars off. If you're reading it with 5 stars, it means it's still holding strong! (photos show its size and I still have the Silicon Power one on my key ring for comparison; it's next to the SanDisk)", 
                "review_comment_count": "", 
                "review_posted_date": "05 Sep 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Paul Q"
            }, 
            {
                "review_header": "Performance quickly degrades over time, hot, inconsistent speeds.", 
                "review_text": "It was fast when I first got it, speeds were over 120 MB/s read and over 30 MB/s write. However, after transferring 100 GB+ files several times, the performance quickly degraded. Now it's showing 40 MB/s read and 25 MB/s write. The culprit I'm assuming is the heat, it simply toasted itself. Like other reviewers have said, it gets extremely hot even after just a couple minutes. Imagine how long it would take and the amount of heat it would suffer writing 116 GB worth of files onto it, then reading 116 GB of files as you transfer them off. A few transfer sessions and this thing quickly burned itself out. Still, the price you pay for 128 GB of storage isn't bad, and the performance is still okay.", 
                "review_comment_count": "1", 
                "review_posted_date": "23 Jul 2016", 
                "review_rating": "3.0 ", 
                "review_author": " Geodude"
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "8%", 
            "4 star": "17%", 
            "3 star": "8%", 
            "5 star": "63%"
        }, 
        "price": "$19.99", 
        "url": "http://www.amazon.com/dp/B015CH1NAQ", 
        "name": "SanDisk Ultra Flair USB 3.0 64GB Flash Drive High Performance up to 150MB/s (SDCZ73-064G-G46)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Great for in car use", 
                "review_text": "I purchased this USB flash drive for musical purposes in my car. So far so good! Very easy to install in the car's USB. Sometimes it can be tricky to install small flash drive in the car because of the size. This particular flash drive just excellent for my needs. No harm for my manicure while I try to plug in or plug out. Nice size, great speed.", 
                "review_comment_count": "", 
                "review_posted_date": "20 Aug 2014", 
                "review_rating": "5.0 ", 
                "review_author": " OlgaW"
            }, 
            {
                "review_header": "Great Portable Storage", 
                "review_text": "This drive is tiny, smaller than my thumb, but packs a good bit of storage in a very tiny space. It has a hole for a lanyard or keyring to attach to it so you don't lose track of it. If you're prone to losing small things, I definitely recommend attaching it to something, but this is great for extremely portable storage. I wouldn't recommend putting it in a pocket or somewhere it might get squished, as it looks like it could snap easily, but if used as intended, it should last a long time.", 
                "review_comment_count": "", 
                "review_posted_date": "26 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Amanda M"
            }, 
            {
                "review_header": "Very Good - For the Price: Detailed Product, Price, and Shipping Review with Examples", 
                "review_text": "Price: ***** 5 Stars for price. At $4.29, you really can't beat it (at least not with a product of the same quality). At about 28 cents per gigabyte, it comes out to be cheaper than the 32GB (31 cents per gigabyte) and the 8GB (52 cents per gigabyte) of the same brand. Shipping: **** 4 Stars for shipping. I had to have all my products grouped together when purchasing, so I spent a week waiting. After it shipped, though, it came very quickly. Product: ***** 5 Stars for the product. It works as expected, although there are some extra features and some issues that I have had. The extra features include the SanDisk Secure Access Vault, which allows you to password protect specific files. I did not know that that was a feature, but it's good to know that my files can be secured. However, the Secure Access Vault did not allow me to update it on my Windows computer. That was not a problem for me, but if you have a mac that is running the latest version, you may run into trouble. The drive feels very cheap, and is made almost completely from plastic. It obviously will not withstand too much rough use, so be careful not to drop it or apply too much pressure to it. The item is made in China, as shown on the product. Also, the actual storage capacity if 14.5 GB, not 16 exactly, so be careful if you need that amount of space. For the price, you really can't beat this product. It is small, compact, and opens extremely fast on my computer. I just unplugged it and replugged it in and the folder opened almost immediately. It also features a small hole near the top that can be used to attach it to a lanyard or keychain. Examples: Attached to this review are some images of the drive, including a front view, back view and a view of the lanyard hole for reference.", 
                "review_comment_count": "", 
                "review_posted_date": "26 Feb 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Elijah"
            }, 
            {
                "review_header": "Good quality, and they key ring slot is an absolute must if you keep losing them (like me)", 
                "review_text": "I keep losing flash drives. I don't know how, but flash drives have entered the same category as sunglasses and scissors - they just up and disappear on a disturbingly regular basis. So here's what I did: I bought a big lanyard holder. I bought two of these things. I then put them on a key ring and hung it by my office door. Appears to have been a success. The drives themselves are quality, small enough to be unobtrusive but large enough not to look completely silly on a key ring.", 
                "review_comment_count": "", 
                "review_posted_date": "26 Dec 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Josh Bossie"
            }, 
            {
                "review_header": "Cheap and good size, but so small it's scary.", 
                "review_text": "This is a decent little bit of storage for the price, but it's very small and quite flimsy. It's so light and plastic-y that I would be worried I'd lose it on the floor and my dogs would swallow it. If you have small children, be careful! Read times were fast enough and everything worked as advertised, but I just worry about its tiny footprint.", 
                "review_comment_count": "1", 
                "review_posted_date": "06 Dec 2015", 
                "review_rating": "3.0 ", 
                "review_author": " Beau Hindman"
            }, 
            {
                "review_header": "Craptastic..", 
                "review_text": "About a year ago I purchased these drives, and I bought them in bulk some from amazon and others from the local electronics store (30 units). Every drive lasted me about 15-30 days. What a pile of s***, luckily I was just using these drives for non mission critical things and I didn't mind if they broke cause I had a backup and only needed them for updating firmware on servers & changing passwords. If you want a reliable drive stay away from these, the housings crack easy, they stop reading, and they are slow as s***.", 
                "review_comment_count": "1", 
                "review_posted_date": "11 Aug 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Nicolas Alvarado"
            }, 
            {
                "review_header": "Seem good for the price, use in FreeNAS mirror setup.", 
                "review_text": "I am using 2 of these in a mirror configuration for a FreeNAS machine with this little low power mobo. https://www.amazon.com/gp/product/B00JMQ1V24 They seem to have acceptable write speeds and I would say slighlty above average cheap USB flash drive reads. They are faster than the 4GB Patriot USB flash drive I had laying around. Anyway they have been running for about a week now. If any of them fail prematurely I'll update my review. FreeNAS is designed to run off USB flash drives though so they should in theory last quite a long time. They otherwise seem pretty solid for the price.", 
                "review_comment_count": "", 
                "review_posted_date": "28 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Kiteless"
            }, 
            {
                "review_header": "Its garbage. STAY AWAY!", 
                "review_text": "I cannot believe how poorly these are constructed. I guess you get what you pay for. But seriously, Sandisk used to be a good company, what happened? there is absolutely no metal on it; all plastic. It feels like it will break when you touch it. They are basically disposable drives, with a very short lifespan, and very limited purposes.", 
                "review_comment_count": "1", 
                "review_posted_date": "10 Nov 2015", 
                "review_rating": "1.0 ", 
                "review_author": " Ken B."
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "5%", 
            "4 star": "16%", 
            "3 star": "5%", 
            "5 star": "71%"
        }, 
        "price": "$15.99", 
        "url": "http://www.amazon.com/dp/B00BX5FOCK", 
        "name": "SanDisk Cruzer Blade 64GB USB 2.0 Flash Drive- SDCZ50-064G-B35"
    }, 
    {
        "reviews": [
            {
                "review_header": "It does not transfer data as fast as it is supposed too and burns you.", 
                "review_text": "It does not transfer data as fast as it is supposed too and burns you. I was excited to use it for the first time, plugged it into the USB 3.0 and attempted to move 45gigs of data with a 40 MIN eta, yay! After five minutes the 30 min eta went to 6hrs and 45mins! the drive was slowing down... but why? I touched it and it burned me, so I busted out my thermal imaging camera to check and it was in excess of 130 degrees Fahrenheit, after it cooled down and started transferring slower. This is obviously a dangerous product as applied heat of 131 degrees Fahrenheit causes second-degree burns on exposed skin, how can they sell stuff like this?", 
                "review_comment_count": "5", 
                "review_posted_date": "18 Aug 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Slick Nick"
            }, 
            {
                "review_header": "Extremely hot. Dangerous product.", 
                "review_text": "I copied ~15GB of big files to SanDisk 32GB model from a ThinkPad X1 Carbon. I noticed that the speed quickly dropped down to less than 10 MB/s, so I was disappointed because my USB 3.0 drives are consistently fast. But as if the slow speed was not bad enough, I literally burned my fingers when I unplugged it. I did not receive a bad burn, but I can still feel the burn on the tips of my index finger 10 minutes later. I am an adult male. I am not extra sensitive to hot temperatures. This device is a danger to both humans and to USB ports. In their comments, SanDisk is lying about the max 95 F temp. I copied a 4GB file to the device, and measured the temp at 120 F - see attached pic. I assume it would go higher if I copied more data.", 
                "review_comment_count": "16", 
                "review_posted_date": "03 May 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Pagliano Servero"
            }, 
            {
                "review_header": "Gets too hot, ended up being corrupt on the first attempted use. READ REVIEWS BEFORE YOU BUY!", 
                "review_text": "Of the (literal) HUNDRED+++ \"SanDisk\" storage drives I have purchased for over a decade, this is the first that's failed me. Not only did it fail me, but it failed on my FIRST attempt of use! :( I transferred 78GB file (Photo library - 1 file - Mac). Albeit, it took almost 7 hours to transfer, it did end up fully transferring). I then went on to transfer enough (additional) files to fill up 94-95% of it's registered capacity per my computer's displayed capacity of 124.22GB. I do this with all new storage drives I purchase - I fill them up almost to 100%, then transfer the files to another external storage system I have and check the integrity of the files sent from the new device to my ultimate backup device. If they made the transfer successfully on and off the new drive, I then precede to use it for whatever my heart desires. Like other reviewers on here, it got extremely hot and ended up slowing down quite a bit (seemingly after seconds of initiating the copy/paste transfer). Unfortunately, the drive ended up becoming corrupt and now I can't remove the files from my trashcan. I've tried \"Verifying\" and \"Repairing\" the disk via \"Disk Utility\" on my MacBook air, as well as a secondary Apple Desktop. I've also attempted to remove it through the \"Terminal\" via Apple's latest OS system. Additionally, I've taken it to the local Apple store in-person to see if there was something else I wasn't trying... It's completely unusable now and what's also unfortunate is I just recently found the time to start working with it since purchased (Nov. 28th of last year) = past the 30 day return policy. Not only am I out the money I spent on this item, but I'm also out a number of hours (6+) of my time from attempting to resolve the issue. Huge disappointment. Seems as though SanDisk had a huge design flaw with this specific model (makes sense, considering the advertised capacity versus the physical dimensions). Do yourself a favor and look elsewhere for your external digital storage needs.", 
                "review_comment_count": "2", 
                "review_posted_date": "05 Jan 2017", 
                "review_rating": "1.0 ", 
                "review_author": " PhunGu"
            }, 
            {
                "review_header": "Do not waste your money. Amazon will not allow returns!", 
                "review_text": "Write speed starts off great around 40MB/sec. Then drops to 10-15MBs. Moreover, like others have said, HOT. I bought this for my wife for Christmas after Thanksgiving; I tried to return it and evidently it is not returnable? FYI, I am able to move the same file in the picture over to a 2.0 USB SD Card @ 25MBs from the same USB 3.0 port.", 
                "review_comment_count": "", 
                "review_posted_date": "31 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Ryan Reddell"
            }, 
            {
                "review_header": "After one use, it lost the ability to work on USB 3 ports.", 
                "review_text": "I used this to transfer files from an older iMac with only USB 2 ports to a new iMac with only USB 3 ports. I plugged it into to a powered USB 2 hub on the old iMac and copied about 8GB of files to it. I ejected it and then plugged it into a powered USB 3 hub connected to the new iMac and copied the files onto the new iMac's hard drive. I ejected it and reconnected it to the old iMac. I deleted the files from it. I copied more files onto it and ejected it. I plugged it into the same USB 3 hub on the new iMac, but it would not show up. I tried many things but the flash drive simply would not show up. I plugged it into a USB 3 port on my Windows PC, and it wouldn't show up there either. My Windows PC also has some USB 2 ports and I tried plugging it in there. It DID show up! I connected a USB 2 hub to the USB 3 hub on the new iMac and plugged the flash drive into the USB 2 hub. Guess what... it DID show up. So after the first usage, this device does not work on any USB 3 port. This is strange, because USB 3 ports are supposedly downward compatible with USB 2 devices. Also, the USB 3 hub had no problem working with the USB 2 hub. The really disappointing aspect of this is that I'm told \"This item is not eligible for return\". I've been had!", 
                "review_comment_count": "3", 
                "review_posted_date": "22 Sep 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }
        ], 
        "ratings": {
            "2 star": "5%", 
            "1 star": "12%", 
            "4 star": "13%", 
            "3 star": "6%", 
            "5 star": "64%"
        }, 
        "price": "$32.90", 
        "url": "http://www.amazon.com/dp/B01BGTG2A0", 
        "name": "SanDisk Ultra Fit 128GB USB 3.0 Flash Drive (SDCZ43-128G-GAM46) [Newest Version]"
    }, 
    {
        "reviews": [
            {
                "review_header": "After receiving this Flash Drive that I was satisfied with it", 
                "review_text": "After receiving this Flash Drive that I was satisfied with it. What a great product at a great price. It’s look lightweight and simple, was reliable, and fast. I was able to write 2 GB of data in a little under 2 minutes, and copy that data on another computer in less than a minute. I have not tested the water proof and shock proof durability. Why would I want to try to damage the drive? I can’t tell you this will work fine for you. But it’s worked out brilliantly for me. I took this flash drive with me everywhere I go. If you want a fast, high capacity portable device, I would recommend it!!!", 
                "review_comment_count": "", 
                "review_posted_date": "14 Aug 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Michael Tata"
            }, 
            {
                "review_header": "Good drive for the money", 
                "review_text": "When purchasing flash drives I try to read the reviews and understand what I'm getting into. Unfortunately, this one had no reviews, but was such a good deal, I decided to purchase it anyway. I have read about fake usb flash devices being sold (mainly on ebay but also on amazon), so I was a bit wary. Happily, this device is as advertised: I ran a full f3 test (this is the linux equivalent to h2testw) to determine the true capacity - it really is 64 GB and operates at USB 2.0 speeds (ubuntu disk utility benchmark reports average read rate of 35.8 MB/s and write rate of 3.0 MB/s). Pros: - good price (approx $1 per GB) - full 64 GB of storage in very small package - trusted SanDisk name - validates as true 64GB USB 2.0 device - small metal rod on back for connecting to key chain - BoBoTech shipped quickly Cons: - USB 2 is a bit slow (but USB3 devices are WAY more expensive) - plastic shell seems a bit flimsy (this hasn't been a problem on my smaller 16GB Cruzer) - 1/8\" wider on each side from the connector - very tight fit next to power connector on my laptop Overall, I would recommend this drive if you are looking for a large capacity thumb drive and can live with USB 2 transfer speeds.", 
                "review_comment_count": "19", 
                "review_posted_date": "04 Dec 2011", 
                "review_rating": "4.0 ", 
                "review_author": " Derek Kingston"
            }, 
            {
                "review_header": "SanDisk Cruzer 64GB VS Transcend 64 GB", 
                "review_text": "I am a SanDisk fan. I have always used there products and have been happy with the speed and reliability that they offered. Recently I upgraded from the SanDisk Cruzer 16GB to the 32GB. Right away I noticed it was taking longer to move files. Also from time to time it would just stop during transfer. I left it on all night thinking it would finish and it never did. I Decommissioned that one and bought another a few months later locally this time. I figured I must have gotten a hold of a bad one. The new 32GB Cruzer did the same thing. I just worked around the issues and continued using it. I figured the 32gb model must be flawed in some way. Still being a fan of SanDisk Cruzers I just recently upgraded to the 64GB model. So far it hasn't stopped during transfer but it still seemed to be taking to long. I decided to try a little test. I Purchased a Transcend 64GB thumb drive. I made a folder on my desktop and put 70 files of varying sizes equaling 4.03GB. I copied the folder to my SanDisk and timed it then I did the same with the Transcend. Here are the results: SanDisk Cruzer 64GB USB Flash Drive SDCZ36-064G-B35 transferring 70 files equaling 4.03GB it took 18.34 minutes Transcend 64 GB JetFlash 500 Retractable USB Flash Drive - TS64GJF500E transferring the same took 13.43 minutes I can't speak for the long term reliability of the Transcend thumb because this is the first I've owned. What I do know is that it has a good solid feel, it's cheaper then the SanDisk of the same size, and it's considerably faster. I'm going to continue testing this drive and if it works out and I grow to trust it I will post again and let everyone know. For now I'm going to lean toward Transcend. ** Update as of 01/30/2013 ** I continued using both the Sandisk 64 and the Transcend 64 daily at work. The Sandisk is still significantly slower and occasionally stops responding during transfer. Unfortunately there is no safe way to remove it because technically it's still in use and will not respond to safe ejection procedures both in Windows and Linux. I just do a system shutdown hopping the OS will safely close the open files. I then remove it, restart the machine and try again. This may sound a bit extreme but I do it for a reason. One time it stopped responding on a 3 gig transfer so I let it sit for an hour. When I came back it was still unresponsive so I removed it and took it to another machine I was updating. When I inserted it the new machine I was asked if I wanted to format the Sandisk. I lost everything. Fortunately I had the same data on the transcend so it was just an inconvenience. If however I had been relying solely on the SanDisk it would have been a very long night. The Transcend 64 still continues to surprise me with it's reliability and speed. It is used at work in the daily grind and shows no signs of instability or speed loss. Seven month tested daily, head to head- Transcend 64 GB JetFlash 500 Retractable USB Flash Drive TS64GJF500E VS SanDisk Cruzer 64GB USB Flash Drive SDCZ36-064G-B35. And!... It's Transcend for the Win! Sorry SanDisk, this was a complete miss match. With all your resources, funding, and experience You should have stomped transcend into the ground. You need to get your staff into one room and discuss who dropped the ball and what your going to do about it. Your pro's, this should never have happened and because it did you've introduced doubt into the minds of consumers you had won over years ago. This leaves me wondering was it a shameful loss for SanDisk or is there a new player in the game. In my opinion Transcend just stepped out of the background and into the foreground. They will be given serious consideration during my purchases in the future.", 
                "review_comment_count": "67", 
                "review_posted_date": "15 Jun 2012", 
                "review_rating": "2.0 ", 
                "review_author": " Douglas Doon"
            }, 
            {
                "review_header": "Large, quality jump drive perfect for storing pictures!", 
                "review_text": "I am in the process of moving my pictures off of CD’s and onto jump drives and am looking for high quality, high storage devices. SanDisk is a trusted brand, so I was excited to find such a deal on this 32GB disk. I found the disk to perform as expected. It hold loads of pictures, creating an easy way for me to organize my photos from the last few years. I did notice the more photos I added to the disk, the slower it got, not a pace that was inconvenient, just one that took a little more time to get loaded up with photos. In terms of the design of the disk itself, the sleek black look is nice. It has a small metal bar on the back that could be used to attach to a key chain or something similar. The red button is fairly easy to push open and close, but not so easy that it will accidentally open when in a bag or purse. Once the drive is extended, it is easily inserted into a computer without the drive pushing back into the case (a problem I have had with other disks). Overall, I am very happy with my purchase and would recommend it to anyone looking for a drive to save photos or other things on. I will purchase another when this one is all full.", 
                "review_comment_count": "", 
                "review_posted_date": "22 Mar 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Sabrina"
            }
        ], 
        "ratings": {
            "2 star": "2%", 
            "1 star": "5%", 
            "4 star": "14%", 
            "3 star": "4%", 
            "5 star": "75%"
        }, 
        "price": "$6.99", 
        "url": "http://www.amazon.com/dp/B007JR5368", 
        "name": "SanDisk Cruzer CZ36 16GB USB 2.0 Flash Drive, Frustration-Free Packaging- SDCZ36-016G-AFFP"
    }, 
    {
        "reviews": [
            {
                "review_header": "Easy to store photos on", 
                "review_text": "Plugged it in and it loaded fast and without any problems. I have purchased several PNY USB drives and I have never had any problems with any of them so far. I needed another USB for backing up my photos. You can get a lot of photos on here and it is small and doesn't take up a lot of space that an external drive would. I definitely recommend PNY products.", 
                "review_comment_count": "", 
                "review_posted_date": "01 Jul 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Love To Shop!"
            }, 
            {
                "review_header": "Solid, reliabily built.", 
                "review_text": "I use more flash drives than anyone I know. I have them for storing all sorts of things. Some are specific items, some are back ups, and some are for share or porting information. Since I use so many I have learned the hard way which are reliable and which are junk. PNY is one of the only two I trust over and over again. They never fall apart or break, unlike many that have fallen apart and can't be read. PNY also never gets stuck in the drive and falls apart trying to get them out. They are very solidly made and hold up well. I still have one of the first PNY flash drives I purchased. (and I won't tell you how many years ago, because that would give away my age) They are solidly made with a cap that never gets loose or falls off. They go into the USB drive easily and are removed with the same ease. I enjoy all the sizes of storage and use the higher ones for large storage like backups and music. I use other sizes for files I want to store but don't need them currently taking up room on my computer. I use others for work on computers that I do not want to leave any information or files on, I insert the USB flash drive, run a program - save it to the same flash drive and detach. Nothing left behind. Others I use for sharing and swapping. I often share family pictures with others so I will give them the drive, they use or download the family pictures and sometimes send other pictures they have back to me. So you can see I use a lot of drives. I have a few spare for other things that pop up but must have 75-100 at least. Since my data is critical to me and I don't need to lose what is on my flash drive, I trust PNY to always be there. It has been at least 10 years since I have lost any data so that says something for the quality of their items.", 
                "review_comment_count": "", 
                "review_posted_date": "20 Sep 2016", 
                "review_rating": "5.0 ", 
                "review_author": " M. Markward"
            }, 
            {
                "review_header": "Iffy Drive within a Couple of Weeks - Error Messages", 
                "review_text": "Scary!!! I was using this for class, and between home and the computers in the lab at the school, the drive would either work immediately, work and then \"pop\" out, or state it was damaged. I do not care for its design. It has a slide close that is loose, and I believe that it pushes it out of the USB hubs. This is especially the case on a Mac desktop. I luckily, had noticed every time it jumped out and was able to save work. Just now, on my PC, I had to jiggle it to show on my files. For me, going into computer science, and having to save long programs, I had to order another drive right away in case something happened. I went with the other highly rater SanDisk, which is great and shows up right away on my computer. I'll use the PNY as back up. I only had four class meetings too! If I had kept the packaging, I would definitely be filing for a return; I just never imagined that I would need it with as many stars as it has.", 
                "review_comment_count": "1", 
                "review_posted_date": "20 May 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Arp716"
            }, 
            {
                "review_header": "It's a big, relatively slow flash drive. It ...", 
                "review_text": "It's a big, relatively slow flash drive. It works well and I filled it to capacity and read back to make sure it is legit. My only minor issue with it is that it detects slowly. Most flash drives (even my 64GB PNY Attache) detect right away and are usable within a 5 seconds of being plugged in. This one takes about 10 seconds, then windows shows a dialog about installing it, and 20-30 seconds after it is plugged in you can use it. Not a huge deal, but it means that my 64GB is still my 'daily driver' with the 128GB being used for large files that are not used frequently. Also, one old computer with USB 1.1 didn't detect it at all, but did work with the 64GB Attache...but that's probably just a limitation of that ancient computer.", 
                "review_comment_count": "", 
                "review_posted_date": "07 Mar 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Z. Kummer"
            }, 
            {
                "review_header": "Despite generally good reviews, the product I received was junk and ...", 
                "review_text": "This review concerns the 16GB model. BEWARE! Despite generally good reviews, the product I received was junk and I returned it. I don't know if it was a bad batch or lack of quality control. I ordered two of the 16GB models. I'm an IT consultant and I buy a LOT of inexpensive (< $10) 16 - 32GB flash drives to use for client backups and for making Recovery Drives on new Windows installs. I buy drives made by Lexar, PNY and Kingston all the time. I'm not expecting a high-end product, since these are budget prices, but I expect the drive to at least work reliably. There was something very wrong with these two drives I received. Right off the bat, they took up to a minute to be recognized by Windows - not just the first time, which is understandable, but EVERYTIME. This indicates to me that that Windows is having trouble querying the drive, which means that the drive's firmware is defective, or it's slow to respond due to inferior quality or defective NAND memory chips or controller logic. On top of that, when I benchmarked these drives using HDTach they ran at a miserable 12 MB/s on the quick read test. Cheap, budget 16GB flash drives I've bought many times previously can usually reach at least 20 MB/s, again indicating inferior quality. For $5.99 I nearly just threw them in the trash, assuming I'd have to pay shipping, but ultimately I decided to apply for a return and refund. I was happy to find out that the return process on Amazon is simple (despite buying from Amazon for years, I've never had to return anything before) AND they pay for return shipping (you can print a pre-paid UPS label).", 
                "review_comment_count": "5", 
                "review_posted_date": "03 Dec 2014", 
                "review_rating": "1.0 ", 
                "review_author": " Robert Osorio"
            }, 
            {
                "review_header": "Get this!", 
                "review_text": "Works very well. I'm using it to store photos, not videos, but it isn't slow. You can add a string for easy storage. I got the 32GB. Strongly recommend!", 
                "review_comment_count": "", 
                "review_posted_date": "26 Jun 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Caitlin"
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "10%", 
            "4 star": "15%", 
            "3 star": "5%", 
            "5 star": "67%"
        }, 
        "price": "$11.99", 
        "url": "http://www.amazon.com/dp/B003YCOMG4", 
        "name": "PNY Attache USB 2.0 Flash Drive, 32GB/ BLACK (P-FD32GATT03-GE)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Perfect combination of form & function", 
                "review_text": "I needed a USB drive on my keychain. I bought 6 different ones (some purchased at Amazon and some at Staples). This one is my favorite. The metal casing feels strong yet light. And it fits easily on any keychain. It's about 80% the size of a standard house key (see my photo that I added). Also, it's very good looking. Looks great on the keychain; looks great when inserted into any computer. The drive read/write speeds are a little on the slow side but reasonable. I timed some file transfers on my computer (Dell Optiplex 380): * For read speeds, I averaged 16.1 MB/s (ranged from 10 MB/s to 18 MB/s). * For write speeds, I averaged 6.8 MB/s (ranged from 4 MB/s to 11 MB/s). In general, larger files took longer to transfer than smaller files (single 300 MB file took longer to move than one hundred 3 MB files). Other users with the same device have reported an average of 17-18 MB/s read speeds and 11-12 MB/s write speeds. These are considered to be AVERAGE speeds for usb flash drives. If speed is of the essence, then look for a high speed drive that can read/write 30 MB/s or faster. If you're mostly transferring documents, photos, and other small files, then these speeds should suffice. Another small complaint. I do not feel a 'click' when the drive is inserted fully. So I just push until it won't go in anymore or when I see that the computer has recognized the drive. A minor annoyance in an otherwise great USB drive. I highly recommend this drive. While the speed on this device is not top notch, its performance is reliable and it comes in a great little package.", 
                "review_comment_count": "23", 
                "review_posted_date": "13 Mar 2012", 
                "review_rating": "5.0 ", 
                "review_author": " Julian Nam"
            }, 
            {
                "review_header": "Great concept, mechanical tolerances need improvement", 
                "review_text": "I've owned this about a month and is seems to work fine with light use. Pros - Small. 39mm x 12.2mm x 4.5mm There are some flash drives that are a bit thinner at about 2.5mm, but you loose the advantage of having protected contacts. - Tough all metal case. It could survive a lot more abuse than competing flash drives that are plastic. I have no concerns with leaving it on a keychain that gets tossed around. - large strong metal loop for keychain or lanyard, inner diameter 8.4mm - Decent speed, but not blazing fast: Large file writes 8MB/s, reads 17MB/s - Cost was very competitive compared to all other 16GB drives, and less than others in this small size class. - 5 year warranty Cons - open end is susceptible to dust or lint accumulation, it may need to be blown out periodically with compressed air. This is the tradeoff versus having a cap that may get lost. - Does not fit into some machines. The mechanical tolerances are such that it will not plug into some machines without using so much force that you risk damaging the port on the computer. I've never experienced this problem with any other USB drive I've owned, and I have at least 10 different models including others from Kingston. There isn't any excuse for this and it's the reason I took off two stars - I can't use it in all \"Universal\" Serial Bus ports. Possibly with more insertion/removal cycles it will loosen up, but it should work fine right out of the box. Bottom Line - if it fits the computers you need to use it with and high speed isn't a concern, it's a great little flash drive at a good price. But, if you need a drive that must work in any random computer you encounter such as at the library, this may not be the best choice.", 
                "review_comment_count": "18", 
                "review_posted_date": "17 Aug 2012", 
                "review_rating": "3.0 ", 
                "review_author": " ZEric"
            }, 
            {
                "review_header": "Could be faster, but really impressive product", 
                "review_text": "UPDATE: I've had the DataTraveler on my keychain (that is not handled gently, by any means) for over 6 months now and it is still good as new. I keep some important business files on it, and though it's not impressively fast it's been a lifesaver at multiple meetings when I need to grab or transfer files with clients. UPDATE 2- April 1st, 2014: I've had the DataTraveler on my keychain for over two years now.... it still works perfectly and there are absolutely no issues. I am incredibly rough with my keys (which I keep attached to my wallet and throw around constantly) and still, it keeps working. The 'average' write speeds have never been an issue for me. STURDINESS: I thought when I ordered the Kingston DataTraveler SE9 -simply judging by the images- that it was a plastic casing, but was pleasantly surprised that it's a durable aluminum casing. SPEED: As you can see in the video a speed test shows that the WRITE SPEED tests just under 15MB/second and the READ SPEED tests just under 20MB/second, there is nothing impressive about this speed. Regardless of the average speed- the incredibly appealing price, sturdiness and convenience of the product (the design creates a nice built-in key-ring) makes this an impressive product and I would definitely recommend it to friends! A review from C. Blake Davis", 
                "review_comment_count": "18", 
                "review_posted_date": "20 May 2012", 
                "review_rating": "4.0 ", 
                "review_author": " Blake Davis"
            }, 
            {
                "review_header": "Great looks -- but one severe problem", 
                "review_text": "I've purchased two of these - a 16GB and a 32GB version. Both looked great and performed great. One the first one - after about three months - I went to insert it to find the actual memory chip had fallen out of the metal casing. I had important data on there and it was gone forever (and some of it was sensitive). I changed things on my PC to ensure security and restored my data that I had from a backup onto another USB drive. Bought another one (this time a 32GB), and within a few months, the same thing happened. This time I snapped a picture. I cannot believe this passed quality testing. Do they just glue these chips into the case? That's pretty lame and insecure. If you buy one of these, buy some kind of cap so you don't lose the ship inside (along with your data). The speed was good and the looks were great. The actual build quality - highly lame. Sigh. Never again - have changed to a metal USB drive with a security cap t prevent something like this from happening again.", 
                "review_comment_count": "7", 
                "review_posted_date": "07 Jun 2013", 
                "review_rating": "2.0 ", 
                "review_author": " Brian W."
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "4%", 
            "4 star": "13%", 
            "3 star": "4%", 
            "5 star": "76%"
        }, 
        "price": "$9.47", 
        "url": "http://www.amazon.com/dp/B006W8U2WU", 
        "name": "Kingston Digital DataTraveler SE9 16GB USB 2.0 DTSE9H/16GBZ"
    }, 
    {
        "reviews": [
            {
                "review_header": "Perfect combination of form & function", 
                "review_text": "I needed a USB drive on my keychain. I bought 6 different ones (some purchased at Amazon and some at Staples). This one is my favorite. The metal casing feels strong yet light. And it fits easily on any keychain. It's about 80% the size of a standard house key (see my photo that I added). Also, it's very good looking. Looks great on the keychain; looks great when inserted into any computer. The drive read/write speeds are a little on the slow side but reasonable. I timed some file transfers on my computer (Dell Optiplex 380): * For read speeds, I averaged 16.1 MB/s (ranged from 10 MB/s to 18 MB/s). * For write speeds, I averaged 6.8 MB/s (ranged from 4 MB/s to 11 MB/s). In general, larger files took longer to transfer than smaller files (single 300 MB file took longer to move than one hundred 3 MB files). Other users with the same device have reported an average of 17-18 MB/s read speeds and 11-12 MB/s write speeds. These are considered to be AVERAGE speeds for usb flash drives. If speed is of the essence, then look for a high speed drive that can read/write 30 MB/s or faster. If you're mostly transferring documents, photos, and other small files, then these speeds should suffice. Another small complaint. I do not feel a 'click' when the drive is inserted fully. So I just push until it won't go in anymore or when I see that the computer has recognized the drive. A minor annoyance in an otherwise great USB drive. I highly recommend this drive. While the speed on this device is not top notch, its performance is reliable and it comes in a great little package.", 
                "review_comment_count": "23", 
                "review_posted_date": "13 Mar 2012", 
                "review_rating": "5.0 ", 
                "review_author": " Julian Nam"
            }, 
            {
                "review_header": "Great concept, mechanical tolerances need improvement", 
                "review_text": "I've owned this about a month and is seems to work fine with light use. Pros - Small. 39mm x 12.2mm x 4.5mm There are some flash drives that are a bit thinner at about 2.5mm, but you loose the advantage of having protected contacts. - Tough all metal case. It could survive a lot more abuse than competing flash drives that are plastic. I have no concerns with leaving it on a keychain that gets tossed around. - large strong metal loop for keychain or lanyard, inner diameter 8.4mm - Decent speed, but not blazing fast: Large file writes 8MB/s, reads 17MB/s - Cost was very competitive compared to all other 16GB drives, and less than others in this small size class. - 5 year warranty Cons - open end is susceptible to dust or lint accumulation, it may need to be blown out periodically with compressed air. This is the tradeoff versus having a cap that may get lost. - Does not fit into some machines. The mechanical tolerances are such that it will not plug into some machines without using so much force that you risk damaging the port on the computer. I've never experienced this problem with any other USB drive I've owned, and I have at least 10 different models including others from Kingston. There isn't any excuse for this and it's the reason I took off two stars - I can't use it in all \"Universal\" Serial Bus ports. Possibly with more insertion/removal cycles it will loosen up, but it should work fine right out of the box. Bottom Line - if it fits the computers you need to use it with and high speed isn't a concern, it's a great little flash drive at a good price. But, if you need a drive that must work in any random computer you encounter such as at the library, this may not be the best choice.", 
                "review_comment_count": "18", 
                "review_posted_date": "17 Aug 2012", 
                "review_rating": "3.0 ", 
                "review_author": " ZEric"
            }, 
            {
                "review_header": "Could be faster, but really impressive product", 
                "review_text": "UPDATE: I've had the DataTraveler on my keychain (that is not handled gently, by any means) for over 6 months now and it is still good as new. I keep some important business files on it, and though it's not impressively fast it's been a lifesaver at multiple meetings when I need to grab or transfer files with clients. UPDATE 2- April 1st, 2014: I've had the DataTraveler on my keychain for over two years now.... it still works perfectly and there are absolutely no issues. I am incredibly rough with my keys (which I keep attached to my wallet and throw around constantly) and still, it keeps working. The 'average' write speeds have never been an issue for me. STURDINESS: I thought when I ordered the Kingston DataTraveler SE9 -simply judging by the images- that it was a plastic casing, but was pleasantly surprised that it's a durable aluminum casing. SPEED: As you can see in the video a speed test shows that the WRITE SPEED tests just under 15MB/second and the READ SPEED tests just under 20MB/second, there is nothing impressive about this speed. Regardless of the average speed- the incredibly appealing price, sturdiness and convenience of the product (the design creates a nice built-in key-ring) makes this an impressive product and I would definitely recommend it to friends! A review from C. Blake Davis", 
                "review_comment_count": "18", 
                "review_posted_date": "20 May 2012", 
                "review_rating": "4.0 ", 
                "review_author": " Blake Davis"
            }, 
            {
                "review_header": "Great looks -- but one severe problem", 
                "review_text": "I've purchased two of these - a 16GB and a 32GB version. Both looked great and performed great. One the first one - after about three months - I went to insert it to find the actual memory chip had fallen out of the metal casing. I had important data on there and it was gone forever (and some of it was sensitive). I changed things on my PC to ensure security and restored my data that I had from a backup onto another USB drive. Bought another one (this time a 32GB), and within a few months, the same thing happened. This time I snapped a picture. I cannot believe this passed quality testing. Do they just glue these chips into the case? That's pretty lame and insecure. If you buy one of these, buy some kind of cap so you don't lose the ship inside (along with your data). The speed was good and the looks were great. The actual build quality - highly lame. Sigh. Never again - have changed to a metal USB drive with a security cap t prevent something like this from happening again.", 
                "review_comment_count": "7", 
                "review_posted_date": "07 Jun 2013", 
                "review_rating": "2.0 ", 
                "review_author": " Brian W."
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "4%", 
            "4 star": "13%", 
            "3 star": "4%", 
            "5 star": "76%"
        }, 
        "price": "$9.47", 
        "url": "http://www.amazon.com/dp/B006W8U2WU", 
        "name": "Kingston Digital DataTraveler SE9 16GB USB 2.0 DTSE9H/16GBZ"
    }
]