[
    {
        "reviews": [
            {
                "review_header": "I really like the imuto charger", 
                "review_text": "I really like the imuto charger, I did a lot of research and was torn between this, the anker and ravpower of similar capacities. I chose this model because of the Qualcomm 2.0 and 3.0, and the price was 30 dollars cheaper than anker battery with that capacity. The charger has an lcd readout which is a feature all of the portable chargers should have. It is a little big and is a little heavy for my liking, the pros far out way the cons imo. Plain and simple if your on the fence about this purchase, proceed to checkout.", 
                "review_comment_count": "", 
                "review_posted_date": "06 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Thomas R. D'ercole"
            }, 
            {
                "review_header": "Glad I chose this one...", 
                "review_text": "Great looking, well made product. Expected to have to charge it before first use. LED indicated was at 100% right out of the box. Speaks well of the batteries' ability to hold a charge. Modern look, matte color, and pleasing texture make this product easy to like quickly.", 
                "review_comment_count": "", 
                "review_posted_date": "09 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " L Woods"
            }, 
            {
                "review_header": "Great product but big and heavy", 
                "review_text": "Today I received my imoto quick charger. Although I have not had an opportunity to take it on a business trip yet I thought I would leave a preliminary review. To begin, I'm impressed with this charger's capacity and charging ability. It arrived with 100% charge which I thought was nice considering many products require a full charge before they can be used. The charger also comes a short 2 foot micro USB charging cord but no plug-in outlet. You will need to provide your own plug or use the one that came with your phone. My only complaint is not the fault of the product or manufacture as the dimensions we're given on Amazon's website. However, I was still a bit surprised how absolutely huge and heavy this product is. While it would be great on a long road trip with the family it may be a bit too bulky and heavy to carry around through airports on Long business trips. If you are a frequent air Traveler and want this product to charge your phone on an airplane just keep in mind that it is larger then my LG V10 phone by about a half inch and about four or five times as heavy. Lastly, whoever wrote the instructions and product description used very poor English vocabulary. I'm sure this product was manufactured in China or there abouts which explains the poor vocabulary, but what the heck. If you are a manufacturer trying to make a product that will be sold to professionals you should at least be professional when writing about it. Just some free advice.", 
                "review_comment_count": "", 
                "review_posted_date": "15 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Br"
            }, 
            {
                "review_header": "Love it", 
                "review_text": "It's a real godsend. Quick charging. A bit heavy, though.", 
                "review_comment_count": "", 
                "review_posted_date": "06 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Judy Glover"
            }, 
            {
                "review_header": "Best batterie PAC I've ever had because of the quickcharge and the fluorescent readout.", 
                "review_text": "This is a wonderful battery pack when I first got it I thought it had no charging lights so I was disappointed but only until I plugged it in and a fluorescent display lit up from the actual pack itself you will see it in the photos. Then I got another surprise this batterie pact will actually quick charge my galaxy Samsung S6!! None of my other batterie packs will do that!! I'm so happy I may have to get one are two more. This will put out a variable output from five volts to 12 volts. I don't know what takes 12 volts but maybe some apples tablet or something. It automatically reads what the device needs and adjusts accordingly. I really am happy with this batterie PAC I even tried to do a video for it but for some reason it would not work so the photos will have to do. I cannot stress enough how nice this batterie pack is 20,000 milliamps is enough to charge my phone five times from dead your phone may vary depending on the size of the batterie PAC but you will not be unhappy with this one. I have a Samsung galaxy TAB s 2 and it charged it fully three times and still had power left unbelievable. It has two USB plugs one is regular charge, and the one that is green is your quickcharge. Thank you again for good batterie PAC", 
                "review_comment_count": "", 
                "review_posted_date": "01 Dec 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Thomas west"
            }, 
            {
                "review_header": "Works as advertised. Feels Well built. The only ...", 
                "review_text": "Works as advertised. Feels Well built. The only reason for the 4 stars is the size it is big. Make sure to check the size and see if it will fit your needs. You have to have a big pocket to put it in your pants.", 
                "review_comment_count": "", 
                "review_posted_date": "12 Feb 2017", 
                "review_rating": "4.0 ", 
                "review_author": " raven"
            }, 
            {
                "review_header": "Love this thing soo much have been with power and ...", 
                "review_text": "Love this thing soo much have been with power and suffer no more from drained devices... I suggest you include a multi charge wire with your purchase...", 
                "review_comment_count": "", 
                "review_posted_date": "17 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Ramon Rivera"
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "I am so glad I did my research, this thing is awesome. Charges faster than my wall charger. I hardly even use my wall plug nowadays, I feel like I have the freedom to carry my phone around without having to be stuck on a walk when I'm low of battery. It's really not even heavy, I guess heavier than my phone but it's nice and sturdy.", 
                "review_comment_count": "", 
                "review_posted_date": "19 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Lori"
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "4 star": "9%", 
            "5 star": "88%"
        }, 
        "price": "$39.99", 
        "url": "http://www.amazon.com/dp/B01MSHO3NB", 
        "name": "iMuto Portable Charger SL200QC 20000mAh, Quick Charge 3.0 Nintendo Switch Portable Power Bank External Battery"
    }, 
    {
        "reviews": [
            {
                "review_header": "Okay for the price but Anker batteries are better", 
                "review_text": "My review is based on the comparison with Anker batteries since those are the ones I have been using for a long time and have had no issues with them. I was going to buy another Anker and then saw good reviews and an attractive price tag on this one. Gave it a try but returned in a couple of weeks. I had 2 problems with it. 1.) They are bigger and heavier than Anker batteries for the same capacity 2.) They charge slower than Anker's Other than that, this is an Okay battery and probably one of the best in it's class of charge capacity for the price tag.", 
                "review_comment_count": "", 
                "review_posted_date": "12 Jul 2016", 
                "review_rating": "3.0 ", 
                "review_author": " Varun Bansal"
            }, 
            {
                "review_header": "Great buy", 
                "review_text": "Holds a crazy charge. I've charged by phone (Samsung S5) from 0% to 98% and the battery only lost about 20% of life. Fantastic for anyone who can't stand by a wall outlet for very long (travelers, outdoor enthusiasts, etc). Any questions you have please feel free to ask.", 
                "review_comment_count": "", 
                "review_posted_date": "27 Jan 2016", 
                "review_rating": "5.0 ", 
                "review_author": " ryan"
            }, 
            {
                "review_header": "ASTOUNDING portable battery for a low price!", 
                "review_text": "This is a POWERHOUSE for portable batteries! It is 15000 mAh and works perfectly! It is able to charge your phone many times, and charges from dead to full in about ten hours! It is amazing for road trips or in cases when your power goes out. There is also a light that signifies the battery percentage. It is able to charge my iPhone 5S fast, and can charge it about 9 times! I recently visited San Jose in California and it kept my phone on for the whole time! What I think is astonishing is the price. This right now is only 15 dollars! I found a 5000 mAh portable charger that is more money than this! I suggest you buy this now before the price goes up. It would be a great time because summer is approaching. Overall, I think this product is astounding. It has a low price and many other features. I hope you have a good shopping experience, and if this helped you, please press the \"Yes\" button below.", 
                "review_comment_count": "", 
                "review_posted_date": "26 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Landen Peralta"
            }, 
            {
                "review_header": "It's shaped nicely and fits comfortably in a tactical bag (or purse", 
                "review_text": "This is my \"go-to\" source of power when I'm on the road and need to recharge my devices. This device is reliable and stores an INSANE amount of juice. I've been away on vacations for a week and used it to recharge my entire family's cell phones, tablets, bluetooth headphones, etc. multiple times. Even after all that, I typically return home with a 25% charge on the unit! It has never let me down. The trade off for having such a \"deep bucket\" of power is that it does take quite a while to \"fill that bucket.\" When it's eventually time to charge it, plan on plugging it in and leaving it for a LONG, LONG time. We're not talking a couple hours here. We're not talking overnight either. Depending on how discharged it is, you may be looking at a full day (or maybe even two)! The first couple times I worried that it wasn't charging at all. But it did...eventually. It isn't the lightest battery pack out there, but it certainly isn't the heaviest either. It's shaped nicely and fits comfortably in a tactical bag (or purse...as tested by my wife and daughter, who both have and use these as well). So...do you need this thing? Is it worth it? Is it the right thing to get? For me, yes on all counts. There's nothing like being out on a job site, seeing my cell phone battery about to die due to heavy use in the morning, and being able to completely recharge it while still using it for the rest of the day. REPEATEDLY. Using something that's easy to carry with you and that doesn't need constant recharging itself.", 
                "review_comment_count": "", 
                "review_posted_date": "09 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Joe"
            }, 
            {
                "review_header": "It'll charge my smart phone (with its 1800 mAh batt) multiple times", 
                "review_text": "This thing is a tank! It'll charge my smart phone (with its 1800 mAh batt) multiple times, and charges it at least as quickly as a wall charger does. With its two output ports, I can charge a friend's phone at the same time; I make lots of new friends that way. I do a lot of dry camping and my job involves being in places without electrical service for more than 24 hours at a time, and with this I no longer have to worry at all about running out of power for my phone. I also bought a 12W solar charger to recharge this battery pack, so I can literally be off the grid indefinitely, as long as the sun shines for most of the day. The only downsides are: 1) size and weight...it's a bit heavy, and too large to slip it in your pants pocket like a wallet, but that's unavoidable given the huge capacity; 2) it does take a while to fully recharge (10 hours or so), again because of its high capacity; and 3) the two output ports are not labeled on the device to show which is the 1A and which is the 2A, so you have to look at the item's description online and remember which is which. Still, this is the best 17 bucks I ever spent on a phone accessory, and definitely deserves five stars.", 
                "review_comment_count": "", 
                "review_posted_date": "02 Jun 2016", 
                "review_rating": "5.0 ", 
                "review_author": " David Colorado Sellon"
            }, 
            {
                "review_header": "Overall I'm very pleased with the performance of this battery", 
                "review_text": "I bought this product along with KMASHI Weatherproof External Battery Bag Dual Zippers Pouch Universal Travel Case for Samsung Galaxy S5 S4 iPhone 6 Plus 6S 5 5S, Power Bank, Hard Drive, GPS, Digital Camera to protect it. My first impressions on this battery were mixed as after the first full charge it seemed to die extremely quick for the capacity and I was a little worried of the quality. Sure enough, I let it go through one more full charge and everything was fixed. After fully charging this battery I was astounded with how long it actually lasts, I can charge my iPhone 6 5-6 times while still using it before this battery dies. I'm sure if the phone was left alone to charge it would be able to charge it a few more times. The capacity coupled with the 2A port means I'm able to get a fast charge on the go without worrying if it'll die on me. The one somewhat downside to this is that it is a little thicker of a battery so keep that in mind. It just about fits in your pocket but I would advise keeping it in a backpack or something of that nature for comfortability. Overall I'm very pleased with the performance of this battery", 
                "review_comment_count": "", 
                "review_posted_date": "21 Sep 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Patrick Shortall"
            }
        ], 
        "ratings": {
            "2 star": "5%", 
            "1 star": "11%", 
            "4 star": "15%", 
            "3 star": "7%", 
            "5 star": "62%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B00JP8MZGK", 
        "name": "KMASHI 15000mAh Portable Power Bank with Dual USB 3.1A Output and 2A Input"
    }, 
    {
        "reviews": [
            {
                "review_header": "So far, so good", 
                "review_text": "So far so good, power bank seems to work as advertised. I've opened it up and found inside four unlabeled 18650 cells connected in parallel with room for a fifth. I assume that each cell is 2500 mAh so they add up to the advertised 10,000 mAh. I plan to perform a load test on this power bank to verify this in the near future.", 
                "review_comment_count": "5", 
                "review_posted_date": "13 Apr 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Dennis Chertkovsk"
            }, 
            {
                "review_header": "reliable unit in many conditions", 
                "review_text": "Working great so far. At 10,000mAh I've never had trouble getting it onto an airplane (I've read experiences of people with 20,000 mAh units being taken away at security). It's a pretty useful capacity because it can charge a phone several times over. Anecdotally, seems to hold its charge well when not used for long durations. And it has continued working for me several times in the -15 C Quebec winter. The indicators on these devices are never very clear, but this one does pretty well, and that's largely because it has no buttons (other than the flashlight button): - No lights = No power - As soon as you plug something in, 1-4 solid lights means the device is charging and the number of lights corresponds with how much battery remains - When you charge it, 0-4 lights remain solid, indicating current battery, while the remaining lights flash, showing that it's now charging now up to that level.", 
                "review_comment_count": "", 
                "review_posted_date": "04 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Ja"
            }, 
            {
                "review_header": "Better than expected for price", 
                "review_text": "Here is the lowdown. I bought this when it had just 1 review. The problem with that particular review is that it seems to be from someone from the seller or the manufacturer, considering a bulk of his reviews are of Kmashi products and all rated 5 stars. So I took a leap of faith as the price was very reasonable, and I could always return it to Amazon. This is a keeper. I am not sure about the mAH rating, since I have no way to actually test it. I suspect it may be exaggerated. However I will tell you what my findings as an user are, and you can judge for yourself if this fit your needs. The battery pack has a little heft to it. That is expected considering the size of the battery. Very well built, it feels solid and belies the price I actually paid. Quality feel. It can slip into your jeans pocket, but will make it's presence felt. --- Getting this juiced up. It takes over 14 hours with a 5V 1amp power source. It takes a little over 7 hours with a 5V 2.1amp power source. This does not come with power adapter. It only has a USB to Micro USB cable. --- Charging devices Charging iPhone 5. Once the battery pack was fully charged, I could get 5 full charges with some juice to spare. I got the charge to 100% from the following phone battery charge state. Twice from 20% Twice from 15% Once from 10% Since these charges happened over a week without having to recharge the battery pack, it tells me that this product can be used with confidence, during travel. Charging the iPad 2 This was a bit of a let down. But probably technically ok. I could only get partial charges from a full charge of the battery pack. Once from empty to 86% Once from 15% to 93% So a full charge of the battery pack will not charge the ipad to 100%, if the ipad charge is below 20% or so. But my iPad is over 2 years old and the battery may not be as efficient. My tests above should give you a fair idea as to what to expect in real world usage. I do not have other devices to test out.But based on the findings above, you could do some math and find out how this would serve your device based on your particular devices battery capacity. I had to knock off one star because of two issues : 1) This will not charge any device while the pack itself is getting recharged. There are other battery packs which do that. However it was not a deal breaker for my needs, but would have been nice. 2) The charger needs a little kick in the pants, to charge upto 100%. For some reason my iPhone would stop getting charged at around 96%. I had to press the power button on the device once again to get the charge to 100%. It may be a particular quirk with my device.", 
                "review_comment_count": "", 
                "review_posted_date": "11 Sep 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Daz Bam"
            }, 
            {
                "review_header": "I have only had it a couple of weeks but have recommended it to others because of the price", 
                "review_text": "Bought several for gifts and one for myself. I used mine once. It may or may not be 10,000 mAh. I do not have a tester that small. I do know that it charged up the wife's note 2 from 12% to 98% in a couple of hours. I did notice as in reviews of this and others it takes awhile to fully charge but that is basic physics. Also noted that when we rubber banded the phone and battery pack together. She put it inside her coat pocket and in about a half hour we noticed that the battery pack was warm, not hot to the touch. Removed it from the pocket and with in minutes it was back to normal temp. This was only while charging up her phone. It is very simple to use. I have only had it a couple of weeks but have recommended it to others because of the price, and prompt delivery, and ease of use. Size seems right for a pocket or purse, the grand kids use back packs and their pockets. The exterior seems to wipe off nicely.", 
                "review_comment_count": "", 
                "review_posted_date": "26 Dec 2015", 
                "review_rating": "4.0 ", 
                "review_author": " Insiviable Grann"
            }, 
            {
                "review_header": "Used it for hours of playing Pokemon Go", 
                "review_text": "I originally bought this so I could play Pokemon Go with my brothers. If you have ever played this mobile game, you would know that it drains your battery SO quick. This external battery extended my phone battery life by hours, it's great. We would be outside all afternoon without any way of recharging our phones, so this really saved us! I don't play Pokemon anymore, but this battery still gets used fairly regularly. I like to go on bike rides and walks as well as camping, and when you have to go but your phone is at low battery, I grab this thing out the door and it easily charges my phone for me. Sometimes I get nervous if my phone is on low battery and I need my phone to be charged enough to use Google Maps when I'm out, so I am definitely glad I have this charger. The charger is true to what it advertises, it will do a full charge twice from empty. The size and weight is great for carrying around; it's small enough to where you could fit it in your pocket if you would like. The flashlight on it has been pretty useful, especially for finding things in my glovebox or for camping, which are places where I usually need to use the charger anyway. My husband and I can both charge our phones at once on it because it has two slots to plug in which has been so useful! I would recommend to anyone.", 
                "review_comment_count": "", 
                "review_posted_date": "01 Sep 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Jasmine Adsit"
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "7%", 
            "4 star": "18%", 
            "3 star": "5%", 
            "5 star": "67%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B00VWV8LD4", 
        "name": "Aibocn Power Bank 10,000mAh External Battery Charger with Flashlight for Apple Phone iPad Samsung Galaxy Smartphones Tablet"
    }, 
    {
        "reviews": [
            {
                "review_header": "Charge all the things at all the speeds!", 
                "review_text": "This battery is near perfect. It can charge up to 3 devices up to 2.4 amps per port (5.8 amps max) and can recharge at 2.4 amps (though when I was charging, I only was able to reach 2.0 amps with a 50% charge, see attached pic). It has lithium polymer batteries vs the normal lithium ion batteries you see in all other chargers out there. Its capacity is 20000mAh which means it can hold a good amount of chargers for all your devices. It also has Ravpower's iSmart 2.0 technology which identifies whats the safest maximum rate (amps) your device can charge at. I've been having issues with another brand that wont fully charge my iphones and leaves them at 95% charge, this charger chargers those iphones just fine (including my gopro, samsung tablet and 3DS all at ONE TIME). It is a bit heavy (pushing 1 pound), but with the charging capacity this thing can do, thats expected. Overall, I love this charger. It would be nice if it had an LED flashlight function (possibly use the same button that checks the percentage left on the battery?), but thats just me being picky. Its good to see they included a case along with 2 different sized micro usb cables. I plan on taking this on our next vacation trip. Im pretty sure it would last the entire week. If theres one thing I would suggest, it would be a wall outlet charger that charges at 2.4 amps. Anything slower would insanely slow to charge this thing, especially when its completely drained. at 50% charge (how the charger arrived), it took nearly 5 hours to charge using my 2.4 amp wall outlet charger.", 
                "review_comment_count": "3", 
                "review_posted_date": "21 Jun 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Ton"
            }, 
            {
                "review_header": "Pure Power", 
                "review_text": "Love this battery pack. You get what you pay for. After purchasing a few lackluster unreliable aftermarket power packs at my local departmrnt store, I gave in, read some reviews, and went for guaranteed muscle and power. This pack takes a few hrs to charge (faster with the separately purchased 2.4A USB charger), but it quickly and completely rejuices my Droid Turbo, at least 4-5 times. I used my phone for photography at Burning Man this year, and needed a portable rechargable power source. I was able to charge this up off a Goal Zero Yeti that I had hooked to a solar panel, and then carry it around in my backpack for when I needed it. It did fine in the desert heat...and cold. It is made in China...booo, but I couldn't find a domestic manufacturer with good reviews. It is heavier than other smaller batteries, probably well over a pound, but compact (see pic). If one wants a 22,000mAh battery, they are deluding themselves if they think it will be the size and weight of a Chapstick tube. Ha. If one wants a functional, reliable, portable source of power for their laptop or phone, with high speed output, look no further. I use this at work as well to keep my electronics juiced up as I use them frequently. After much trial and error, I realize that this is what I was looking for all along.", 
                "review_comment_count": "", 
                "review_posted_date": "07 Oct 2016", 
                "review_rating": "5.0 ", 
                "review_author": " silvergirl"
            }, 
            {
                "review_header": "Probably the best out there", 
                "review_text": "This is the highest capacity power bank I've ever purchased. It does everything you'd expect and it lasts far longer than I anticipated before requiring a recharge. I've charged it from solar panels, various wall chargers and they all charge it, albeit at different speeds based on power output from the charging source. On a sunny day with a solar panel outputting 5v/2A, you can charge this full and have enough time to about half-charge a second. The kinds of devices I've charged or powered successfully: * iPhone 6s Plus * Lumia 950XL * Microsoft Band * 5v to 9v/12v converters - to which I powered a 9v fan * Sony MP-CL1 projector * Microsoft Display Dock (for Lumia 950/950XL) * Lumsing USB-C to HDMI & USB-A adapter In terms of simultaneous power draw, I'm not sure it lives up to its total max output of 5.8A / 2.4A per port. It gets close, but not 5.8A close. I had a Lumia 950XL via Lumsing USB-C adapter (2.4A) + Sony MP-CL1 (1A) and it worked, but adding a third device was too much, even if it was a 1A device. That would have totaled 4.4A, leaving 1.4A headroom. I would have expected the circuitry on the RAVPower to throttle the output to one or more of the ports so they would all operate simultaneously up to 5.8A out. Unfortunately that's not the case here. The power bank simply turns off power output entirely. I've used a Samsung 5.3v/2A charger and measured it with a DROK usb meter - the battery will take all the juice you throw at it, so it's pulling around 11 watts during peak charge draw time. I've yet to test it with a more powerful source. The packaging was great, it felt like an experience to open it. I love the supplied bag, and the two flat USB-A to USB-Micro cables (one is about 1 foot and the other is about 6 inches) were an added bonus. Don't forget to register he power bank with RAVPower so you get a lifetime warranty. Knowing the battery will eventually require replacement, this is an added bonus. None of the other power banks I've purchased in the past offer this kind of warranty.", 
                "review_comment_count": "", 
                "review_posted_date": "01 Oct 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Travis M."
            }, 
            {
                "review_header": "Everything you could want in a portable charger", 
                "review_text": "This charger is now one of our prized possessions. It holds a truly ridiculous amount of power, so if you're going to be going on long trips with no access to outlets this thing is a must. I kept it with me during my vacation and charged my phone along with two of my friends' phones while out one night. My husband has it with him currently while training with the military, and it kept him in music and games while on a 12-hour bus ride with plenty of charge to spare. It is a tad bit on the heavy side and is a bit too heavy for me to just slip in a hoodie pocket while charging, but I would rather carry this charger around every day to school or work than to have a smaller charger that will quit on me halfway through a long plane ride. Also, I picked this charger up for about $40, less than half the original cost according to Amazon. Simply an amazing deal, cannot recommend this charger more!", 
                "review_comment_count": "", 
                "review_posted_date": "16 Aug 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }
        ], 
        "ratings": {
            "2 star": "2%", 
            "1 star": "6%", 
            "4 star": "11%", 
            "3 star": "3%", 
            "5 star": "78%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01G1XH46M", 
        "name": "Battery Pack RAVPower Portable Charger 22000mAh 5.8A Output 3-Port Power Bank (2.4A Input, Triple iSmart 2.0 USB Ports, Li-polymer Battery) Portable Battery Charger For Smartphones Tablets - Black"
    }, 
    {
        "reviews": [
            {
                "review_header": "LOVE!!!", 
                "review_text": "I love this! This is a very attractive looking charging unit. It charges my Samsung Galaxy phone FAST. I can get several charges out of this for my phone. I also charge my Amazon Fire 7 with it. I don't know how I lived without this before now. This keeps me going and I don't have to go around searching for outlets or limit my usage to conserve power. So far I have no complaints or \"cons\" with the use of this. Finally this is STURDY and can take a fall... I'm very clumsy and occasionally drop this!", 
                "review_comment_count": "", 
                "review_posted_date": "23 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Deborah K. Dobbins"
            }, 
            {
                "review_header": "Great Price, Great Design, Great Prduct., Deffinately a \"GOTTA HAVE\"", 
                "review_text": "A solid 5 STAR on this one. Great design, love the built in LED light. Have a Samsung 7 edge, had about a 50% charge on it. Plugged into the DULLA M50000 Portable Power Bank 12000mAh. Took only about 25 min to fully charge theS7. Still had all 4 LEDs lit on the charger. FANTASTIC !!!!", 
                "review_comment_count": "", 
                "review_posted_date": "07 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " John Kingham"
            }, 
            {
                "review_header": "What a wonderful charger! The quality is top notch and it ...", 
                "review_text": "What a wonderful charger! The quality is top notch and it serves its purpose very well. It has a nice little light near the dual charging ports and the ability to turn it off is nice. Everyone should buy this!", 
                "review_comment_count": "", 
                "review_posted_date": "05 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "", 
                "review_comment_count": "", 
                "review_posted_date": "03 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Mila"
            }, 
            {
                "review_header": "WORKS LIKE MAGIC!", 
                "review_text": "Works really great! People can be way too picky but to each their own. I like how this pack carries alot of power to it, and it can charge two phones at once! It basically takes my phone from <5% to 100% and still have 3/4 lights (power left) on. I have yet to power two devices at once but it charges pretty fast with one device. Yeah it takes a while to fully charge the pack, but i mean if you think about how much juice you're storing it makes sense. Especially for this price! Cant beat it, i bought another portable charger a while back for $15 and it barely raised my battery for about 60-75% if im lucky. Really enjoy this one though!", 
                "review_comment_count": "", 
                "review_posted_date": "29 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Richard M."
            }, 
            {
                "review_header": "Good product but should have checked the size (too big to put in a pocket)", 
                "review_text": "Well you asked for a five start review, he we go with a 4 star review. Pros: The bank is slim and looks sharp. Charges my phone relatively fast Has a flash light good enough to walk upstairs at night or to find a key-hole in the dark Cons: Dimensions! It is almost the size of a 7\" tablet and kind of heavy for 12 Ah The size and weight deduct one star because this battery bank is so much bigger than my other 4 banks (half the capacity but way less than half the size) https://www.amazon.com/dp/B01DHTV0PE/ref=cm_cr_ryp_prd_ttl_sol_0", 
                "review_comment_count": "", 
                "review_posted_date": "12 Mar 2017", 
                "review_rating": "4.0 ", 
                "review_author": " BobSunnyvale"
            }, 
            {
                "review_header": "So very satisfied", 
                "review_text": "I purchased this in preparation for a cruise I'm going on in May. I got to test it out over the course of 6 days while attending various events for WrestleMania 33 in Orlando. I followed the directions as stated and made sure it charged for a full 24 hours prior to using. And let me tell you this baby Works! It charged my phone quickly especially when I placed it in airplane mode and even after fully charging my phone back to 100% from 20% it still had 3 pwr bars left. It charged mine and my daughter's phone simultaneously with the same results. Heck I'd consider getting another one just so my daughter could have her own. Best purchase made. I'll never be without my phone again at a special event.", 
                "review_comment_count": "", 
                "review_posted_date": "04 Apr 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Shannon R."
            }, 
            {
                "review_header": "Great price and good performance!", 
                "review_text": "Fantastic deal! I have yet to test the actually capacity but it has to be close 12k mAh. It's roughly the size of 2 S7 edge phones stacked on top on each other. Which means you can toss it in your backpack but probably not your pocket. It's tapered on the sides like and edge phone as well so it looks sleek. Charging performance is about what you would expect from a cheaper battery bank. Don't expect to charge your phone in 45 minutes like the quick charge wall adapters though. It has a button to check state of charge or to turn on the small LED light. My only complaint is the placement of the lights. They are obstructed by the charge cord while charging. Otherwise it's a nice unit.", 
                "review_comment_count": "", 
                "review_posted_date": "13 Apr 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Rasalghoul"
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "10%", 
            "4 star": "16%", 
            "3 star": "5%", 
            "5 star": "66%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01DHTV0Q8", 
        "name": "DULLA M50000 Portable Power Bank 12000mAh External Battery Charger, Ultra Slim Design with 2 USB Ports for iPhone7 Plus 6s 6 Plus, iPad, Samsung Galaxy and More(gold)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Lots of power", 
                "review_text": "It is a great product for charging necessary apple products like cell phones, Ipads, and more. It packs a lot of power. Make sure to use a 5 volt 2amp USB charger to charge it up. When I'm working outside, I can plug my phone into the battery anywhere and stream music all day without dropping the charge on my phone. The cons it's a little big and kind of heavy. But that's required for the amount of power it packs.", 
                "review_comment_count": "", 
                "review_posted_date": "20 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Todd"
            }, 
            {
                "review_header": "Charges pretty fast.", 
                "review_text": "Arrived on time and looks very sleek. The handy blue light tells you how much power is left, and it charges pretty fast.", 
                "review_comment_count": "", 
                "review_posted_date": "07 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " David"
            }, 
            {
                "review_header": "Highly recommended!", 
                "review_text": "It's very well built, looks very good quality. The packaging and original box were in perfect condition. It also arrived on time. It can charge my iphone6S almost 6 times. It's a bit bigger than I thought but it fits well into my pocket. The price is amazing, lasts a good 6/7 hours for my phone and constant use. I was quite pleased with this purchase.", 
                "review_comment_count": "", 
                "review_posted_date": "13 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Sandeep"
            }, 
            {
                "review_header": "Overall this is an excellent value. It’s cheap, light weight, and so far reliable.", 
                "review_text": "* It weighs lighter than an iPhone 5 and is just a little bit bigger than the iPhone 7 Plus * It could fit in my pockets but it’s a little too large to carry around comfortably * However, it takes up very little space in a laptop bag or back pack * I’ve charged my iPhone 7 Plus at least 5 times already from around 25-30% to full battery without having to recharge this battery pack * Overall this is an excellent value. It’s cheap, light weight, and so far reliable. Why spend nearly $100 on those battery packs they sell at the Apple Store. It’s kind of ridiculous. * For more information, or if you’re interested in buying this, I’ve included the link in the description of this video.", 
                "review_comment_count": "", 
                "review_posted_date": "04 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Louie Tran"
            }, 
            {
                "review_header": "Amazing power bank", 
                "review_text": "This power bank is amazing. I have used it to charge my IPad and my Samsung Galaxy phone. The best part is that it's low maintenance in the sense that you barely ever have to charge it. It comes with a weird looking USB cable that actually charges my Android phone, but make sure you carry your own Apple USB cables. I only charged it one time and used it a dozen times, the power bank still holds some charge.", 
                "review_comment_count": "", 
                "review_posted_date": "17 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Elizabeth"
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "Great item! Very useful when you need extra battery life for your devices!", 
                "review_comment_count": "", 
                "review_posted_date": "06 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Monica"
            }, 
            {
                "review_header": "It is ok product", 
                "review_text": "My Nexus 6 drains the power pretty quick so I need a power bank to ensure I can have it charged whenever needed during the day. This power bank can give my Nexus 6 two full charges (from 15% to 100%) in about two hrs(single charge) with 2A port. It can give one full charge from 2-3% to 100% about 3 hours and then charge from 3% to 30% with the remaining power. I did not use the 1A port so I don't know how long it takes to charge with that port. The power bank is thin but a little wider than I expected. It is well made. I like the flat short USB cable comes with the package, but somehow it does not work well with my phone. I use another one from my other device to have the problem resolved.", 
                "review_comment_count": "", 
                "review_posted_date": "22 Dec 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Xuejun Lin"
            }, 
            {
                "review_header": "I really love the ultra slim design of this 20", 
                "review_text": "I really love the ultra slim design of this 20,000mAH power bank by ToHLo. It measures approximately 4\" x 6\" x 0.39\" and weighs just 7.3oz. It has 2 USB ports allowing you to charge 2 devices at the same time and has 4 indicator lights and a power button. It takes about 6 hrs to fully charge and it came fully charged so it was ready to use right out of the box. It's just slightly thicker than my iPhone 6S and just 1 1/4\" wider. I only wish it was less wider so that it could fit in my jeans front pocket, but it does fit in the back pocket. It's black on one side and green on the other. The black side can attract smudges. It also smelled like a brand new pair of shoes. I do like to pack light so this is perfect for my travels.", 
                "review_comment_count": "", 
                "review_posted_date": "14 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Lily & Ken"
            }
        ], 
        "ratings": {
            "2 star": "6%", 
            "1 star": "10%", 
            "4 star": "12%", 
            "3 star": "6%", 
            "5 star": "66%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01LXWIHIO", 
        "name": "ToHLo Portable Charger Power Bank 20000mAh, Ultra Slim Dual USB Ports Portable External Power Bank Charger for iPhone 7 6 Plus Samsung Galaxy S7 S6 S5 Sony HTC and most Smartphones Tablets (Black)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Very useful, especially while traveling. Only supplies ~14000mAh but that's not unreasonable for this kind of product", 
                "review_text": "As an engineer I test every battery I own so, naturally, I couldn't wait to put this one through its paces. It has some positive qualities but they're completely overwhelmed by the lousy capacity. First the good: * Using both micro-USB inputs (provided each is coming from a capable supply) really does charge this battery quickly. Two 10W chargers brought it to full in under 8 hours. * Each output will deliver over 2A, even simultaneously. Understandably the battery gets warm when you do that. * It makes a great charging distribution center. My family, with four phones, three iPads, ereaders, headphones and various other devices, took it on vacation and instead of having to hunt for wall outlets (leaving things plugged into random places in the hotel room) we used a good 10W charger to power this and, overnight, it charged everything else. In the morning our gadgets would be full, this would be around 50% and while we were out it would come back to 100%, ready for the next night's work. A multi-headed charge cable makes it even better. * It's heavy but that's in the \"good\" column because it's not as heavy as I was expecting. I had it in my backpack for a while and didn't notice the extra weight. Of course that's probably because of the severe downside... And that downside is: * Delivered capacity is only about 70% of the 20000mAh stated. I've charged this battery to full and run it down completely with a good power meter and got consistent results of 13739mAh, 13703mAh, 13828mAh. Originally I gave it two stars but see the update for more detail. UPDATE As others have pointed out the 20000mAh rating is the raw capacity of the 3.7V cells. Some level of efficiency loss is guaranteed (thanks physics!) but reporting the capacity at 3.7V for a device that delivers 5V seems shady, at best. Unfortunately it seems to be the industry trend so I don't think it's fair to penalize EasyAcc - I've added two stars for that and the fact that I find myself using this battery, especially on vacations. Recently in Disney World, for example I had this and a rats nest of wires in a small backpack and I was able to keep all four phones charged until the park closed, despite the battery-hungry games we played while waiting in lines. Even with snacks, a sweatshirt, random souvenirs and a spare phone in the bag (because one of us has a habit of taking a phone swimming) I hardly noticed the weight.", 
                "review_comment_count": "13", 
                "review_posted_date": "18 May 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Jason S"
            }, 
            {
                "review_header": "Finally, one that lives up to its claim.", 
                "review_text": "I'll start with the meat. My trials tested this and ran at an average of 13,709 mAh, which sounds low, but it's actually right on the mark to meet the claim of 20,000 mAh. Here's how. That's 13,709 mAh that I got out of the pack at 5v, not how much went into charging it, so this is real usable capacity. We can work backwards to find what's in the pack. (I rounded to whole numbers in the below figures, and these figures were obtained using a 1 A load) 13709mAh * 5v = 68545 mW 68545mW / 3.7v = 18525 mAh at 3.7v 18525 / 0.90 = 20,584 mAh actual battery pack capacity at 3.7v after factoring in 10% loss for the regulator I tested this with both real devices and variable load modules. My phone, PS Vita, and an old MP3 player seemed to top out at draining from this thing at about 1 A. I'm guessing that must have been a limitation of the devices that I attached to the power bank because I also tried the variable load module, and was able to pull 2.8 A off it for some time, which is above the 2.4 A stated limit. I did this for about 5 minutes and noticed the device did get warm, but not dangerously so. I conducted the rest of my tests by setting the variable load to 1 A and 2 A. It seemed to hold up slightly better at 1 A than 2 A, as expected. It was cool while at the lower drain rate and I seemed to get about 2000 mA more out of the pack at 1 A than at 2 A. Not earth shattering, but something to keep in mind. The pack itself is relatively heavy, which is good for something like this. Light means it's light on lithium, and a 20,000 mAh pack shouldn't be. The LED lamp on it is a bonus and functions well enough to get around a dark room, and will stay on for a very long time if that's all you're using the pack for. I left it on for 5 hours, and it didn't go down 1 notch (out of 5) during that time. The dual inputs for faster charging is actually an asset here. I had it hooked up to two 2.4 A ports on a USB charger, and it actually charged in not quite half the time. 6 hours compared to 10. Still, a welcome improvement with a large pack like this. If there are concerns about charging this too fast and reducing cell life, I wouldn't worry about that. There must be at least 8 cells in this, which would put the per-cell capacity at around 2500 mAh. A 1C (2.5 A here) charge rate would be a quick charge and 0.5C (1.25 A here) would be a standard charge. Having both inputs active at full capacity would yield a max charge input of 4 A, spread over 8 cells is about 0.5 A, or about 0.20 C, so it's not a dangerous or damaging charge rate. Overall, I would say that this was a good buy. I purchased two of them, and I'm adding it to my \"save for later\" list in case I need a third. EDIT: March 5, 2017 After performing a teardown of the device, I found that my math was right. Inside are 8x 2600 mAh 3.7v cells, for a total of 20,800 mAh. Looks like we get what we're paying for. That being said, at a purchase price of $30, that's less than $4 per cell if you want to scrap this and use the cells for projects. Good value either way!", 
                "review_comment_count": "", 
                "review_posted_date": "27 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Michael J. Santoro"
            }
        ], 
        "ratings": {
            "2 star": "2%", 
            "1 star": "4%", 
            "4 star": "12%", 
            "3 star": "3%", 
            "5 star": "79%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01422TC14", 
        "name": "EasyAcc 20000mAh Power Bank (4A Dual-Input Fastest Charge 4.8A Smart Output) External Battery Pack Charger Portable Charger for Android iPhone Samsung HTC - Black and Orange"
    }, 
    {
        "reviews": [
            {
                "review_header": "Stop stressing about a low cell/tablet battery in important situations like the airport!!!!", 
                "review_text": "This appears to be the one! I travel quite a bit and haven't printed a boarding pass in quite a while... As the practice of e-boarding passes continues to increase, so will the instances of anxiety due to a low battery while waiting in the security line or at the gate! A powerpack/portable charger is the perfect solution, and this appears to be a great charger! How I do know? Good question. I recently purchased and reviewed the Lumsing Ultrathin Portable 3-Port USB Charger 10000mAh... This thing was great except is made a high pitch noise when it charged another device. I liked it so much I returned the first and purchased a second only to have the second one do the exact same thing. The Anker Charger? ZERO NOISE! I love it!!!!! Pros: Small, about the size of a deck of cards. See my image comparing it to a Samsung S5. Charges very quickly, just as fast as the 2 A wall chargers. Cons: I actually prefer the taller/thinner form of the Lumsing which keeps the device ports easily accessible when in the inside pockets of my sports coat. The Anker only has one charging port, but ask yourself, how often are you really going to need to simultaneously charge multiple devices? For less than 20 bucks, I'm probably going to just buy a second one of these... In summary, I really like this portable charger and will use it often... In fact, I'm probably going to purchase a second one. If this review was helpful, please click the 'helpful' button!", 
                "review_comment_count": "1", 
                "review_posted_date": "02 Jun 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Expert non-expert"
            }, 
            {
                "review_header": "Small, very portable, quick charging, and works great.", 
                "review_text": "I've used Anker chargers for many years now, and currently have three different ones in my household. Considering how much capacity this charger has, it's incredible how small it is. It works great overall, no issues noted with it so far. I included photos of the three chargers I currently own. On the left is the older 10,000mAh charger, right is the newer 20,000mAh charger, this charger in the middle. This charger is much smaller in length and slightly smaller in width, but slightly thicker. It has the same profile as the 10,000mAh charger but significantly shorter. I used this exclusively to charge my phone (LG G4, 3000mAh battery) for a few days to see the performance of the charger. I used it to charge my phone both without use and with use. The first charge was without use. It charged my phone from 5% battery up to 100% battery over the course of only 1 hour and 18 minutes, surprisingly fast (1.2% per min). The next charge I did was during typical use, bringing it from 14% to 90% in 1 hour and 13 minutes (1.05% per min), not too far off of the charging rate without use. The last charge was mainly while using the phone as a GPS in my car. That brought the phone from 6% up to 94% over the course of 1 hour 57 minutes (0.75% per min) before the charger was finished. All things said, the charger worked amazingly well, much faster than the previous iteration of the 10,000mAh charger and much better than I expected. I used the charging cable that was included with the charger for this test, but have been using my own cables since then as I have much shorter cables that I prefer for some cases and much longer cables for others. Also the 18 month warranty is another feature that keeps me purchasing Anker products. I have had an issue with an older charger with a built in cable, and while the charger was no longer available for sale Anker sent me a voucher for the full value of my charger, which I was able to use to purchase the older 10,000mAh charger you see in the photos. Every other charger I have owned by them has had zero issues over years of use.", 
                "review_comment_count": "4", 
                "review_posted_date": "17 Feb 2016", 
                "review_rating": "5.0 ", 
                "review_author": " D. Ave"
            }, 
            {
                "review_header": "Finally found a portable charger that doesn't break!", 
                "review_text": "I have a Nexus 5, which are known to have short battery life. So I need to charge my phone usually twice a day. I’ve purchased 4 portable chargers in the past couple of years. Two of them completely failed in the first two months. The one before this did a better job, but it was large and ugly. I decided I wasn’t going to buy the cheapest one this time. This one is matte black and streamlined. It’s 3 ½” long X 2 ½” wide X ¾” thick with rounded corners. The one I had before this was also 10,000 mAh but it was an inch bigger on each side so it was impossible to put in your pocket. It’s extremely simple to use. There’s a power button which brings the four blue LEDs to life. That gives an idea of remaining power. There’s a single USB output and a Micro USB input for recharging it. It comes with the a 22” cord. It does a full charge 3 times before it needs to be recharged. Today I started charging at 10 am and it was at 18%, it completed charging at 11:35 am. The company stands behind it too. If you have an issue or a question they respond with a solution quickly. It’s definitely worth the price. I would recommend this if looks, quality and warranty are the important factors to you.", 
                "review_comment_count": "", 
                "review_posted_date": "26 Apr 2016", 
                "review_rating": "5.0 ", 
                "review_author": " AmazonCustomer"
            }, 
            {
                "review_header": "Worked on the Appalachian Trail", 
                "review_text": "Just took this baby with me on a 9-day backpack on the Appalachian Trail. Stayed in airplane mode most of the time but frequently checked a gps-driven app (Guthook) that shows location on AT. Very satisfied with recharging capability and much smaller size and weight than in the past, Recommend.", 
                "review_comment_count": "1", 
                "review_posted_date": "02 May 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Ladies this is a must!!", 
                "review_text": "Great product, have no idea how I lived without it! I have an older iPhone and the apps I use ( couponing, Pinterest, art and crafts apps) suck my battery dry. I keep this in my purse and never worry about a dead battery before I am finished running my errands or complete my flights at the airport. Also works great with my iPad. This is a fast charger also. Sometimes when I need to fast recharge it is my go to instead of a wall charge. Bought two because I travel so much and always have a bag packed with my must haves on hand. To sum it up...one of my best finds and purchases, have no idea why everyone does not own one!!", 
                "review_comment_count": "", 
                "review_posted_date": "29 Dec 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Just2peach"
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "3%", 
            "4 star": "9%", 
            "3 star": "1%", 
            "5 star": "86%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B0194WDVHI", 
        "name": "Anker PowerCore 10000, One of the Smallest and Lightest 10000mAh External Batteries, Ultra-Compact, High-speed Charging Technology Power Bank for iPhone, Samsung Galaxy and More"
    }, 
    {
        "reviews": [
            {
                "review_header": "It's great service.", 
                "review_text": "Bought two of these. Anker is pretty good quality. What we found with this model is that is DOES hold a large electricity supply, but it has very poor shelf life. That is, if I fully charge it, then keep it on my desk for a week or two without using it, it DISCHARGES completely. While in use, yes, it can power a phone or two quite well. But it is not reliable as a backup if it has been sitting around more that a few days. EDIT: Dec. 9, 2016: The seller noticed my poor review and felt that they wanted to help me out. They sent me another battery FREE, postage prepaid. It works perfectly-- good shelf life, not like the first two. When I told the seller, then they sent me ANOTHER one... free. So now I have two GOOD ones which do hold the shelf life, from a company who really cares about making the product right!", 
                "review_comment_count": "5", 
                "review_posted_date": "13 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Greg Golden"
            }, 
            {
                "review_header": "The perfect battery for your purse, pocket or backpack with an IQ port, a feature that you need!", 
                "review_text": "This battery pack is ideal for your purse, pocket or backpack and it is one of the most portable batteries that I have tested. It had good test results. This is an exceptional charger with a feature that everyone needs. The feature is PowerIQ charging technology for the charging port on this battery charger. That means that you can plug in any type of device and this smart port will set the charging current to match the maximum charging rate that your device can safely handle. The port is rated at 5 VDC and up to 2 Amps but in my testing I was able to charge and Apple iPad Air at 2.1 amps. Many people don't realize that device manufacturers play games by wiring their devices and cables differently so that a charger that is designed to charge an Android device will not quickly charge an Apple device. Manufacturers like Apple, Samsung, Android devices and Chinese smart devices have different circuitry in them and if the charger doesn't match their circuitry they can charge at a much slower rate. The IQ port doesn't care what type of device you plug into it because it adapts its charging rate to match what the device wants by sensing what type of device is plugged into it. I was so impressed that I put together a video of the unit and the test results for your review. The construction of this battery pack is simply beautiful. The exterior shell is glossy black. The battery weighs in at 4.23 ounces. The battery pack has one smart IQ output port that output 5 VDC at variable current to meet the charging requirements of the device you have plugged into it. It is called a Smart Port or an IQ port. It uses a chip to help select the proper current to allow the maximum safe charging current for the fastest device charging. The port can output as much as 2 amps but the battery pack in my testing output up to 2.1 Amps while charging an Apple iPad Air. This battery pack has enough power to charge an iPhone 5S 217%. To start your devices charging connect them with the proper cable. (You will probably have to use your own charging cable that came with your device) and charging starts after you press the on button on the side of the battery. The charging will stop automatically when your device is fully charged or the battery pack is depleted. The battery pack has 4 blue LEDs on it and when it is charging they work like this: * One LED blinking = less than 25% * One LED on and one blinking = 25 to 50% * Two LEDs on and one blinking = 50 to 75% * Three LEDs on and one blinking = 75 to 99% * Four LEDs on and the battery pack is fully charged The Lithium battery can be recharged over 500 times during its life cycle. It comes with an 18 month warranty. It is recommended to charge the battery at 1 Amp and 5 VDC. It will take 5 hours to charge the battery at that charging rate. You can use your USB 2.0 port of your computer it takes 10 hours at ½ Amp input. You can even use an AC powered USB wall charger or a USB car charger and using up to 2 amps will not hurt the battery. The battery pack does have a power on switch to turn on the charging cycle for your device or to allow you to check the battery's remaining power charge. . Items in the box: * The battery itself * An USB to Micro USB charging cable that is 27 inches long Anker 5200 mAh second generation battery pack test data: iPhone 5S unit one 74% - battery fully charged with 4 LEDs * 30 minutes 96% - battery 4 LEDs * 50 minutes 100% - battery 4 LEDs * 26% x 1560 mAh = 405.6 mAh iPhone 5S unit two 32% - battery 4 LEDs remaining * 30 minutes 63% - battery 3 LEDs * 60 minutes 91% - battery 3 LEDs * 90 minutes 100% - battery 3 LEDs * 68% x 1560 mAh = 1060.5mAh Samsung Galaxy Tab 4 at 54% - battery 3 LEDs remaining * 30 minutes 66% battery 2 LEDs * 60 minutes 77% battery 2 LEDs * 90 minutes 89% battery 1 LED * 120 minutes 97% battery dead * 43% x 4450 mAh = 1913.5 mAh Summary of all items charged: * 405.6 mAh + 1060.8 mAh + 1913.5 mAh = 3379.9 mAh / 5200 mAh = 65% efficiency * This is a good result and gives this battery a 5 star rating especially after charging a larger tablet in the testing. Device internal battery requirements: * iPhone 4 battery 1,420 mAh battery capacity * iPhone 4S battery 1,432 mAh battery capacity * iPhone 5 battery 1440 mAh battery capacity * iPhone 5S battery 1560 mAh battery capacity * iPad 2 battery 6,944 mAh battery capacity * iPad 3 battery 11,560 mAh battery capacity * Kindle Fire battery 4400 mAh capacity * Kindle Keyboard battery 1750 mAh capacity * iPad 4 battery is 11,486 mAh 3.7 VDC at 42.5 Wh * iPad Mini battery is 4490 mAh at 3.72 VDC 16.7 Wh * iPad Air battery is 8820 mAh capacity * iPad Air 2 battery is 7340 mAh capacity * Samsung Galaxy Tab 4 - 8 inch Tablet 4,450 mAh As you can see the Anker 5200 mAh will not fully charge a totally dead iPad 3 or 4 because it contains only 5200 mAh of capacity. That battery is ideal for recharging your smart phone or smaller smart tablet. You have to consider the losses in the charging circuits of both the battery pack and the device you are charging so this result is outstanding! When using an external battery you have to allow approximately 30 % of the battery capacity will be lost to heat, voltage conversion, powering the batteries electronics and the electronics of your electronics device's charging circuits. In addition you have to consider that your device is not truly off like a cell phone is still connected to the WIFI and phone networks and probably receiving emails, etc. This is one of the most powerful rechargeable battery packs I have tested. Real world examples of charging capability with this battery pack: * iPhone 4 approximately 238% of a full charge out of a fully charged Anker 20000 mAh battery pack * iPhone 5S approximately 217% of a full charge * iPad 2 approximately 49% of a full charge * iPad 3 or 4 approximately 29% of a full charge * iPad Mini approximately 75.3% of a full charge * Kindle Fire approximately 76.8% of a full charge * iPad Air approximately 38% of a full charge * iPad Air 2 approximately 46% pf a full charge * Samsung Tab 4 eight inch tablet approximately 76% of a full charge * A normal estimated usable storage is 70% of capacity or .70 * 5200 mAh = 3640 mAh charging capacity available for your electronic devices. * In my testing I was able to use approximately 3379.9 mAh of capacity or roughly 65% of the 5200 mAh capacity. This is a good result for a battery of this size. This was based upon the first full charge of the battery pack and the results should get better after the battery is charged several more times. I was supplied a sample for test and evaluation. A review was not promised to the supplier in exchange for the sample but I stated that if I provided a review that it would be fair and honest.", 
                "review_comment_count": "35", 
                "review_posted_date": "16 Dec 2014", 
                "review_rating": "5.0 ", 
                "review_author": " JJCEO"
            }, 
            {
                "review_header": "Amazing Product At An Amazing Price!", 
                "review_text": "No wonder this is the top rated portable power bank. I've had this thing for a few months now and wow am I impressed. The charge that this power bank holds is incredible given its size! I use an iPhone SE and I've gotten 2 full charges out of this with extra battery to spare! It's obvious that the folks at Anker really care about giving you a quality product at an unbeatable price. The prices of these things elsewhere are insane. Before purchasing this I looked at Walmart and the ones they had at this price looked horrible. The charge cord was very sturdy and the carrying bag fits the charger and cord perfectly. I also love that it has a battery level indicator. I carry this with my every single day. Would recommend for literally everyone. There's not a smartphone user on this earth that wouldn't benefit from having one of these.", 
                "review_comment_count": "1", 
                "review_posted_date": "04 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " slaton evans"
            }, 
            {
                "review_header": "Nickname this the Smooth E1", 
                "review_text": "Hi, This is my review of the Anker Astro E1 5200mAh External Battery. I have evaluated it for a few days to provide my personal review and user experience. For my test, I have used an iPhone 5s and iPad Air. First Impressions: This product arrived in a plastic cover wrap that protected the exterior boxing and cover which I appreciated. Upon first look, there’s the top side which shows the Astro E1 picture. The front side provides a customer service phone number and e-mail to contact Anker if product support or returns are needed. The backside has the serial number for the product. The bottom side has the IQ technology brief summary to learn more about it. In order to view the Welcome Guide, you have to tear to open the front side to reveal it on the opposite side of the cover. I didn’t personally like this idea because once you tear part of the cover up, it sort of dangles around in which makes it hard to put away. It would’ve been better to have the traditional method of including a small pocket sized Welcome Guide inside the box. Inside contains the following information: - 4 LED dots lit on the Astro E1 represent 100% charged capacity, 2 dots is 50% charged capacity, and 1 dot is 25% charged capacity. - Anker provides a 30 day money back policy and 18 month warranty, which is something that I’m happy about. Most competitive electronic companies these days offer 18 month warranty, so I am glad to see Anker provides that as well. That gives ample time to evaluate the Astro E1 through many recharging cycles to evaluate for defects. The cardboard construction of the box is sturdy and useful for shipment and travel purposes. First thing I notice when opening up the box is the Astro E1 in a plastic sleeve. The Astro E1, to my surprise, very small. Nearly smaller than any other External Battery that I have ever evaluated to this date in time. Putting that aside is another layer of cardboard enclosure which has a marketing material advertisement on the Power IQ technology. Power IQ technology allows devices plugged into the External Battery to have the fastest charge possible and will automatically adjust to different input current sources. Underneath that is the Micro USB cable to charge the Astro E1 that measures about 26 inches across, which is just above 2 feet. The Astro E1 is small. I measured with my measuring tape roughly 4 x 2 x 0.75 in based on rounding. This is great for portability and fitting into even a pocket in your pants. I have taken some pictures to compare this with a cellular flip phone, iPhone 5s, and my hand attached to this review. Upon first powering up the Astro E1, I found the charge capacity was at 3 LED lights, which is 75%. I didn’t want to charge it to 100% yet because a rule of thumb is to only charge the External Batteries when 25% or lower for greater lifespan. Usage: For my first test, I charged an iPhone 5s that was completely drained of its battery at near 0% to charge with the out of the box Astro E1. Using my lightning cable, I plugged it into the USB port on the Astro E1 labeled IQ and the other end to my iPhone 5s and tested. Once connected, without even pressing any other buttons, I saw the Astro E1 start to light up the 4 LED lights back and forth until finally settling on the 3 LED lights that indicates its current charge capacity. The following is observations based on using my Battery Doctor App in the iPhone 5s. Charge start time: 5:28pm, Astro E1 at 3 LEDs Checkpoint: 6:27pm, iPhone 5s charging at 59%, Astro E1 at 2 LEDs Checkpoint: 7:29pm, iPhone 5s charging at 99%, Astro E1 at 2 LEDs Checkpoint : 8:22pm, iPhone 5s charged 100%, Astro E1 at 2 LEDs Conclusion: Astro E1 charged iPhone 5s from 0% to 100% from out of the box at 3 LED indicators in about 2 hours and 54 minutes with room to spare for another full iPhone 5s charge. For my second test, I recharged my iPhone 5s for a second time around when it was at 22% battery life with the remaining charge in the Astro E1 from a few days ago. Charge start time: 10:11am, Astro E1 at 2 LEDs Checkpoint: 10:53am, iPhone 5s charged up to 65%, Astro E1 fully depleted with no LEDs displayed Conclusion #1: It took about 42 minutes to charge up 43% of my iPhone 5s on a quick charge using Battery Doctor App for iOS. Conclusion #2: With the Astro E1 at 3 LEDs to start, which indicate 75%, I was able to charge one and a half times my iPhone 5s before it fully depleted. For my third test, I evaluated how long it would take to charge a fully depleted Astro E1 to fully charged. Since the input is 1A, I found that my laptop, which is running throughout the day, would be sufficient to charge this device using one of the available USB 3.0 ports on my PC. Charge start time: 11:05am, Astro E1 at 1 LED blinking Checkpoint: 12:13pm, Astro E1 at 2nd LED blinking Checkpoint: 1:20pm, Astro E1 at 3rd LED blinking Checkpoint: 3:17pm, Astro E1 at 4th LED blinking Checkpoint: 7:04pm, Astro E1 turned off, fully charged Conclusion: Although I had to step out after 3:17pm away from the device while charging, I can estimate that it takes between 4-5 hours to fully charge the Astro E1. For my fourth and final test, I went ahead and checked to see how much of a boost that the Astro E1 gives when fully charged to increase battery life on my iPad Air tablet. The following are observations based on using my Battery Doctor App in the iPad Air tablet. Charge start time: iPad battery 17% at 7:05pm, Astro E1 4 LEDs Checkpoint: 8:11pm, iPad battery 48% charge, Astro E1 1 LED blinking Checkpoint: 8:26pm, iPad battery 51% charge, Astro E1 fully depleted Conclusion: iPad Air gets a 34% battery life increase from a fully charged Astro E1 in 1 hour and 21 minutes In Summary: Pros: 1) Small portable size with smooth finish to allow easy access for travel needs 2) Charges smartphones at least two full times 3) Power IQ Technology allows save charging for different specs of USB powered devices 4) Simple LED display to indicate a range in battery life remaining Cons: 1) 4 LED indicators may sometimes be inaccurate when fully depleted or gradually progressively charging towards full based on my tests Suggestions: 1) Use a digital display screen to indicate actual charge remaining before depleted or fully charged in the Astro E1 rather than use 4 LED dot indicators to specify 25% intervals of ranges 2) Use a small alarm sound built into the device to indicate when device is fully charged, fully depleted, or when device being charged with the Astro E1 has charged completely to 100% and can be removed or disconnected from the Astro E1. User Scenarios: 1) This product works great for people who go outside of the house and don’t want to carry anything excessive around as the Astro E1 can fit into your pocket of any type of pants or shorts fairly easily. 2) It works well to put away in the glove compartment of a car for emergency reasons. 3) This works will for those who are stationary at some table for a while for instance, those who are dining or eating out, to have this thing charge on the table your smartphone or tablet while you’re using it. Overall, I enjoyed evaluating this product. The small size and shape of the Astro E1 will fit in well in the long run for better accessibility and handling. I was provided a sample to evaluate to provide personal feedback of the user experience to help prospective buyers as well as product management teams to continue learning how to improve the product. Thanks for reading my review.", 
                "review_comment_count": "3", 
                "review_posted_date": "21 Dec 2014", 
                "review_rating": "5.0 ", 
                "review_author": " Michael Chu"
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "3%", 
            "4 star": "11%", 
            "3 star": "3%", 
            "5 star": "82%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B00P7N0320", 
        "name": "Anker Astro E1 5200mAh Candy bar-Sized Ultra Compact Portable Charger (External Battery Power Bank) with High-Speed Charging PowerIQ Technology (Black)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Anker PowerCore 20100 – Review by a Frequent Flyer Business Traveler", 
                "review_text": "Anker PowerCore 20100 – Review by a Frequent Flyer Business Traveler Most of us would agree that we all carry or own multiple devices in this day and age and they all need frequent (1x /2x/3x times a day) recharging after continuous usage. I personally travel a lot for work and I find myself needing battery juice for my devices on a very frequent basis. I carry 2 cell phones and 1 tablet for work. I obviously own couple of power banks to charge my phone during my flights or at the airports. I always thought it would be great if one these days they made a power bank which could charge all my devices few times and it wasn’t so heavy. Well, guess what Anker PowerCore 20100 is the answer. First and foremost, the capacity of this device is amazing and recharging of your devices is superfast. The unit itself comes pre-charged to about 75%came charged, so you can start using it out of the box. My test: After recharging it to full 100%, I took it with me on my business trip. I was able to charge my Samsung S6 and iPhone 6 at the same time (from 30% to FULL 100% in less than 2 hours). The Power Bank still had more than 50% juice left. I quickly plugged in my Samsung Tab S and charged it from 70% to Full 100% in less than 40 mins. I was surprised to see that the unit still had more than 50% juice left. Long story short, it took me full 2 days and almost 7-8 device recharges to drain it down to less than 25%. This unit has massive battery capacity. Since then I have ran multiple tests on this unit and it has NOT failed once to impress me. As far as size of the unit, I own old version of the Anker powerbanks and few other units from other manufacturers. This one is a great improvement. This is probably good 25% lighter than older Anker models and it’s not as shiny as older models. I like the looks of this one better. Anker smartly got rid of the flash light feature which was nothing but a small LED. I personally never used that feature in my older model. The four status LEDs are great and pretty accurate to show the status of battery charge left. Two USB ports allow charging, it’s rated at 2.4amp per port and total of 4.8amp. I think that’s pretty accurate during my testing. The unit comes with a single USB-to-micro cable and is charged via micro USB input on the side. It appears to be pretty well built unit that is both durable and attractive. For recharging the unit itself, it can take somewhere from 8-10 hours. Best is to leave it plugged in overnight and you will have an enormous power capacity for the busy day or even the week ahead. Anker customer service is the best I have seen, they are quick to respond and accommodating. The unit itself is backed by their 18 month warranty. Overall, I'm extremely satisfied with the battery pack and highly recommend it. It's a great battery backup for those on the go or even at home if you don’t want long recharging cords from power outlet to your desk. Bullet Point Analysis: ------------------------------------ Great For ------------------------------------  Business Travelers  Families on vacation  Busy Moms & Dads on the go  Considerate co-workers who want to help colleagues with their charging needs at office =)  College Students on long class schedules  International travelers ------------------------------------ The Pros ------------------------------------  Great form factor for the amount of battery power it packs  Power capacity to charge your phone throughout the week (6-7 times)  Accurate charging status and battery level LEDs  Automatic power off  PowerIQ feature to automatically route power to the device plugged in  Excellent value for cost ------------------------------------ The Cons ------------------------------------  None I can think of for what it promises.  May be charge my laptop too =) ------------------------------------ The Specs ------------------------------------  Dimensions: 6.5 X 2.5 X 1  Output: 2 USB/ 4.8A total  Input: 5V / 2A  About 1” bigger than Samsung S6 and 1.5” bigger than iPhone6  Substantially lighter than any other power bank with same capacity in the market.  Capacity is as promised  You can use your existing cell phone charger to charge the device ------------------------------------ Summary ------------------------------------ I think it’s established that in today’s digital and multi device environment our devices are power-hungry at all times. I have seen people at Airports, Hotels, Coffee Shops, Office Receptions, Disney World, Museums (yes), Casinos etc plugged into power outlets. Phones and tablets are more advanced but they need battery juice and manufacturers have conveniently taken spare battery option out of the devices e.g. Samsung. This Anker Power Bank makes perfect sense to carry for all your smart phone and tablet charging needs. You can't beat the battery capacity, size, weight, price for the use you will get out of it and to add its backed by a good company who listens to their customers. I would say go for it! Please do let me know if this review was helpful to you. If it was not, let me know why in the comment section. I promise that my review is fair and honest. ------------------------------------", 
                "review_comment_count": "24", 
                "review_posted_date": "21 Aug 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Gladius"
            }, 
            {
                "review_header": "Samsung Galaxy S7 Approved!!!", 
                "review_text": "After fully charging the Anker PowerCore 20100, I ended up running my own personal test to see just how many full charges I could get on my Samsung Galaxy S7. Everyday, for 5 days in a row, I would allow my phone to drain as much as possible as you can see below....then the next morning I would charge my phone using only the Anker Powerbank until it was fully charged. Here are the results! *Charge #1 = 15% to 100% power in 1 hour 35 mins. (4 solid lights) *Charge #2 = 20% to 100% power in 1 hour 30 mins. (3 solid lights) *Charge #3 = 08% to 100% power in 1 hour 45 mins. (2 solid lights) *Charge #4 = 03% to 100% power in 1 hour 50 mins. (1 solid light) *Charge #5 = 20% to 100% power in 1 hour 25 mins. (1 Blinking light) The next morning (on day 6), I tried recharging the phone again while the 1 remaining light on the Anker Power bank was still blinking ..... It basically went from 14% to 21% power before the Power bank ended up running completely dry. So all in all I was able to get \"5 Full Charges\" from this one Power Bank with my Samsung Galaxy S7. Hope this helps anyone who is undecided on pulling the trigger!", 
                "review_comment_count": "1", 
                "review_posted_date": "17 Oct 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Rick Dotson"
            }, 
            {
                "review_header": "originally received a dud, but Anker's customer support really went above and beyond in assisting me", 
                "review_text": "Bought this when it was released, given the specs being advertised. Unfortunately, it doesn't charge @ 2A or even close to it. It's not an issue with a cable -- I've tested several cables that all charge at around 1A - 2A on another Anker device, as seen in the attached pictures. I've reached out to Anker for assistance and received no help. I'll be sending this back. EDIT 04/2016: Anker reached out to me in private over a month ago, shipped me a new PowerCore free of charge and I confirmed that it was properly putting out over 1A. In addition to this, they replaced an older model PowerCore that had stopped working and I assumed was out of warranty, so I had taken it apart to diagnose what was wrong with it (bad capacitor). Not only did they ship me a replacement, but they let me keep the broken PowerCore so I could harvest the 18650 batteries from it. This is quality customer support and they probably ate a little bit of profit in assisting me. Not only am I raising this review to five stars, I will continue to consistently buy from Anker.", 
                "review_comment_count": "3", 
                "review_posted_date": "30 Jan 2016", 
                "review_rating": "5.0 ", 
                "review_author": " C. Olin"
            }, 
            {
                "review_header": "A college necessity", 
                "review_text": "I have grown to rely on this product more than I would have imaged. The charging rate is phenomenal and the capacity of this thing is INSANE. It chargers my iPhone 6+ in no time, at times I would rather charge it using this portable power charger instead of my normal charger just because of the speed! The battery will definitely last you a couple FULL charges of the phone. I use it to power mainly that as well as my JBL Flip 2 portable speaker as well as sharing this battery supply with my friends and family when they need it. The fact that this comes with two usb outputs is a true blessing in disguise, you never know when you need to rapidly charge two things at a time but it is definitely something to keep in mind. As for charging.. Make sure to use a rapid charging block or else it might take muuuucch longer than expected. I tend to connect it to my quick charge power block and leave it plugged in overnight. But it's a sacrifice that I am more than okay with living with since I only need to charge this thing maybe twice a month. As a college student this thing is a NECESSITY. No longer will I have to walk around scouring for a friend to let me borrow a charger when I leave mine at home, or never again will I need to wait in the airport for someone to finish using a power outlet. It gives me freedom. Oh and if you go camping EVERYONE is going to love you!", 
                "review_comment_count": "", 
                "review_posted_date": "14 Apr 2016", 
                "review_rating": "5.0 ", 
                "review_author": " I. Gonza"
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "3%", 
            "4 star": "10%", 
            "3 star": "2%", 
            "5 star": "84%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B00X5RV14Y", 
        "name": "Anker PowerCore 20100 - Ultra High Capacity Power Bank with 4.8A Output, PowerIQ Technology for iPhone, iPad and Samsung Galaxy and More (Black)"
    }
]