[
    {
        "reviews": [
            {
                "review_header": "Sounds great and it really is waterproof because it was put to the test.", 
                "review_text": "This little speaker was shaking my kayak and you could feel the vibration from the bass on the water. It got soaked while on out river trip and never missed a sound. Had it paired with iPhone 6 in a waterproof case and lasted all day long with battery life. Even rigged up a swivel holder for it with it's threaded base adapter.", 
                "review_comment_count": "1", 
                "review_posted_date": "18 Jul 2016", 
                "review_rating": "5.0 ", 
                "review_author": " David D."
            }, 
            {
                "review_header": "this thing is great! It has crisp highs and surprisingly clear/loud lows ...", 
                "review_text": "Don't let the size, price, or brand name fool you, this thing is great! It has crisp highs and surprisingly clear/loud lows and is loud. I have used this in my basement (30'x30') and it sounds hellagood, as well as in a moving truck with loud road noise as a handsfree device while driving. It doesn't require a password to bind, but instead binds to the last thing it was paired with if available, or whatever is asking to pair. I have paired it with win10 and android devices, but it didn't like my older XP machine (which might not be the speaker's fault). The strap comes pre attached and is strong, and the build quality is good. I've dropped my on asphalt as well as gravel and also had it in the rain for 6 hours. Battery lasts for 6-8 hours of nonstop phone/music. It does not autopower down after not being used (which is fine with me). I would and have recommended this speaker to friends and other people.", 
                "review_comment_count": "1", 
                "review_posted_date": "10 Aug 2016", 
                "review_rating": "5.0 ", 
                "review_author": " robert cole"
            }, 
            {
                "review_header": "Loud, long playing, perfect!", 
                "review_text": "I bought this speaker for the purpose of floating down the river. I have spent countless $$$ on blue tooth shower speakers and water resistant speakers, and they all honestly sucked. They work great if your in a tiny 4 foot area, don't get them fully submerged in the water, or only need them for 2- 3 hours. A few supposed water proof ones crackled within 5 min on the river. . So, I decided to add another one to my collection. I am so glad I did!! This speaker is loud enough coming from the center compartment of a double tube ( with the top closed even)for everyone in the group to hear( and even people floating by) . It was so worth the 5 hours to charge to get over 6+ hours on full volume of music on the river and still have a charge a few days later to listen to music on it! It got wet ( river with rapids.. it's going to happen) and the sound was still crystal clear! You can skip and re play songs with the buttons on the speaker and Answer calls. I would highly recommend this speaker!", 
                "review_comment_count": "1", 
                "review_posted_date": "02 Aug 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Jess"
            }, 
            {
                "review_header": "Loud, great quality sound, splash proof as a mother trucker.", 
                "review_text": "Wonderful sounds, battery lasts quite awhile before having to recharge, and truly water proof. While I haven't submersed this product in water, in fact I was recommended not to by a friend who has a roommate who owns the same product, but I do moonlight on the weekends washing dishes at a busy restaruant. I actually bought this so I could listen to music to pass the time and because it was waterproof. Since then I have enjoyed many hours of clear and loud music from this beast. During those hours of use it has been sprayed, splashed and even lay in a pool of hot water on top of the dishwasher for far too long till I noticed and placed it somewhere a little less disconcerning. Sometimes it's a little too loud, in the back of a noisy kitchen no less. I love how easy it is to connect to with multple devices, even though the connection chime is a little alarming, I've noticed a few people jump in fright as it lets loose a loud jingle declaring that I have returned to the device. My favorite feature are the navigational buttons, being able to skip tracks or pause and start the music from the device is lovely. Now I keep my phone charging in my room while I get ready in the mornings and take the speaker to the shower. Being able to start the music, adjust the volume and skip songs as I mentioned before has really made the experience of listening to music while getting ready a blast. Eventhough I bought this for wet conditions I use it while reading to get a louder and nicer sound quality. I do advise not to plug headphones in, I tried it out because my phone was charging across the room and the speaker was next to me in my bed and I wondered if I would use it that way. It freaked out and flashed green, which it does when the battery dies. I simply turned it off and on, reconnected my bluetooth and put the moment behind me.", 
                "review_comment_count": "", 
                "review_posted_date": "17 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " josh malfroid"
            }, 
            {
                "review_header": "Great little speaker", 
                "review_text": "Great little speaker. It's nice and sturdy. I bought it for the skate park but I've used it for lots of other stuff since. It's louder than my laptop speakers so I sometimes plug it into my laptop! Makes a noise to indicate when it's turned up or down all the way, which is handy. Would definitely recommend. I've never taken it in the shower (I actually forgot that was even an option until writing this review) so I can't speak to the hardiness of the waterproof qualities.", 
                "review_comment_count": "", 
                "review_posted_date": "02 Apr 2017", 
                "review_rating": "5.0 ", 
                "review_author": " FJR"
            }, 
            {
                "review_header": "Highly Recommend - Amazing Speaker", 
                "review_text": "Short and simple. I have been using this speaker for 8 months. The speaker is really good quality. Very sturdy and doesn't feel cheaply made. The sound is very good quality, and has loud speaker volume, more than most will need. At the highest sound, the sound quality was still good, no crackle or static sounds. The bass quality is also very good. I've had no problems with temperature (102 degrees f -to- 30 degrees f) Not sure what 'extreme' temperatures are advertised not to use. The waterproofing has worked as advertised. I take it into the shower and listen to music all the time, or have it around the pool in pool parties, not having to worry about soaking wet hands, wet clothes, etc. The battery life is good, I rarely charge mine, but I only use it maybe 3 hours on an average week and charge about once every 3.5 weeks. Also, the Bluetooth pairing was simple and straight forward. All the buttons and controls work perfectly; On/Off, Pause/Play - Answer/Reject Calls, Volume up and Down (Hold Volume up for ~3 seconds skips the song, works for me with pandora and play music on Andriod). For the price of these speakers, I was truly amazed at what I got. I highly recommend this product.", 
                "review_comment_count": "", 
                "review_posted_date": "07 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Christopher"
            }
        ], 
        "ratings": {
            "2 star": "2%", 
            "1 star": "6%", 
            "4 star": "13%", 
            "3 star": "3%", 
            "5 star": "76%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B014VJD6PQ", 
        "name": "Portable Outdoor and Shower Bluetooth 4.0 Speaker by AYL SoundFit, Waterproof, Wireless with 10 Hour Rechargeable Battery Life, Powerful 5W Audio Driver, Pairs with All Bluetooth Devices"
    }, 
    {
        "reviews": [
            {
                "review_header": "There should be 6 stars..", 
                "review_text": "I just received the product. It took all of 1 minute to open, turn on and pair with my iPad mini. It came charged and is currently cranking out AC/DC and filling a very large room with sound. Crisp highs, enough lows to be impressed from some such a tiny speaker... For the $$$ it kills all athe other BlueTooth speakers I have heard...including the Jawbone and Bose speakers. Perfect size as well...", 
                "review_comment_count": "1", 
                "review_posted_date": "08 Jul 2013", 
                "review_rating": "5.0 ", 
                "review_author": " Joe Havoc"
            }, 
            {
                "review_header": "This is the one to get.", 
                "review_text": "I've had others, this one raises the bar. It's like going from the Flintstone's to the Jetson's. Pairing is super simple. On/Off is so cool: Push the top and the core raises with a voice saying POWER ON. LED in core glows red or blue indicating operation/function. Charging is USB mini. No fussing with volume controls on the speaker. Volume is controlled solely on your phone/player where it should be. Short cord length with mini speaker plug smartly stowed on the bottom for devices that don't have bluetooth. Check out the video on YouTube.", 
                "review_comment_count": "", 
                "review_posted_date": "25 Apr 2013", 
                "review_rating": "5.0 ", 
                "review_author": " LWH"
            }, 
            {
                "review_header": "Will recommend this to everyone", 
                "review_text": "Found this little treasure in the Black Friday Deals and so glad I did. The positive reviews are true! This small, egg-like, compact little speaker can fit in the palm of your hand but the sound easily fills up a room. One press and the top rises up to reveal the illuminated speaker within. A voice will announce that the speaker is on and when it's connected via bluetooth. The cable that can physically connect to your device is conveniently attached underneath the speaker. It is short but it's a length that works for the purpose it's meant for. Another simple push will turn off the speaker. My sibling has already purchased their own BLKBOX speakers and I plan to give one as a holiday gift to a friend who's been struggling to find a good speaker. Some pros: Unlike some other bluetooth speakers I've tried in the past, this speaker has a remarkably crisp sound with no whirring sound in the background or during lulls between songs. It is plastic but has a weight to it that gives the impression it can take a few hits and drops without missing a beat. It also has a nice smooth texture and sleek design that I personally like. The volume is pretty good for the size and price. Easily fills a room without making a scene. Picks out the individual instruments and subtle musical undertones well. One con I have noticed is that, because there are no buttons on the speaker for volume since it is all controlled via your device, the level of your device will be the level of the speaker and no more. Now, this is perfect when connected to my iPad because it naturally has a loud sound and high volume. But when connected to a smart-phone, I did notice a drastic change in volume simply because the phone's volume could only go so high. The speaker was still good but definitely not as loud. The speaker I tried previously did have volume buttons so when the phone was as high as it could go, the speaker could still go higher and made the music much louder (though the whirring sound persisted). The music still rang clear and it was definitely louder than the phone, but it is a note to consider. One more thing: the support behind this speaker from the company TheGroupDeal has been outstanding. The minute you I ordered the speaker, I received an email from the company thanking my purchase and ensuring me that any problems would be appropriately dealt with should any arise. When my speaker was delivered, I received another email making sure my delivery came safely and that the product worked as promised. Granted, I can't comment on how good the human support is as I have yet to have any problems, but I do appreciate the care and consideration I was given. I will recommend this speaker to whomever is looking for something that really gives the most bang for the buck.", 
                "review_comment_count": "", 
                "review_posted_date": "19 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Kearstyn"
            }, 
            {
                "review_header": "Great speaker and for a good price", 
                "review_text": "I love it! Decent sound. Great quality. It is small and you can take it anywhere . I recommend it", 
                "review_comment_count": "", 
                "review_posted_date": "09 Nov 2013", 
                "review_rating": "5.0 ", 
                "review_author": " ls240879"
            }, 
            {
                "review_header": "False advertising...Stay Away!", 
                "review_text": "When seeking a wireless speaker, this is not the one to purchase. It is a horrible product. I have now had 3 in 2.5 mths. 2 just stopped working and this one just stopped pairing with my computer. Speaker is not loud. Barely louder than computer/device speakers. You can't hear it in more than a 10 ft radius. Customer service, which is only via email, is excellent. No help line or online assistance. Strictly the one email to communicate. Rather than providing assistance, they have sent me 3 in 2.5 mths. I thought I was getting a deal with it being about 75% off, but it wasn't. I should have paid full price for a better product that will actually work. This is the ONLY item I have bought from AMAZON that I have been disappointed. I guess after all these years, it is bound to happen.", 
                "review_comment_count": "1", 
                "review_posted_date": "06 Jan 2016", 
                "review_rating": "1.0 ", 
                "review_author": " M. Neal"
            }, 
            {
                "review_header": "Not Bad for the Money", 
                "review_text": "I'm certainly not a techie, so forgive my lack of expertise. I'm an old guy, but I do have an Iphone ... with some apps, even. When I had occasion to do some remodeling in my ancient mother's ancient house recently, I knew I'd like some music to stave off boredom. My dusty old GE \"boom box\" was my original plan, but when I dragged it out of the attic and plugged it in, it was deader than yesterday's love. So, off to the internet. Turns out there are gazillions of options and prices for I-speakers, so I landed on this little guy ... decent user reviews, and cheap enough to toss it if it failed. It is teeny, only about the size of a lemon ... it came with enough charge in it to operate, and it paired up with the phone easily ... in about 20 seconds, I was jammin' to the oldies. The sound from this little guy is amazing ... I placed it in the center of the house, and was able to hear it in every room, with the phone volume set at about 3/4. (there is no volume control on the speaker). So far, no problems at all after about 7 hours of continuous operation. Recommended.", 
                "review_comment_count": "7", 
                "review_posted_date": "26 Apr 2013", 
                "review_rating": "4.0 ", 
                "review_author": " Michael J. Greener"
            }, 
            {
                "review_header": "Is it on? The volume sucks! (I hate that word, but it does!)", 
                "review_text": "Small and portable. Sound quality is awful, my laptop plays music louder than this device. I bought it to use in the classroom, and we can't even use it. My coteacher took it home to use for her child at bed time. I would NOT recommend this to anyone that wants to have music play over talking or company. I was so disappointed! Waste of money and gave it away out of frustration.", 
                "review_comment_count": "1", 
                "review_posted_date": "15 Jun 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Sara"
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "6%", 
            "4 star": "16%", 
            "3 star": "6%", 
            "5 star": "68%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B00EDHQ5ZK", 
        "name": "Wireless Bluetooth Speaker- BLKBOX POP360 Hands Free Bluetooth Speaker - for iPhones, iPads, Androids, Samsung and all Phones, Tablets, Computers (Wicked White)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Amazing for any occasion!", 
                "review_text": "Okay wow! This is such a fun intelligent speaker. I love it so much; although the radio feature is great, the bluetooth is AMAZING! The sound quality is extremely impressive and absolutely perfect. I wasn't expecting such an amazing sound quality for something so inexpensive, especially with the bass! What an incredible device. Another favorite thing about this product is the amount is it's ability to change colors... Truly great speaker for the price, in addition to the awesome features! I attached pictures of some of the colors it changes to.... although they do not do the product justice! Every college student should get this as it is a perfect device to use while studying, in addition to any random activity you participate in that requires music! Would totally recommend to anyone.", 
                "review_comment_count": "", 
                "review_posted_date": "04 Oct 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Donna E Ercolini"
            }, 
            {
                "review_header": "Awesome product!!!", 
                "review_text": "This is a very awesome speaker! Way louder then I ever expected from such a small speaker. Love the colors and ease of use. Super durable as well. Doesn't feel like it's going to break by handling it like some I've held. The only thing I wish I could change is the possibility to turn the light on without turning the Bluetooth on. Don't get me wrong u can definitely use the lamp option without actually using the Bluetooth but it's super loud when powering on. All and all I would definitely buy this again!!!", 
                "review_comment_count": "", 
                "review_posted_date": "26 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Amber Corbin"
            }, 
            {
                "review_header": "It worked and looked great in a compact size.", 
                "review_text": "I really liked this speaker and it worked as described, but only for a month or so. It stopped working and had to return it. I was disappointed, but sometimes things just don't go well and would not like to discourage anyone from trying one. I suppose I got the bad one out of the bunch. It didn't get 5 stars because it broke, but it was working great otherwise.", 
                "review_comment_count": "", 
                "review_posted_date": "31 Jan 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Jose L. Sanchez"
            }, 
            {
                "review_header": "I am so disappointed…", 
                "review_text": "Well, I received my speaker day before yesterday. It sounds nice and it looks really cute with the lights. However, and this is a big deal breaker for me, the instructions say not to use it while it is charging. That totally goes against what I need it for. I really don't understand why it has that limitation, but that is clearly what it says. And, it really makes me sad. I am thinking I am going to have to return it and get something else.", 
                "review_comment_count": "", 
                "review_posted_date": "11 Apr 2017", 
                "review_rating": "3.0 ", 
                "review_author": " Gayle Rupert"
            }, 
            {
                "review_header": "Very Cool and Useful...Love It!!", 
                "review_text": "What a neat gadget!! It has multi-functions, with the night light, bluetooth speaker, and color-changing abilities. I love to listen to nature sounds saved on my phone to help me fall asleep.", 
                "review_comment_count": "", 
                "review_posted_date": "08 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Gene Bell"
            }, 
            {
                "review_header": "BEST BUY EVER", 
                "review_text": "It latest so many hours playing. It is easy to control after a few tries. The color light is so nice and cool. It is a bit pricey but so worth it!", 
                "review_comment_count": "", 
                "review_posted_date": "20 Sep 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Ariana"
            }, 
            {
                "review_header": "I love the touch ring that changes the colors", 
                "review_text": "It's cute and loud! decent sound quality for the price I paid. Not heavy at all, I love the touch ring that changes the colors. There are four brightness settings for white from very bright to a nice glow, the blue and red as well.", 
                "review_comment_count": "", 
                "review_posted_date": "31 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " D. Hernandez"
            }, 
            {
                "review_header": "A little staticky.", 
                "review_text": "Love the sound on this speaker. If my phone is not close to it it is pretty staticky.", 
                "review_comment_count": "", 
                "review_posted_date": "07 Feb 2017", 
                "review_rating": "4.0 ", 
                "review_author": " nicole"
            }
        ], 
        "ratings": {
            "2 star": "1%", 
            "1 star": "3%", 
            "4 star": "4%", 
            "3 star": "3%", 
            "5 star": "89%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01IK7BS0U", 
        "name": "Bluetooth Speakers Zhicity Wireless Stereo Subwoofer Smart Touch Lamp Speaker Color Changing"
    }, 
    {
        "reviews": [
            {
                "review_header": "Three speakers, three different approaches", 
                "review_text": "I bought three Bluetooth speakers hoping ONE would be usable. All three ended up being keepers for different reasons. I bought the Cambridge SoundWorks Oontz Angle 3, the Anker Classic Portable, and the Boombotix REX. Portability: All three are fantastic, no real difference. If you want to nitpick, the Boombotix is the smallest, the Anker is next, and the Cambridge is the largest. But again, none of them are really different. I give an edge to the Boombotix for it's clip, it's more flexible. The clip is super hard to get open though. You aren't clipping it to anything thick. Construction and Ergonomics: All three seem durable and well built. The Anker is clearly the best of the three. It's classy, attractive, and feels substantial. And it doesn't walk itself around too much with vibration. But the On/Off switch is terrible. It's tiny and hard to use, you have to use your fingernail. The other buttons are functional, but not as easy to use as the other two. The Boombotix is sturdy and easy to use, the buttons are a little close together, but they work well. It's walks around a little on a hard table, but not terribly. You will have to watch it though, or it will eventually fall off a table. The Cambridge Angle 3 is sturdy and I love the shape. It works really well being able to either lay it down or stand it up. The function buttons are easy to use. The On/Off button is not great, it's too small and in an obscure location. So much so that they have to put a little sticker pointing to it. The rubber end caps are a mixed blessing. I think they will help protect it, but they get really dirty really fast. They pick up every tiny little bit of dust. I recommend standing it up if you put a lot of volume through it because once the bass starts to thump it will bounce and wiggle it's way all over the place. It's actually kinda funny looking. But standing up the passive radiator on the bottom doesn't propel it all over. Sound: I was actually impressed with all three. None of them are on par with the large Sound Dock or Klipsch type speakers, but they could hardly be expected to compete with those at this size and price.The Cambridge is my favorite because it has more bass than the other two. It's a clear winner in bass response. probably about 10-15% more. And that's important to me. The Anker actually has the best overall sound. It's rich and clean. It's probably the \"best\" speaker of all three. And the Boombotix is clearly the loudest. It really puts out some sound. none of them sound bad at all. I would have been happy with any of the three if I hadn't heard the others. But hearing them side by side the Angle 3 fits what I need best. Connectivity: None were bad, but the Boombotix lost connection first, the Angle 3 and the Anker had no trouble at all at 30ft even through walls (but none liked going through a stone fireplace LOL). None were an issue connecting. They were all easy as pie to pair. The Anker was slowest when powering on and trying to find my phone, but we're talking about less than 10 seconds total time for the slowest. Intangibles: The Boombotix has some features that are really appealing. There's an audio out jack, which you can use to run a second speaker (of any make). So that give you options. Send Bluetooth to the speaker and then it will send it to a second speaker. If you don't have a Bluetooth connection on one of your larger speakers you can send signal to the REX and it will connect to your larger speaker. Options are nice. I chose the Angle 3, it fits my needs best with the best imitation of bass, but the others are good enough that I've decided to keep them and use them too. The Anker is nicest, and the Boombotix is loudest and most versatile. I can't really speak to longevity since I haven't had them very long, but I don't think any of them will die on me. Don't be afraid to buy any of these. Just pick the one that fits best.", 
                "review_comment_count": "16", 
                "review_posted_date": "23 Oct 2015", 
                "review_rating": "4.0 ", 
                "review_author": " Jim W"
            }, 
            {
                "review_header": "Good for audiobooks when driving.", 
                "review_text": "I am a FedEx driver, and wanted a bluetooth speaker that would let me listen to music and especially audiobooks as I drove around. I purchased the first generation OontZ speaker OontZ Angle Bluetooth Speaker [ORIGIINAL] Ultra Portable Wireless with Built in Mic up to 10 Hour Playtime works with iPhone iPad tablet Samsung and smart phones - Black Grille , and it served my purposes fairly well. It wasn't loud enough for our larger package trucks, but for the smaller ones, it worked fairly well. It was a bit of a strain to hear it, though, at highway speeds. I had a charging issue with the speaker after I had been using it for 8 months; I charged it all night, and the next day, it would run for a little while and go dead. I contacted Cambridge, and a helpful rep named Jennifer cheerfully offered to ship me the new OontZ Angle 3 as a free replacement for my older generation model that was acting up. It arrived two days later, and I've been loving it ever since. Even apart from their willingness to replace my product, the customer service is outstanding. Pros: It is louder. I had mentioned that the previous generation was difficult to hear at highway speeds; not the Angle 3. (FedEx Express drivers, note: this speaker will overcome the engine noise for the old Sprinters, the newer Benzes, and of course, the Nissans and the ancient Ford panel vans. The larger W700 and W900 vehicles are still just too loud for this sort of speaker, IMO). I love the play/pause button on the end of the speaker, which allows me to pause an audiobook without messing with my phone. The manual says that this button doesn't work with all apps, but it does work with the Audible app I use. The styling of the Angle 3 is superior to the earlier generation. The stick-on rubber knobs on the bottom of the earlier generation have been replaced by two inch-and-a-half-long rubber strips set into recesses on the bottom of the speaker. I have both in front of me; a gentle push will move the old generation speaker across the table with some resistance, but the Angle 3 is much more resistant to moving. One of the rubber knobs had come off the old model, and I had to stick it back on; I don't see how that sort of thing would even be possible with the Angle 3. As well, there is a rubber-like covering on both ends, and this makes the speaker less angular and \"sharp\". As with the old speaker, the battery life is truly outstanding. I have been surprised at how long a single charge will last. I'm no expert, but I find the clarity of the sound excellent. It certainly serves my purposes for listening to audiobooks. My single \"con\" for the speaker is that it shuts down (to conserve battery) after fifteen minutes of non-use, if it is not plugged in. Not that it's difficult to turn back on! But I'd prefer an option that lets it remain on indefinitely. But that is a minor detail, and doesn't keep me from rating this a 5-star product.", 
                "review_comment_count": "15", 
                "review_posted_date": "10 Oct 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Charles J. Bumgardner"
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "5%", 
            "4 star": "15%", 
            "3 star": "4%", 
            "5 star": "73%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B010OYASRG", 
        "name": "Cambridge SoundWorks OontZ Angle 3 Next Generation Ultra Portable Wireless Bluetooth Speaker : Louder Volume 10W+, More Bass, Water Resistant, Perfect Speaker for Golf, Beach, Shower & Home (Black)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Even survived a direct soaking with my garden hose. A+ item", 
                "review_text": "I use this primarily in my small 15 foot boat. I live in south florida. This little speaker puts out big sound for size and price. Even with a 50 HP motor directly behind me I can still hear it over my 4 stroke yamaha engine. On New Years eve we had an outside fire and I used this speaker. Set at 1/2 volume it was plenty loud enough. The sound is crisp and clear at almost all volumes except for full volume. It does get a bit distorted. As far as bass goes it's about what you'd expect for a small speaker. It's not very punchy. My favorite feature is the micro SD card slot. I can load up many of my favorite artists on a 16 GB micro sd card and I don't have to drain my phone using bluetooth. I like to stream Pandora but in the boat there are times I lose the cell signal. The micro SD card solves this issue and actually sounds better than bluetooth.Finally, yesterday after a day on the water i mistakenly left the speaker in my boat while I hosed it down. I absolutely drenched this speaker. It wasn't until this morning that I discovered the still soaking wet speaker in my boat. I shook the water out of it and dried the outside. I then went to work and left it to dry for 6 hours. I didn't turn it on until I got home. I'm pleased to say it still sound great. I would highly recommend this item. If I had killed this item with my \"bath\" I would have purchased another one.", 
                "review_comment_count": "", 
                "review_posted_date": "04 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Maynard G Crebs"
            }, 
            {
                "review_header": "Great little speaker.", 
                "review_text": "This little speaker is amazing. I’m not an audiophile by any stretch of the imagination, but I know good sound when I hear it. As one of the other reviewers noted, this is not a $200 Bose Soundlink mini; this is a $30 speaker well within my budget. When played at full volume it is extremely loud with no distortion. I normally play it at half volume and can hear it clearly throughout my little 2-bedroom home. The speaker has a pretty design and is solidly built. The voice announcement was annoying; it was a very weird, freaky voice. I contacted customer service and received an attachment with a firmware update to remove it. Milla, the customer service representative, sent very precise instructions, the update was simple to install and worked beautifully. The customer service was outstanding. I sent an email on Thanksgiving Day expecting a reply by Monday. I heard back from them within an hour. The company, Wonders Check, is located in China and I don’t know where their customer service center is located, but that’s great turnaround time. Thank you Milla.", 
                "review_comment_count": "", 
                "review_posted_date": "25 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Questing"
            }, 
            {
                "review_header": "Excellent Sound Characteristics for Both Indoor & Outdoor - Audio Characteristics & Other Observations", 
                "review_text": "All in all, for the pricing, this DOSS speakers offers a solid value and sound experience. The only thing that made me quirk an eyebrow was the method of touch controlling the volume... I actually had to open up the instruction manual for that! ((Gasp!!)) Just run the finger in a clockwise or counter-clockwise fashion along the blue ring on top to increase or decrease volume, so not the most precise manner, but an interesting admixture of old tech knob and new tech touch. Pairing Name: DOSS Soundbox Paired with iPhone (iOS 7.1+) - Does show Bluetooth Battery Meter on iPhone screen; volume buttons on unit are independent of the iPhone's Master Volume. PERSONAL AUDIO TEST RESULTS: Official Specifications put it at 100Hz to 18KHz, but when I ran a Low Frequency Sweep (10Hz to 200Hz), I actually got very robust bass fidelity starting @ 40Hz. For the High Sweep (22KHz to 8KHz), I heard 15KHz. AUDIO SIGNATURE: I generally found the mid and high ranges treble pushed for crispness, yet the perceptual bass is as beefy and round as I have ever heard from a Bluetooth speaker under $40. Heck, it is far better response than far more expensive Bluetooth speakers. Seriously. The lows aren't overdriven or dominating - the crispy mid-vocals and up make sure they stay in the forefront of the soundstage. This speaker is one of those that should do very well indeed both Outdoors, where the clarity and loud maximum volume will cut through open air, and Indoors where the richness of the lower frequencies will come out and play. Warmly recommended. - Product provided for free or discounted price for consumer-end evaluation and review. In the end, my primary concern is bringing forth points for your own pre-purchasing considerations, be it personally positive or negative.", 
                "review_comment_count": "5", 
                "review_posted_date": "11 Jun 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Tinfoot"
            }, 
            {
                "review_header": "Great sound quality considering the size", 
                "review_text": "Great sound quality considering the size. We bluetooth from our phone and use it both in the bathroom at home, as well as on the beach. Love the waterproof bag that comes with it! The battery works very well, as we don't really have to charge it that often (can easily get a full weekend out of a fully charged battery, and can go for a few weeks if using at home).", 
                "review_comment_count": "", 
                "review_posted_date": "31 Aug 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }
        ], 
        "ratings": {
            "2 star": "3%", 
            "1 star": "5%", 
            "4 star": "17%", 
            "3 star": "6%", 
            "5 star": "69%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B01CQOV3YO", 
        "name": "DOSS Touch Wireless Bluetooth V4.0 Portable Speaker with HD Sound and Bass (Black)"
    }, 
    {
        "reviews": [
            {
                "review_header": "If I Had A Mind To...", 
                "review_text": "My musical tastes run the gamut from ancient Sumerian folk songs to Norwegian Black Metal and everything in between. So I need speakers that deliver. For a while, I had the built in speakers on my monitor, and their sound was good, if lacking. Still, I didn't see a need to add yet one more plug to my already overtaxed surge suppressor, so I went with \"it'll work\", and it did, right up until it didn't. A few weeks ago those monitor speakers finally went out. I figured I could read lips, but that failed rather quickly when I discovered that most software I use doesn't have lips to read. So I gave in, and started shopping around for speakers. Now, contrary to what you may believe here, I am not made of money, so I had to find speakers that were reasonably priced, while still delivering what they promised. I searched around a few regular PC shops, but they wanted a lot of money for very fancy speakers that I knew I wouldn't use to their full potential. I mean, really, do I need a 7.1 surround while I'm working on a spreadsheet and listening to the Alan Parson's Project in the background? Of course not. So I wanted something simple, inexpensive, but good quality. I don't think that's too much to ask. Apparently, unless I'm willing to take a chance on some cheapies from Walmart that will stop working after a few days, that is too much to ask. So I took to Amazon, because let's face it, this is where most of us end up, at least those of us who live in a tiny town where the Walmart is the only choice available for physical locations. I had found another set of speakers before these, and was tempted to buy them, but they had a power cord and not enough actual wattage for what I wanted. Yeah, I'm not looking for something to knock me backwards every time I get a new email, but I do want it to have some power. So finally I saw these speakers, the AmazonBasics USB powered speakers. I continued past them about half a dozen times before I came back to them and figured they would be worth a shot. I mean, they were powered, but by USB so no more stress on my surge protector. They were also smaller, which meant a smaller footprint, to where I could place them on my desk without fear of knocking them over (I have a small desk). So I purchased them. Got them a few days later, unboxed them, and set them up. It was really easy, as it should be, and I powered them on. I picked some Alan Parsons Project from my Winamp library (hey, I like the Alan Parsons Project, alright?). \"I Wouldn't Want To Be Like You\" starts up, and as it continues to build, I begin to get this smile on my face. Then it kicks off, and it just sounds *great*. The audio is crystal clear, the sound is sharp. There's just enough bass to make it feel \"full\". In short, I was impressed. I wasn't expecting a lot from $13 USB powered speakers, but I really was impressed. If you're on a budget and need a reliable pair of quality speakers, these are the speakers you want. Believe me. I wish you could hear them, I really do, but trying to show you how good these speakers are when you're obviously looking for better speakers than what you got just really defeats the purpose. That said, I highly recommend these speakers. They're the best bang for your buck. 5/5 Stars John", 
                "review_comment_count": "18", 
                "review_posted_date": "04 Apr 2015", 
                "review_rating": "5.0 ", 
                "review_author": " John W. Allen"
            }, 
            {
                "review_header": "Very good speaker for the price !!!!", 
                "review_text": "I have using then for a while and absolutely loving it. I am neither a speaker expert nor I need a high end speakers as I want to use it in my office. And it absolutely perfect for my need. I previously using Altec Lansing BXR1220 2-Piece Desktop Speaker System and they were also good. Unfortunately I dropped one of them and it stopped working. Comparing these two speakers: Altec cost more almost double to amazon basic. Amazon basic is more louder than altec lansing speaker. I also find Amazon speakers take smaller desk space as Altec lansing is longer than Amazon speakers. From my personal experience these two are great speakers and bang on every dollar spent in any of these. I prefer Amazon a little bit higher than the Altec for the sound quality and smaller dimension. Although Altec looks much cooler than Amazon basic speaker :P", 
                "review_comment_count": "", 
                "review_posted_date": "04 Feb 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Adnan"
            }, 
            {
                "review_header": "Maybe 5 Stars", 
                "review_text": "The one thing I've found is that whether you like earphones and speakers is a matter of taste. Some like more bass; some just like \"power.\" I tend to go with \"purity,\" and that is probably the most subjective of all criteria. Compared to my 3 watt Panasonics that I have been using for the past 6 months, the AmazonBasics rate 5 stars. They are substantial; the sound is - as far as I can tell - spot on with the right balance of treble and bass. And for a real change, the cables are actually long enough to reach the appropriate plugs! Compared to my 10 watt Altec Lansings, I'd have to give the AmazonBasics 4 stars, but the Altec Lansings are twice as big with a very large footprint (or base print or whatever you call desk space). I definitely recommend these speakers considering quality of sound, price, and yes, the cables.", 
                "review_comment_count": "7", 
                "review_posted_date": "26 May 2014", 
                "review_rating": "4.0 ", 
                "review_author": " ewinning"
            }, 
            {
                "review_header": "Decent value. Easy to use. Sound quality improved by equalization. See below for measurements.", 
                "review_text": "These A100's are compact and sound okay, especially if you apply equalization. See below for the equalization parameters I used. I have a Dell monitor with its accompanying Sound Bar. I used to have relatively high-end computer speakers but at some point I started to value compactness and simplicity over sound quality, hence I got the Sound Bar with the monitor. But eventually my pendulum swung the other way and I decided I wanted better quality, but keep simplicity, and not take up a lot of desktop space. I gave these AmazonBasics A100's a try because they're so inexpensive, I figured even if I didn't like them, I wouldn't mind having spent the very little money on them that they cost. Plus, I figured, they couldn't sound worse than the Sound Bar. I love the fact that I can plug the USB power cable into the back of the monitor, alleviating some cable clutter behind and under my desk. The sound quality slightly exceeds that of the Dell Sound Bar. Both have the nice feature that even when the volume is cranked up, if there is no signal, they don't produce much audible hissing noise. Plenty of cheap speakers audibly hiss when turned up, but not these. My ASUS Xonar DGX sound card (http://www.amazon.com/gp/product/B007TMZ1BK/) has an equalizer in the driver, so I decided to measure the frequency response of these A100's and the Dell Sound Bar, then compensate for each. Here's the compensation based on the frequency response I measured for the A100's: Frequency in Hz , Amplification in dB: 30 , +20 60 , +20 120 , 9 250 , +3 500 , -6 1000 , +1 2000 , +4 4000 , -14 8000 , +1 16000 , +10 I applied that amount of amplification per channel using the Asus Xonar DGX Audio Center. The improvement is night-and-day better. (If you really want to dial in the compensation better than the GUI sliders let you, you can manually edit the text in the config file directly. It's here: C:\\Users\\<user>\\AppData\\Roaming\\ASUS\\Xonar DGX Audio Center\\cmicnfp.ini. The units are logarithmic, where 1310720 corresponds to 20 dB, and the bands 0-9 correspond to the frequencies listed above.) I applied the same procedure to the Dell Sound Bar. The main difference is that in the 120 Hz band, the Sound Bar response was also below what I could measure. The upshot is that more of the audible frequencies in the Dell were uncalibratable, compared to the A100. So, even after equalizing both, the A100's sound better than the Dell Sound Bar. As you can infer from the chart above, the A100's do not generate much pressure in the extreme low (<=60 Hz) and high (>= 16 kHz) frequencies. That's what you should expect. It would be extraordinarily difficult for such tiny speakers to generate a lot of bass, and without separate tweeters, I wouldn't expect the extreme high-end to sound very crisp. Obviously this is a lot of effort to go through for $14 speakers. I did it out of curiosity more than dedication to making these speakers work for me. The next step up I would take would be a drastic leap from these: Probably AudioEngine A2+ or Vanatoo Transparent One, which cost literally an order of magnitude more money, and take up significantly more desktop space. Not a fair comparison with the A100's. So this was a fun little exercise before diving into spending real money. In summary, these speakers are worth what they cost, and you can get a heck of a lot more out of them if you apply equalization -- which some sound cards offer.", 
                "review_comment_count": "5", 
                "review_posted_date": "11 Oct 2014", 
                "review_rating": "4.0 ", 
                "review_author": " mijagourla"
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "5%", 
            "4 star": "19%", 
            "3 star": "6%", 
            "5 star": "66%"
        }, 
        "price": "$13.99", 
        "url": "http://www.amazon.com/dp/B00GHY5F3K", 
        "name": "AmazonBasics USB Powered Computer Speakers (A100)"
    }, 
    {
        "reviews": [
            {
                "review_header": "Awesome Sound for $100", 
                "review_text": "I am by no means an audiophile but I also didn't want cheapo junk speakers and I also wouldn't benefit from anything more expensive. I did alot of research and had a thread going on overclock dotnet. I gave myself a budget of $100 as I wanted better quality sound then cheap PC speakers and felt anything more than $100 for me and I wouldn't be able to tell the difference anyway. Originally I was looking at getting these Mackie CR3's: Mackie CR3, 3\" Creative Reference Multimedia Monitors They have very good reviews, arent super large and appear to be high quality. While a minor thing, and not even close to the reason I chose the 1280T's, but I wasn't a fan of the green theme of the CR'3. My system is read and black themed, desk is dark brown wood grain, and most else is black. Someone in the forums I mentioned brought up these Edifier 1280T's and I had never heard of them before. They also had relatively few reviews here. The reviews they did have though were good, specifically from the other 2 customers who mention the CR3's as well. Not being real into audio I figured if people vouch for the sound quality of both then I should consider all other factors. The 1280T's are larger (4\" vs 3\") which depending on the space you have could be a plus or minus. For me I had enough room and figured if I could get bigger speakers for the same price I should consider it. Also the 1280T's have the controls on the side which I like, a elegant aesthetic to them that I think would fit in with more than the green of the CR3's, and they include a simple but useful remote. The 1280T's also have AUX RCA which I liked. The CR3's do have the ability to switch Right/Left however. I also like the front cover of the 1280T's. I just got the 1280T's setup and the quality was noticeable as I was taking them out of the box. They have that weight all quality electronics have to them. Everything was packed reasonably well and 0 damage to any items in the box. Got them hooked up in a minute or 2 to my PC and was blown away at the sound quality, even at lower volumes. One of my problems prior with a cheap bullet speaker was that dialog was hard to hear. Not with these the vocals/dialog do not get muddled by the bass or mids. Not being an audiophile the best I can do to describe the sound is to say its much more lifelike than any other speakers I have in my house or have heard when I'm out shopping. It sounds natural, not like I am listening to speakers. I am also hearing instruments and sounds that I did not before in various songs/media. I would 100% recommend these to anyone with the same budget and needs as me. It was also recommended to me that I get a better cable than what comes with the speakers. This is the cable I got and while generally the cable doesnt matter to me the quality of this cable also impressed me. Mediabridge 3.5mm Male to 2-Male RCA Adapter (12 Feet) - Step Down Design - (Part# MPC-35-2XRCA-12 ) I dont think you can go wrong with these. For what its worth Im sure the CR3's are not bad either, they may even be better in some ways, but I am very satisfied with the 1280T's.", 
                "review_comment_count": "4", 
                "review_posted_date": "19 Jun 2016", 
                "review_rating": "5.0 ", 
                "review_author": " CTBenko"
            }, 
            {
                "review_header": "Edifier R1280T vs. R1700BT", 
                "review_text": "Edifier speakers... Who the heck are they and why don't more people know about them? Let me start by saying that I purchased these as a hold over until I could justify tube amps and quality passive bookshelf speakers (Okay, I really mean wives approval) but these make me question even going down that road. I was pleasantly surprised by the faithful sound reproduction, I mean I really wasn't expecting such full and rich sound from a $99 pair of speakers. I was so happy with them that I thought to myself that if the smaller R1280T is this good, what does the R1700BT sound like? Short answer... about the same but brighter. Yes it may reproduce lows better at lower volumes but I assure you that at 50-100% power it's hardly a noticeable difference and I prefer the warmer natural tweeter in the R1280T over it's more expensive big brother. I personally will be sending the R1700BT's back because the set I received is having some issues with the power switch. The R1700BT does have bluetooth and that alone can justify the additional cost, but you are also getting a larger amp as well making it a solid purchase. The looks of the R1700BT are modern compared to that of the R1280T being retro in my opinion. The R1700BT Edifier R1700BT Bluetooth Bookshelf Speakers - Active Near-field Studio Monitors - Powered Speakers 2.0 Setup Wooden Enclosure - 66w RMS is a great speaker with bluetooth, more power and a great price. But for me it was not the softer more natural sounding performer that the R1280T is. I did test these on my TV as well... Let me tell you that if you have a sound bar like I do (or should I say did), you have no idea of what you are missing. The money I spent on sound bars looking for the cleanest and easiest way to improve TV sound, I could have that tube amp set up a couple times over. However; it is kind of a pain since your TV remote cannot be programed to control the speakers, but if your TV has variable audio out you are golden! I like them so much I'll be ordering another set of these (R1280T's) for my TV. I took some photos of the two side by side as there is really not much difference in size. The R1700BT was basically the same height and width but with a sloped front that brings the base out a bit further. IMO, unnecessarily extending the depth. Either speaker is a winner in my opinion! Set up: U-turn Orbit Special Turntable w/built-in preamp and these Edifier R1280T Powered speakers... End of set up, and I love it!", 
                "review_comment_count": "", 
                "review_posted_date": "14 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Evets Ikcerohop"
            }, 
            {
                "review_header": "Great little speakers", 
                "review_text": "I have a small apartment so I don't need a giant sound system. These guys have a nice sound (both treble and bass) and look great. I'm pretty diligent about turning them off entirely when I'm done with them, so I don't know how they act when you leave them on for days+ at a time. I'm very happy with my purchase and am considering getting a second pair.", 
                "review_comment_count": "9", 
                "review_posted_date": "25 Jan 2016", 
                "review_rating": "5.0 ", 
                "review_author": " T. Bolliger"
            }
        ], 
        "ratings": {
            "2 star": "2%", 
            "1 star": "1%", 
            "4 star": "15%", 
            "3 star": "3%", 
            "5 star": "79%"
        }, 
        "price": "$99.99", 
        "url": "http://www.amazon.com/dp/B016P9HJIA", 
        "name": "Edifier R1280T Powered Bookshelf Speakers - 2.0 Active Near Field Monitors - Studio Monitor Speaker - Wooden Enclosure - 42 Watts RMS"
    }, 
    {
        "reviews": [
            {
                "review_header": "Takes a minute but they're awesome", 
                "review_text": "Quick pros and cons 1. The cable between the two speakers is ~5ft long. This is great for me I have a 2-monitor set-up and I needed to find a pair with a cable long enough to put them on either side. These do that with room to spare. 2. The sound is clear. It actually took me by surprise. My last pair were a little more bassy so I thought something was off but really it's just better sound reproduction. I do a lot of audio recording (voiceovers for videos, podcasting) and my voice sounds good on these. It also captures reverb very well (damn reverb, need to upgrade my audio set up next!) 3. These sound nice. The highs aren't bad, the mids aren't bad, and the bass isn't bad. I mean they're not like amazing great but these are also $25 speakers. This is probably the best noise I've ever gotten out of $25 speakers. 4. My last pair of speakers were USB powered and I grew to hate that. These are AC powered (6ft long power cable) and that makes me happy. 5. The volume has a good, high quality feel to it. 6. The speakers are deceptively light and made of plastic, but they look really nice with my whole set up. 7. The 2.5\" drivers per speaker definitely do their job. Also, these speakers can get pretty loud before getting all nasty sounding. Not like rattle-the-windows loud, but definitely louder than you'll need them to be. Cons 1. The tone knob is rubbish. Put it in the center and use your computer's system equalizer if you need to mess with it. 2. These things are huge! Easily the size of my forearm. I wasn't expecting them to be that large. It ended up not being a problem (hence no stars removed). 3. Read other thoughts Other Thoughts These things take a bit to \"burn in\". I had them shipped and it's winter time so they may have just been cold but the first couple of hours I spent tweaking every setting on my computer trying to figure out why everything sounded so muted. The bass sounded fine, but the mids and highs sounded a tad muffled (like the sound you get when you put your hand over a speaker. I turned the music off, reset everything to default (where I had started from) and let them chill for a few hours. Then, while I was out, I put them up on moderate volume and, without messing with any equalizers, put some music on and left them playing for 5 or so hours. Once they warmed up and got a little burn in, they sounded much better. For most cases I use default on all the system noises but in Winamp I chose a preset that boosts the bass and treble a little bit. Even when burnt in, the lows and bass need a little boosting to keep up with the mids. Now I'm quite happy with how everything sounds. They require a little work, but once you get them settled in these are a fantastic pair of speakers and probably among the best you can get until you start getting into 2.1 speakers. *****Update August 1st, 2014***** I bought a second pair of these speakers. My girlfriend's speakers died and I gave her the original ones I bought (still going strong after 7 months) and I bought myself another pair. This time it was shipped during the summer so the speakers weren't submitted to the harsh, frigid cold of winter time like the first pair. Thanks to this, the problems I experienced the first time around were much less pronounced and much easier to fix. The \"burn-in\" wasn't really required at all and once I got the volume and such configured everything worked pretty well. It took me about a day with the first pair but this time around it only took a couple of hours of use before they sounded good. I guess that means most of the problems were simply because they were cold when I first plugged them in. It keeps its 5 star rating. I have bought two of these and would buy a third. I'll update if either of these break down but until then, I'm still happy with my purchase. Still gets my vote on the best $25 speakers around. I'd say I'd buy them again but I just kind of did so yeah I'd probably buy them a third time. *****Update May 6th, 2015***** Happened to be goofing around notice that this was the highest rated review. Cool! So I thought I'd do an update. Both sets of these speakers still work flawlessly (my girlfriend's pair that I gave her and my current pair). They both still sound great. If these broke, I would still buy these over again (unless, of course, I had like some serious cash to spend on a serious set of speakers). I still do my audio recordings, albeit on much better hardware than before. My recordings still sound great on these. I've had no problems with them whatsoever. They survived moving without breaking and a fried motherboard without flinching. I still recommend these to people :) *****Update December 18th, 2016***** Still the best ~$25 speakers out there. Both pairs still work after years of use. These days I have to keep the sound down as my roommate works night shift so these actually didn't get used for about 10 months (been using headphones). Turned em on and cranked em up a bit and it's the same old speakers I remember. Again, I proclaim, that unless I'm spending serious money on serious speakers, these are still my cheap go-to speakers. So happy they still sell these.", 
                "review_comment_count": "22", 
                "review_posted_date": "25 Jan 2014", 
                "review_rating": "5.0 ", 
                "review_author": " J. F. Hind"
            }, 
            {
                "review_header": "Excellent speakers for a small home office and for mounting on a monitor stand", 
                "review_text": "Really like these speakers. The range and response is good for movies, music, and video games in my small home office. I went with this 10W powered version over the USB version and was not disappointed. I also chose this speaker for it's good looks, and planned to mount it next to the monitors on my dual display to clear the desktop. This worked out great--please see the photos. I used a piece of aluminum angle bolted to the monitor mounts and screwed into the back of the speakers. I considered adding another bracket at the bottom, but the speakers hang nicely from the top bracket. I will probably paint the angle black but left it unpainted for the photo. NOTE: You can remove the stands as I did by opening the case and removing 4 small screws inside holding the stands in place. To open the case you just need to back out 8 screws on the back of the speaker box. You also have to pull the volume knob on the right speaker and use a socket or needle nose pliers to remove the retaining bolt and washer. The speaker stands really should be easily removable but I didn't think it was worth knocking off a star.", 
                "review_comment_count": "9", 
                "review_posted_date": "22 Mar 2015", 
                "review_rating": "5.0 ", 
                "review_author": " Alan Canfield"
            }, 
            {
                "review_header": "No \"humming\" wins the day!", 
                "review_text": "I decided to buy these speakers to replace my cheap $7 speakers. I was hoping these new speakers wouldn't \"hum\". And they don't! Well, at least they don't when they are plugged into the front panel of my computer. When I plug them into the back, there is a very loud hum and they become unusable. I think my usb wifi adapter or something is causing interference. Anyway, when they are plugged into the front of my computer, they are flawless. They play clearly and loudly and they are completely silent when I have nothing playing on my computer. Hurray for no humming! P.S. The speakers are much bigger than I expected. My dinky $7 speakers were half the size so these things look like big hulking bricks to me! But at least they are high quality! If you took two ordinary red bricks and stood them up on your desk, that's a pretty good estimation of the height and thickness of these speakers.", 
                "review_comment_count": "5", 
                "review_posted_date": "18 Nov 2013", 
                "review_rating": "5.0 ", 
                "review_author": " crystallized"
            }, 
            {
                "review_header": "I wanted these to be great, i really did.", 
                "review_text": "I did an impulse buy on these considering all the great reviews and now i regret it. Now, i love logitech products and own several peripherals and even an older, higher-end speaker set from them. I tried these out streaming music on my desktop, playing mp3, watching music videos, etc. I have the volume up halfway and the sound is completely flat, no bass, no highs, just loud. There is a \"tone\" dial that seems like a decoration. I'm not an audiophile by any stretch but the sound quality just won't cut it for extended listening. Maybe if you've never had speakers before these would be a worthwhile starter set, but honestly i can't understand where all the glowing reviews came from. I expected too much and now a $20 Prime purchase would cost me half the price to return them, so they will sit here in a closet collecting dust. The design is great, they would look awesome on any desk. I wish they could use the same profile, and put some better quality speakers into them. Learn from me, if you are a fan of audio, spend double at least get something with a small subwoofer and skip right over these.", 
                "review_comment_count": "", 
                "review_posted_date": "22 Mar 2017", 
                "review_rating": "2.0 ", 
                "review_author": " wheeljack78"
            }
        ], 
        "ratings": {
            "2 star": "6%", 
            "1 star": "7%", 
            "4 star": "21%", 
            "3 star": "9%", 
            "5 star": "57%"
        }, 
        "price": "$22.99", 
        "url": "http://www.amazon.com/dp/B00EZ9XKCM", 
        "name": "Logitech Multimedia Speakers Z200 with Stereo Sound for Multiple Devices, Black"
    }, 
    {
        "reviews": [
            {
                "review_header": "The Best Bluetooth Speaker For The Price!", 
                "review_text": "When I first received this speaker I didn't expect much because it was $20 but when I received it in the mail I was blown away. The packaging was a great presentation and I fell in love with the speaker the moment I saw it. It feels nice and has a smooth metal grill on the front. After listening to the Bluetooth speaker I was amazed at the quality and how perfectly the bass is balanced. Now don't get it twisted it's not thundering bass to make your chest pound but it's just the right amount. The LEDs are nice and bright not to mention the feature to change how they light up or to turn them off completely. If you don't want to use Bluetooth you can plug it in via the Auxiliary port and it has a built in microphone. It lasts for an incredible amount of time in between charge cycles. This speaker deserves a higher price for the quality and it truly does give you the bang for your buck. Pros: -Amazing Bass -Great Sound Quality -Smooth Metal Grill -Rubber-like Casing -Built in Microphone -Auxiliary Port -Bright LEDs -Controls on Speaker Cons: None", 
                "review_comment_count": "2", 
                "review_posted_date": "31 Jan 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Jaqaveous Lewis"
            }, 
            {
                "review_header": "Awesome speaker! Bought one for my myself and one ...", 
                "review_text": "Awesome speaker! Bought one for my myself and one for my niece. The sound quality is clear, loud, and the different LED settings are nice! The speaker is made well - feels good with the soft rubber touch outside. Battery life is about 6 - 8 hours without the LED's on. I have not tested the battery life with LED's on. You really can't beat the price for what you're getting in comparison to the brand name speakers out there. I would say it's quite comparable to the JBL speaker I had previously bought for $120.", 
                "review_comment_count": "", 
                "review_posted_date": "08 Aug 2016", 
                "review_rating": "5.0 ", 
                "review_author": " J&amp;S SHOPPER"
            }, 
            {
                "review_header": "Look no further. Best Speaker for an even better price.", 
                "review_text": "High Quality, Perfect Price I purchased this speaker after a long search on amazon. I stumbled upon this product and was instantly drawn right in. I'm glad I did, this speaker has the quality of a speaker that costs at least 100+ dollars. The low end range on this speaker still surprises me for its size. The built in LED lights are very vibrant and definitely catch your eye. I would recommend these to every single one of my friends! 10/10", 
                "review_comment_count": "", 
                "review_posted_date": "13 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " JimboTech"
            }, 
            {
                "review_header": "I LOVE THIS SPEAKER", 
                "review_text": "I really love this bluetooth speaker, It looks great and plays really well. I love it so much i am going to buy another. If you want a bluetooth speaker that is easy to use and has really great sound this is the one for you. I can say that it is one of the best speakers i ever purchased. If you are wanting to buy it as a gift, this one is perfect.", 
                "review_comment_count": "", 
                "review_posted_date": "24 Mar 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Mr. Lsig"
            }, 
            {
                "review_header": "⭐️⭐️⭐️⭐️⭐️", 
                "review_text": "This little speaker far exceeded my expectations! Excellent volume settings, easy to adjust. I like that you can use Bluetooth or directly connnect your device with the plug in wire it comes with. I like the different led light settings. My favorite mode is the diagonal lights that blink with the tempo of the song. My only complaint is that when I use that light up setting, the lights won't fully light up unless I have the volume near the highest setting. Otherwise, I highly recommend this product! Best $20 I ever spent!", 
                "review_comment_count": "", 
                "review_posted_date": "09 Apr 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Christina Matos"
            }, 
            {
                "review_header": "5 STARS", 
                "review_text": "This speaker is absolutely awesome! It has amazing sound, I was surprised due to the price. There are several settings for the lights which is very cool. I love this little guy. Thank you!", 
                "review_comment_count": "", 
                "review_posted_date": "29 Sep 2016", 
                "review_rating": "5.0 ", 
                "review_author": " TaylorGoSeahawks"
            }, 
            {
                "review_header": "Very big sound in such a small box.", 
                "review_text": "I just received this speaker yesterday but so far we are impressed. The sound quality surprised us, really full and robust. I read a review that said it's no \"Bose\", and that's true, but it was around $20 and maybe a tenth the size, and the base coming out of it is jaw-dropping. I haven't had time yet to review its battery life, or the function of those cute lights, but so far it brings a smile to our faces just watching the light pattern it came out of the box with. Nice, sturdy box too. The female voice that helps by giving pointers is a nice touch. The volume control was not easy to understand but I've not taken much time yet: I just controlled volume at my iPad so far, and for the price, that's fine, but I assume I'll learn more soon. The distance range is from one end of our modest size home to the other. Nice! I've already gotten a note from the seller asking whether we're satisfied with the speaker and it seems as though they would be attentive if there were a problem. We're happy with this purchase", 
                "review_comment_count": "", 
                "review_posted_date": "08 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Dotty North"
            }, 
            {
                "review_header": "gotta stay close.", 
                "review_text": "it has a very good sound to it i will call into question the distance though because i can hardly walk around my small room, or around my jeep without it cutting out. so they must be getting the 30 feet distance from a flat unobstructed testing area because 3 feet with anything between it killed the music. then it would play the song super fast to catch up with the song playing on my phone....makes for a fun time the first time it happens", 
                "review_comment_count": "", 
                "review_posted_date": "03 Apr 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Joshua Ward"
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "6%", 
            "4 star": "20%", 
            "3 star": "5%", 
            "5 star": "65%"
        }, 
        "price": "", 
        "url": "http://www.amazon.com/dp/B015R3XJCK", 
        "name": "Bluetooth Speakers,URPOWER Hi-Fi Portable Wireless Stereo Speaker with 7 LED Visual Modes and Build-in Microphone Support Hands-free Function, for iPhone 7 Plus,7,Samsung,Tablets and More-Z3"
    }, 
    {
        "reviews": [
            {
                "review_header": "No value for your money", 
                "review_text": "The moment I felt the weight I knew I made a mistake. Horrible sound quality. it's literally a clasic AM/FM radio turned in to a \"bluetooth\" speaker. Too big for the volume capacity.", 
                "review_comment_count": "", 
                "review_posted_date": "17 Nov 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Emmanuel"
            }, 
            {
                "review_header": "Don't buy", 
                "review_text": "Cheap the volume barely turns up. Then they said it would cost 10.00 to return it. I'll keep it but it's true you get what you pay for.", 
                "review_comment_count": "", 
                "review_posted_date": "18 Oct 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "I've had this item for 5 days and it already ...", 
                "review_text": "I've had this item for 5 days and it already lost its ability to hold a charge. I also work in a warehouse where I cant hear this very well. Most reviews said it was loud for a noisy workplace and I disagree. Will be returning this item.", 
                "review_comment_count": "", 
                "review_posted_date": "11 Dec 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "It's Great..until it breaks.", 
                "review_text": "I'd rate this 2.5/5. Its a great GREAT speaker at first. Loud enough to be a music source while playing pick up basketball in a gym and it was the main source of music at a 20-25 person get together in a basement. This speaker has some power. Loudness probably gets a rating of 3.5/5. And the option to toggle the bass and treble is awesome too to get the clearest sounding music. Now to the bad parts. the bluetooth kept disconnecting even though the phone was resting on top of it, and when switching to the aux it would do a weird red and blue blinking thing and not produce any music at the most random times. You can imagine how annoying this would be especially when playing music in front of a number of people with everyone jamming out. Maybe I'm just heavy handed but about a week and a half of moderate use, the charging plug in broke and now I can't get it to charge. The battery lasts forever but once it dies I wont be able to charge it at all and it will be a useless block. Very disappointed in this speaker because I feel like it has so much potential to be a top selling affordable speaker. I think i will purchase one more to see if mine was just a dud but come on Sylvania!! If this thing worked properly i'd rate it 4.5/5 but it needs some hardware work.", 
                "review_comment_count": "1", 
                "review_posted_date": "07 Aug 2016", 
                "review_rating": "2.0 ", 
                "review_author": " Vaughn"
            }, 
            {
                "review_header": "Great speaker", 
                "review_text": "I have really enjoyed using this bluetooth speaker. I have it in the living room and it looks great, and the sound quality is not bad at all. I use it when I have guests over and everyone seems to like it. It's a prefect size and reminds me of something that would cost a lot more than it does.", 
                "review_comment_count": "", 
                "review_posted_date": "13 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Margie"
            }, 
            {
                "review_header": "it's not too bad, longevity unknown", 
                "review_text": "Got the speaker, plugged it in and charged it while at work. Got it set up on bluetooth and played with it for a little while. Seems nice, sounds good, and is rechargeable. Kinda is a bummer that there's no remote control with it, but it's bluetooth, so you can adjust right from the phone. The only thing I dislike is the annoying LED that shines on the speakers cannot be turned off. I would think the battery would last longer if you could. Also it's really lightweight, so I question its durability and longevity. It sits atop a tool box, so I'm hoping for the best", 
                "review_comment_count": "", 
                "review_posted_date": "18 Jan 2017", 
                "review_rating": "4.0 ", 
                "review_author": " Geno"
            }, 
            {
                "review_header": "Love this speaker", 
                "review_text": "I love. This speaker. Not only do I use in the house for personal reasons listen to music however I also take it to work for when we have conference calls and there's a group of us it's easy to hear on the speaker cuz it's loud enough the only downfall is they gave me the wrong charging device I have a charging device that is two phone jacks Style . I really need the one that's a dc5 USB cord with the other plug to it so it's plugged in and charged other than that I love this speaker just don't know how to get in touch with anybody to tell them that they messed up on the charging plug", 
                "review_comment_count": "", 
                "review_posted_date": "27 Mar 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Michele Corr"
            }, 
            {
                "review_header": "worked fine for 2 weeks the 3rd week stared acting up ...", 
                "review_text": "worked fine for 2 weeks the 3rd week stared acting up the work week its not even charging 😒😒 DONT BUY IT !!", 
                "review_comment_count": "", 
                "review_posted_date": "23 Sep 2016", 
                "review_rating": "1.0 ", 
                "review_author": " Marco"
            }
        ], 
        "ratings": {
            "2 star": "6%", 
            "1 star": "16%", 
            "4 star": "15%", 
            "3 star": "7%", 
            "5 star": "56%"
        }, 
        "price": "$29.99", 
        "url": "http://www.amazon.com/dp/B00YO2T6ZA", 
        "name": "Sylvania SP328-Black Portable Bluetooth Speaker"
    }
]