[
    {
        "reviews": [
            {
                "review_header": "Great value for this price point, love the front camera!", 
                "review_text": "Very premium look for this price point. Bought one trying out love it so far! Pros: 1. 8MP Selfie camera is definitely surprised me, most front camera at this point sucks so much. This one however looks great . If you haven't, try out the beauty mode, it guess your age and tell you are \"Mrs Dreamy\" or \"Attractive\", I'm showing off this feature to my friends and families, they were laughing how interesting this is. 2. Performance is good. Very smooth on using any app or playing videos/games. Doesn't feel any lag. 3. Customized Cool UI: it's a customized Android OS. But don't feel overwhelmed like Samsung, which typically comes with tons of pre-load apps... so I'm ok with it. Doesn't seem slow down the performance because of it. 4. There are some unique features that I find first time in phones: 1) take a full screenshot using the scroll down on a web page, great feature if i'm sharing an infographic or article to my friends. 2) on-screen recording: i literally record a whole video while it's playing and share on social... interesting 5. Unlock apps with up to 5 fingerprint. Very helpful especially using this when you are driving, i set up one unlock the phone, one quick access to google maps, one to call my husband, one to access my message app. Cons: 1. The camera isn't the best at the low lighting such as night. Can feel a little pixelated when looking at the pictures. 2. Display is a little bit small for me. I would prefer bigger than 5\". But it's personal preference.", 
                "review_comment_count": "", 
                "review_posted_date": "21 Jan 2017", 
                "review_rating": "4.0 ", 
                "review_author": " chen xin"
            }, 
            {
                "review_header": "Cool phone by Coolpad! Conjr is a great value for spec!", 
                "review_text": "I was excited to use this product after I read it was one of the best value smartphones launched at CES 2017. The reviews from CES sold me on the value, and I quickly pre-ordered. In the days that I have been using it, I have been very pleased with the performance. You will not be disappointed. The device is premium in look and feel. The 2.5D curved glass display and metal body are not typical in this price tier. You typically would see plastic phones at this price point. The Conjr is really nice. I also enjoy taking photos. The 8MP front camera (with LED Flash) is a camera size you wouldn't see typically at this price point. I have had fun shooting in the 'beauty' mode. It was fun to see how the camera would 'label' me and my friends. The LED flash on both front and back cameras is good. The Conjr also has a rear fingerprint scanner. I have used it so far for quick unlocking of the phone, and it identifies my fingerprint quickly. I have also used it for snapping photos from the front camera. Conjr also has a quick response in taking photos, too. You can also program up to 5 fingerprints. I use both Cricket and T-Mobile. I have used both SIM cards in the Conjr. The network compatibility and response using both SIM cards is very good. I have had no issues with making/receiving calls, texts, and using mobile data while both SIM cards are in the phone. One thing that was new to me was the CoolUI. It took a little time for me to get used to it at first. Access to quick features are able to be accessed by swiping up from the bottom of the screen. Stock Android typically gives access to these features by swiping down from the top of the screen. Once I figured that out, it was much easier to access quick settings/features. There is also cool features like \"Screen Recording\" and \"Screen Shot-Scroll Capture\". I haven't seen those previously in other phones, and those are cool features. Lastly, I have used both Bluetooth connectivity in my car and a headset for making phone calls and listening to music/podcasts. No issues using either of those features. The speaker sound quality is good to great. The speaker is located on the back of the phone. As long as you have the speaker exposed, you should have no problem with audio. After using this phone for the past week, I would recommend this phone. At this price point, it is one of the better phones available. Coolpad has impressed me with Conjr. What I'm Impressed With: ** ID - 2.5D curved glass display and metal body (no fingerprints) ** 5\" screen, lightweight ** Fingerprint Scanner (located on rear) ** Comfortable to use ** 3GB RAM ** 8MP front camera, with LED Flash (cool camera software/Beauty Mode) ** Cool UI - different, but I like it more each day ** Dual SIM and micro SD Card expansion ** Protective case included What I wished it had, but not deal breakers: ** No USB Type C charger. It uses Micro USB. ** Quad Core, not Octa Core ** Cool UI - took time to understand some of the features", 
                "review_comment_count": "2", 
                "review_posted_date": "19 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " ChahEnaL"
            }, 
            {
                "review_header": "Very solid phone", 
                "review_text": "This is very solid device overall and it has a great camera. The device feels premium in hand and works great on GSM networks. The interface is fluid and moves very fast. I would highly recommend this phone as it provides a great value for the price point. I look forward to using more Coolpad products in the future.", 
                "review_comment_count": "", 
                "review_posted_date": "19 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " ksolo12"
            }, 
            {
                "review_header": "Conjr amazing phone", 
                "review_text": "Great phone. Phone looks expensive, high tier, premier but very affordable. Getting great service, great features, love this phone.", 
                "review_comment_count": "", 
                "review_posted_date": "19 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "Very cool phone", 
                "review_text": "Pros: The product feels very comfortable in hand. The screen looks very nice and it takes great photos. I'm very impressed with the front facing camera and the flash on it. I use it every day. Overall its a very solid product. I like it very much. Cons: Have not encountered any problems Other Thoughts: I would highly recommend my friends and family members to purchase this product.", 
                "review_comment_count": "", 
                "review_posted_date": "14 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Amazon Customer"
            }, 
            {
                "review_header": "to my surprised a very good looking phone", 
                "review_text": "I purchased the device not expecting much, to my surprised a very good looking phone. The fingerprint feature is very easy to set up an just makes it easier to use apps. I am using a TMO and ATT sim cards, with the dual SIM card feature no need to carry 2 phones. Very expensive looking phone, nice features with low price!", 
                "review_comment_count": "", 
                "review_posted_date": "27 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " American Patriot"
            }, 
            {
                "review_header": "Perfect gift for elder parents", 
                "review_text": "I love this phone, first of all, it is good for elder parents using as first LTE phone , very easy UI and icon. Camera etc it is aslo helpful . Anyway, love it love it!!! Perfect gift for your parents!!!", 
                "review_comment_count": "", 
                "review_posted_date": "24 Jan 2017", 
                "review_rating": "5.0 ", 
                "review_author": " Owen"
            }, 
            {
                "review_header": "Great phone so far", 
                "review_text": "Great phone so far! After going through 5 phones by Blu last year I tried this phone, way better than any Blu phone I've tried. Definitely recommend this phone by coolpad.", 
                "review_comment_count": "", 
                "review_posted_date": "15 Feb 2017", 
                "review_rating": "5.0 ", 
                "review_author": " David"
            }
        ], 
        "ratings": {
            "2 star": "4%", 
            "1 star": "7%", 
            "4 star": "8%", 
            "3 star": "8%", 
            "5 star": "73%"
        }, 
        "price": "$149.99", 
        "url": "http://www.amazon.com/dp/B01MXKGK9R", 
        "name": "Coolpad Conjr – Unlocked Smartphone, Dual Sim, Multi-Finger Unlock, 4G LTE – Iron Grey"
    }
]