[
    {
        "reviews": [
            {
                "review_header": "Best phone I have owned with Boostmobile!",
                "review_posted_date": "19 Jul 2016",
                "review_rating": "5.0 ",
                "review_comment_count": "6",
                "review_text": "I love this Samsung J7, since it is bigger than the s6 and s7, and as good as my old S5 (as compared in the images). I had no issues charging it or switching it over from old phone to this new phone - via a 4 minute phone call to Boostmobile. Yes, the S6 and S7 have -much- faster processors, but I do not need that for what I do... and so far, after 1 month of use, I absolutely love this phone!. The phone feels great, responds quickly, and looks freaking awesome. Pros: -Great price -AFFORDABLE! -Bigger than most other phones available -Great quality screen Cons: -2 bottom buttons- on side of the main home button- DO NOT light up -Camera is not comparable to that of the S5, S6, and S7 -Overall quality does not feel as sturdy as the other models mentioned (Shell plastic is thinner). After one month of use, I rated this phone with 4 stars. I will be updating this review in about 6 months. REVIEW UPDATE: February 19, 2017 After eight (8) months of owning this phone, and 7 months since this original review, I am back today to continue my review as promised. I am doing 2 things for those of you who are reading this review for the first time: 1) I have added a star to make this a 5 star review! 2) I will explain why I have decided to come back to add this star to my review. Let me clarify that since reviewing this, I have purchased a second one for my wife. I will also list what items I purchased it along with: Mr Shield Tempered Glass Screen Protector for Samsung Galaxy J7 [Will Not Fit For 2016 Version] - 2-Pack Samsung EVO 64GB Micro SDXC Memory Card with Adapter up to 48/MB/s (MB-MP64DA/AM) Phonelicious SAMSUNG Galaxy J7 Case(Boost,Virgin,TMobile,Metro PCS)Slim Fit Heavy Duty Ultimate Drop Protection Rugged Cover with Screen Protector & Stylus (Navy Blue Matte) Of course, purchasing a case, the Screen protector, and a good quality memory card may also influence how this product has performed. This phone continues to work as expected, and has delivered so far. I feel my investment on this phone has paid off, and my money has been worth. Being a somewhat frugal shopper, I thought I would give this phone a try to since it's price was reasonable for what I was getting. My 1 year old (who is now 18 months) has used and abused this phone. He has thrown it on the floor dozens of times, and has scratched, as well chewed on it. What has happened to the phone so far? - It has gained a large crack, on the screen protector. The phone is still working as it did 8 months ago, and the cheap items I purchased to protected have taken quite the toll. I had originally mentioned that the phone felt \"cheap\", and the thin plastic that it is made out of, is certainly noticeable compared to the quality of the S5, and other S series for that matter. Given that this phone has performed well, continues to deliver, and has outlasted quite some abuse, I made the judgement to give this phone the extra star, since this is a great product to my standards. I plan to come back in June, and review this item again after a full year of use!",
                "review_author": " JLO"
            },
            {
                "review_header": "Very good phone for the money",
                "review_posted_date": "13 May 2016",
                "review_rating": "4.0 ",
                "review_comment_count": "3",
                "review_text": "I bought this phone from boost Mobile website for 200 bucks. Of course its not as good as the s7, but if you don't wanna spend 700$ for a phone, then you can't go wrong with j7. Very good phone for the money. I already bought a couple spare batteries. Pros- Good price, good call quality, fast internet, good camera, good selfie camera, great display, perfect size, great for texting, Great battery life (leave it on power save mode), good speaker, 6.0 marshmallow is great, Cons- No LED notification light, incoming ring tone couple be louder.",
                "review_author": " Frankie"
            },
            {
                "review_header": "GORGEOUS phone .... I'm in love with it!",
                "review_posted_date": "06 May 2016",
                "review_rating": "5.0 ",
                "review_comment_count": "",
                "review_text": "I love this Samsung J7. I couldn't afford the sticker price for the S6 or S7 (sticker shock!). Therefore; I opted for this which is scaled down in terms of processing/memory BUT it's much better quality than the phone I was using for my Boost Mobile account. I had no issues charging it or switching it over from old phone to this new phone - via my online account (I didn't have to talk to anybody to do this and it worked out just great). My hubby has the Samsung S6 which he saved/paid for upfront (no contract at Boost Mobile). Comparing my new J7 to his S6 - well; apples to oranges. His has 2 processors (a quad-core and an octa-core). This J7 has just the octa-core BUT for me is proving to be plenty of processing power along with the 2GB ROM. This was pretty comparable to the ZTE Warp Elite I've been using since January 2016 but I'd have to say that the Samsung is much faster - also that the screen response is so much better in this J7 model (even with the glass protection I placed on the screen). My hubby bought me this for my upcoming 60th birthday! GREAT present for me.....all mine! Thank you 'shopcelldeals' for selling this at a reasonable price that was affordable. Recommended.",
                "review_author": " CMarie"
            },
            {
                "review_header": "Worth it.",
                "review_posted_date": "19 Nov 2016",
                "review_rating": "5.0 ",
                "review_comment_count": "",
                "review_text": "I love this phone! Coming from the galaxy S3 for Boost this is a big jump in the right direction. $20 cheaper on amazon than the boost mobile site another plus.The battery last all day. That is while talking/texting using apps. It is two times bigger than the S3 but def worth it. The operating system is much faster and more responsive as well.",
                "review_author": " TG"
            },
            {
                "review_header": "Love the phone",
                "review_posted_date": "05 Jul 2016",
                "review_rating": "5.0 ",
                "review_comment_count": "",
                "review_text": "Awesome phone for the price. Face it, these are not the S7 phones but a cheaper version. I have no problem with them at all. Plenty of memory and large screen. I love the phone. You are getting a Marshmallow system which should keep me going for a couple of years. Boost mobile is like every other cell company. Hard to deal with on the phone but once the service is set up, no problems. Fast 4gLTE.",
                "review_author": " Leesaa"
            },
            {
                "review_header": "This is a great phone for Boost Mobile",
                "review_posted_date": "06 Oct 2016",
                "review_rating": "5.0 ",
                "review_comment_count": "",
                "review_text": "This is a great phone for Boost Mobile. I have had it a few months and it's been great. Much nicer than my old one and the big screen has spoiled me. The iPhone 6 I use for work is tiny by comparison and I much prefer this phone over the iPhone.",
                "review_author": " David Erickson"
            },
            {
                "review_header": "Five Stars",
                "review_posted_date": "26 Jul 2016",
                "review_rating": "5.0 ",
                "review_comment_count": "",
                "review_text": "love this phone! such a more affordable option. It transfered right over on my boost account, very pleased",
                "review_author": " Andrea Armstrong"
            },
            {
                "review_header": "I love this phone!!!",
                "review_posted_date": "14 Feb 2017",
                "review_rating": "5.0 ",
                "review_comment_count": "",
                "review_text": "I love this phone so much, it is really fast so far no problem and I like how the back is like a little bit sparkly but only when you put it in light!",
                "review_author": " Lyndon"
            }
        ],
        "price": "$147.99",
        "url": "http://www.amazon.com/dp/B01ETPUQ6E",
        "ratings": {
            "3 star": "4%",
            "4 star": "17%",
            "1 star": "9%",
            "2 star": "2%",
            "5 star": "68%"
        },
        "name": "Samsung Galaxy J7 No Contract Phone,  16GB ROM/2GB ROM, 5.5 Inch - White - (Boost Mobile)"
    },
    {
        "reviews": [
            {
                "review_header": "Excellent Phone For Value-Conscious Buyers & Intermediate Users - Rugged Weatherproof Design",
                "review_posted_date": "01 Aug 2016",
                "review_rating": "5.0 ",
                "review_comment_count": "",
                "review_text": "I've had some time to kick my phone around (figuratively and literally), and I'm really impressed with this phone. It's value priced, but still very functional. I switched from a Samsung Galaxy SIII, and I feel that this was definitely an upgrade. While the Moto G3 has less memory (8GB) and storage (both internally, and it only supports up to 32GB SDHC micro card), the better processor makes a huge difference. I don't play games, but I do still run a fair number of productivity apps (the biggest being Polaris Office and TeamViewer) and they benefit greatly from the quad-core 1.4 GHz Cortex-A53 CPUs performance. The SIII would always hang up when running bigger applications, and would always freeze up when pulling up the SwiftKey keyboard. Some apps were almost unusable on the SIII because of these stutters and freezing (ProCapture was the biggest problem). I'm really impressed at how good the camera sensor is. The color, contrast, and brightness of the screen are also incredible. I've had better luck with 4G data, though I do notice a little less speed on Wifi after losing 5 gHz connectivity. The audio on the phone is an improvement, with the two larger speakers on the front of the device. Call clarity has been about as good as the SIII, in my tests. The phone construction is very solid, and seems very rugged in general. I was very happy with the upgrade, from the Galaxy SIII. For my purposes, it's a great phone. I like that it's water resistant, and it performs very well. My girlfriend ended up upgrading to the same phone, from an HTC Desire 816, and she's very happy with the performance boost. It's definitely NOT a flagship phone, and it's only suitable for lower-end or older games. This is not a power user phone, by any means. The smaller storage is probably the biggest limitation. While it hasn't greatly affected me, as I only have a few big apps, but it's definitely the most profound limitation of the phone. If you don't need the power and space of a flagship phone, but still want a very high-quality all-weather handset, I think this is an excellent option. The price jumps around, so if you wait around for a small discount, this is probably one of the better deals on the current phone market. It suits my needs very well, and - having survived being caught in a few big downpours - has been worth every penny. Sept. 2016 Update: For a few weeks, I was having problems with the SD Micro card becoming unmounted, or write problems on the SD Micro card. I assumed it was loosening up in the case (a problem I had with an older phone). Eventually it would refuse to re-mount, despite all attempts. It turned out the phone was having specific problems with the Samsung 32GB EVO Plus Class 10 Micro SDHC, that several other Moto G3 users experienced. I replaced it with a Class 6 Kingston card, and it's been working flawlessly ever since, without any noticeable decrease in read/write speeds.",
                "review_author": " Mr. Staack"
            },
            {
                "review_header": "Very good for Virgin Mobile.",
                "review_posted_date": "25 Apr 2016",
                "review_rating": "5.0 ",
                "review_comment_count": "1",
                "review_text": "This phone is one of the best I have had from Virgin Mobile, and know it would be better with T-Mobile or another GSM carrier with the extra specs those add. The camera is very nice for such a cheap phone, 13mp in the back, 5mp in the front. Works well in relatively low lighting and doesn't begin to look grainy until it's obviously much too dark, such as outside in the night with a fire for just light like the stone ages. Anyway, it's not the best camera, but definitely better than the LG Volt and LG G Stylo I had had before this one. The screen isn't brilliantly bright and crisp, but I promise it doesn't look horribly. The screen is big, but not too big, more comfortable than the LG G Stylo in my personal opinion, but if you like \"Phablets\", this is a big small, but you'd probably get used to it. The ram is only 1gb in the Virgin Mobile edition, and only 4.5gb of internal storage available to the user, even though it advertises 8gb. The other phone with the GSM carriers have 2gb of ram, and 16gb or storage with only 10gb or so left for the users accessibility. It comes with Lollipop, although I am sure the Marshmellow update wouldn't be long to hit considering it did hit the LG G Stylo quickly, and this phone is the 2015 successor of the Moto G lineups. The phone is able to be rooted, although I do not advise for it will void your warranty with Motorola and possibly Virgin Mobile, so you should know what you are doing. However, this should be brought up because Virgin Mobile carries a variety of cheap phones, but they are mostly LG. LG should not be rooted because they end up killing over and are touchy. Motorola is more laid back, and it should be noted so people know what they should and shouldn't if they are not experienced and want to try new things. Yes, this phone is water resistant, but not water proof. You can not swim with it and epect to use it under water. This is purely for accidents only. You can use this near water and if something splashes on it, it will be fine. You must remember to seal the back near the camera and the edges, or it will completely useless and you will lose your phone to water damage. The biggest con is the bit of crashes I have experienced on such little use. The play store crashes immediately when trying to type, and many other things end up crashing. This may not be a problem to all, but to me it was and should be noted. This does have an LED to those who care about that little helpful feature, however it is not able to be used for anything other than battery purposes, so you don't get anything very helpful from it. There is the feature Moto Display which shows your notifications on the screen in a specific way and there are settings for you to mess with. Over all this phone is a very great phone for the price and something that people can greatly appreciate for a low budget.",
                "review_author": " Veronica Hale"
            },
            {
                "review_header": "The Moto G is a significant upgrade over the Galaxy S2",
                "review_posted_date": "24 Mar 2016",
                "review_rating": "4.0 ",
                "review_comment_count": "1",
                "review_text": "So far, I'm very happy with this phone. The 8GB of internal memory is actually 4.54 gb of usable storage. I was worried that it wouldn't be sufficient for my needs but after installing my favorite apps I still have 2 gb left over. This phone replaced my 4 year old Galaxy S2. Comparing the two phones is like apples and oranges. Yes they are both phones but the Moto G does everything better than the S2 even if it has less internal memory (The S2 has 16GB) and lacks the NFC feature of the S2. The trade off is more than worth it. The Moto is faster, takes higher quality photos (in daylight) with a faster shutter speed, the speakerphone is really loud, and the battery life is amazing. After a full day of use my battery only dropped down to 70%. I didn't play any video games or use FB during that time but I did watch You Tube and used other apps that would have killed the battery on my S2 in less than 3 hours.",
                "review_author": " Chris Frost"
            }
        ],
        "price": "",
        "url": "http://www.amazon.com/dp/B017HW9DEW",
        "ratings": {
            "3 star": "9%",
            "4 star": "19%",
            "1 star": "18%",
            "2 star": "16%",
            "5 star": "38%"
        },
        "name": "Motorola Moto G (3rd Generation) No Contract Phone (Virgin Mobile) - Retail Packaging"
    }
]